TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:47 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_2ch_f.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Fri Dec 19 17:46:47 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dlog_2ch_f.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              ;       C:\ti\ccs2031\ccs\tools\compiler\ti-cgt-c2000_22.6.2.LTS\bin\opt2000.exe C:\\Users\\Teddy\\AppData\\L

     228 00000034 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |69| 
     229 00000035 D00A          MOVB      XAR0,#10              ; [CPU_ALU] |69| 
     230 00000036 E2AF          MOV32     R0H,*+XAR4[AR0]       ; [CPU_FPU] |69| 
         00000037 0094 
     231 00000038 E2AF          MOV32     R1H,*+XAR5[0]         ; [CPU_FPU] |69| 
         00000039 01C5 
     232 0000003a E694          CMPF32    R1H,R0H               ; [CPU_FPU] |69| 
         0000003b 0001 
     233 0000003c AD14          MOVST0    ZF, NF                ; [CPU_FPU] |69| 
     234 0000003d 650B          B         ||$C$L3||,LEQ         ; [CPU_ALU] |69| 
     235                      ; branchcc occurs ; [] |69| 
     236 0000003e D008          MOVB      XAR0,#8               ; [CPU_ALU] |69| 
     237 0000003f E2AF          MOV32     R1H,*+XAR4[AR0]       ; [CPU_FPU] |69| 
         00000040 0194 
     238 00000041 E694          CMPF32    R1H,R0H               ; [CPU_FPU] |69| 
         00000042 0001 
     239 00000043 AD14          MOVST0    ZF, NF                ; [CPU_FPU] |69| 
     240                      .dwpsn  file "../sources/dlog_2ch_f.c",line 72,column 17,is_stmt,isa 0
     241 00000044 56B4          MOVB      XAR0,#12,LT           ; [CPU_ALU] |72| 
         00000045 0CA0 
     242 00000046 56B4          MOVB      *+XAR4[AR0],#2,LT     ; [CPU_ALU] |72| 
         00000047 0294 
     243 00000048       ||$C$L3||:    
     244                      .dwpsn  file "../sources/dlog_2ch_f.c",line 95,column 2,is_stmt,isa 0
     245 00000048 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |95| 
     246 00000049 D008          MOVB      XAR0,#8               ; [CPU_ALU] |95| 
     247 0000004a 06C5          MOVL      ACC,*+XAR5[0]         ; [CPU_ALU] |95| 
     248 0000004b FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     249                      .dwcfi  cfa_offset, -4
     250 0000004c 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_ALU] |95| 
     251 0000004d 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     252                      .dwcfi  cfa_offset, -2
     253                      .dwcfi  restore_reg, 7
     254              $C$DW$8 .dwtag  DW_TAG_TI_branch
     255                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     256                      .dwattr $C$DW$8, DW_AT_TI_return
     257              
     258 0000004e 0006          LRETR     ; [CPU_ALU] 
     259                      ; return occurs ; [] 
     260                      .dwattr $C$DW$5, DW_AT_TI_end_file("../sources/dlog_2ch_f.c")
     261                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x60)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:47 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_2ch_f.asm                                                       PAGE    6

     262                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     263                      .dwendentry
     264                      .dwendtag $C$DW$5
     265              
     266              
     267              ;***************************************************************
     268              ;* BUILD ATTRIBUTES                                            *
     269              ;***************************************************************
     270                      .battr "c28xabi", Tag_File, 1, Tag_float_args(0)
     271                      .battr "c28xabi", Tag_File, 1, Tag_double_args(0)
     272                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     273              
     274              ;***************************************************************
     275              ;* DWARF CIE ENTRIES                                           *
     276              ;***************************************************************
     277              
     278              $C$DW$CIE       .dwcie 26
     279                      .dwcfi  cfa_register, 20
     280                      .dwcfi  cfa_offset, 0
     281                      .dwcfi  same_value, 28
     282                      .dwcfi  same_value, 6
     283                      .dwcfi  same_value, 7
     284                      .dwcfi  same_value, 8
     285                      .dwcfi  same_value, 9
     286                      .dwcfi  same_value, 10
     287                      .dwcfi  same_value, 11
     288                      .dwcfi  same_value, 59
     289                      .dwcfi  same_value, 63
     290                      .dwcfi  same_value, 67
     291                      .dwcfi  same_value, 71
     292                      .dwendentry
     293                      .dwendtag $C$DW$CU
     294              
     295              
     296              ;***************************************************************
     297              ;* TYPE INFORMATION                                            *
     298              ;***************************************************************
     299              
     300              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
     301                      .dwmtype  $C$DW$T$23
     302              
     303              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     304                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x12)
     305              $C$DW$9 .dwtag  DW_TAG_member
     306                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     307                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     308                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     309                      .dwattr $C$DW$9, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     310                      .dwattr $C$DW$9, DW_AT_decl_line(0x32)
     311                      .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     312              
     313              $C$DW$10        .dwtag  DW_TAG_member
     314                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     315                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     316                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:47 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_2ch_f.asm                                                       PAGE    7

     317                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     318                      .dwattr $C$DW$10, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     319                      .dwattr $C$DW$10, DW_AT_decl_line(0x33)
     320                      .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     321              
     322              $C$DW$11        .dwtag  DW_TAG_member
     323                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     324                      .dwattr $C$DW$11, DW_AT_name("output_ptr1")
     325                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     326                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     327                      .dwattr $C$DW$11, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     328                      .dwattr $C$DW$11, DW_AT_decl_line(0x34)
     329                      .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     330              
     331              $C$DW$12        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     333                      .dwattr $C$DW$12, DW_AT_name("output_ptr2")
     334                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     335                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     336                      .dwattr $C$DW$12, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     337                      .dwattr $C$DW$12, DW_AT_decl_line(0x35)
     338                      .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     339              
     340              $C$DW$13        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     342                      .dwattr $C$DW$13, DW_AT_name("prev_value")
     343                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     344                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     345                      .dwattr $C$DW$13, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     346                      .dwattr $C$DW$13, DW_AT_decl_line(0x36)
     347                      .dwattr $C$DW$13, DW_AT_decl_column(0x0c)
     348              
     349              $C$DW$14        .dwtag  DW_TAG_member
     350                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     351                      .dwattr $C$DW$14, DW_AT_name("trig_value")
     352                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     353                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     354                      .dwattr $C$DW$14, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     355                      .dwattr $C$DW$14, DW_AT_decl_line(0x37)
     356                      .dwattr $C$DW$14, DW_AT_decl_column(0x0c)
     357              
     358              $C$DW$15        .dwtag  DW_TAG_member
     359                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$22)
     360                      .dwattr $C$DW$15, DW_AT_name("status")
     361                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     362                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     363                      .dwattr $C$DW$15, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     364                      .dwattr $C$DW$15, DW_AT_decl_line(0x38)
     365                      .dwattr $C$DW$15, DW_AT_decl_column(0x0a)
     366              
     367              $C$DW$16        .dwtag  DW_TAG_member
     368                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$22)
     369                      .dwattr $C$DW$16, DW_AT_name("pre_scalar")
     370                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     371                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:47 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_2ch_f.asm                                                       PAGE    8

     372                      .dwattr $C$DW$16, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     373                      .dwattr $C$DW$16, DW_AT_decl_line(0x39)
     374                      .dwattr $C$DW$16, DW_AT_decl_column(0x0a)
     375              
     376              $C$DW$17        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$22)
     378                      .dwattr $C$DW$17, DW_AT_name("skip_count")
     379                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     380                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     381                      .dwattr $C$DW$17, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     382                      .dwattr $C$DW$17, DW_AT_decl_line(0x3a)
     383                      .dwattr $C$DW$17, DW_AT_decl_column(0x0a)
     384              
     385              $C$DW$18        .dwtag  DW_TAG_member
     386                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$22)
     387                      .dwattr $C$DW$18, DW_AT_name("size")
     388                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     389                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     390                      .dwattr $C$DW$18, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     391                      .dwattr $C$DW$18, DW_AT_decl_line(0x3b)
     392                      .dwattr $C$DW$18, DW_AT_decl_column(0x0a)
     393              
     394              $C$DW$19        .dwtag  DW_TAG_member
     395                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$22)
     396                      .dwattr $C$DW$19, DW_AT_name("count")
     397                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     398                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     399                      .dwattr $C$DW$19, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     400                      .dwattr $C$DW$19, DW_AT_decl_line(0x3c)
     401                      .dwattr $C$DW$19, DW_AT_decl_column(0x0a)
     402              
     403                      .dwattr $C$DW$T$23, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     404                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x31)
     405                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
     406                      .dwendtag $C$DW$T$23
     407              
     408                      .dwendtag $C$DW$TU$23
     409              
     410              
     411              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
     412                      .dwmtype  $C$DW$T$24
     413              $C$DW$T$24      .dwtag  DW_TAG_typedef
     414                      .dwattr $C$DW$T$24, DW_AT_name("DLOG_2CH_F")
     415                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     416                      .dwattr $C$DW$T$24, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
     417                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x3d)
     418                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x02)
     419              
     420                      .dwendtag $C$DW$TU$24
     421              
     422              
     423              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
     424                      .dwmtype  $C$DW$T$25
     425              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     426                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:47 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_2ch_f.asm                                                       PAGE    9

     427                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
     428              
     429                      .dwendtag $C$DW$TU$25
     430              
     431              
     432              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
     433                      .dwmtype  $C$DW$T$26
     434              $C$DW$20        .dwtag  DW_TAG_TI_far_type
     435                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     436              
     437              $C$DW$T$26      .dwtag  DW_TAG_const_type
     438                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$20)
     439              
     440                      .dwendtag $C$DW$TU$26
     441              
     442              
     443              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
     444                      .dwmtype  $C$DW$T$2
     445              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     446                      .dwattr $C$DW$T$2, DW_AT_name("void")
     447              
     448                      .dwendtag $C$DW$TU$2
     449              
     450              
     451              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
     452                      .dwmtype  $C$DW$T$4
     453              $C$DW$T$4       .dwtag  DW_TAG_base_type
     454                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     455                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     456                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     457              
     458                      .dwendtag $C$DW$TU$4
     459              
     460              
     461              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
     462                      .dwmtype  $C$DW$T$5
     463              $C$DW$T$5       .dwtag  DW_TAG_base_type
     464                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     465                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     466                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     467              
