TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Mon Dec 22 12:49:19 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DLOG_2CH_F_FUNC")

    5434                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5435                      .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    5436                      .dwattr $C$DW$T$121, DW_AT_decl_line(0x4c)
    5437                      .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    5438              
    5439                      .dwendtag $C$DW$TU$121
    5440              
    5441              
    5442              $C$DW$TU$122    .dwtag  DW_TAG_type_unit
    5443                      .dwmtype  $C$DW$T$122
    5444              
    5445              $C$DW$T$122     .dwtag  DW_TAG_enumeration_type
    5446                      .dwattr $C$DW$T$122, DW_AT_byte_size(0x01)
    5447              $C$DW$244       .dwtag  DW_TAG_enumerator
    5448                      .dwattr $C$DW$244, DW_AT_name("CTRL_STOP")
    5449                      .dwattr $C$DW$244, DW_AT_const_value(0x00)
    5450                      .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    5451                      .dwattr $C$DW$244, DW_AT_decl_line(0x64)
    5452                      .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    5453              
    5454              $C$DW$245       .dwtag  DW_TAG_enumerator
    5455                      .dwattr $C$DW$245, DW_AT_name("CTRL_RUN")
    5456                      .dwattr $C$DW$245, DW_AT_const_value(0x01)
    5457                      .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  113

    5458                      .dwattr $C$DW$245, DW_AT_decl_line(0x65)
    5459                      .dwattr $C$DW$245, DW_AT_decl_column(0x05)
    5460              
    5461              $C$DW$246       .dwtag  DW_TAG_enumerator
    5462                      .dwattr $C$DW$246, DW_AT_name("CTRL_BRAKE")
    5463                      .dwattr $C$DW$246, DW_AT_const_value(0x02)
    5464                      .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    5465                      .dwattr $C$DW$246, DW_AT_decl_line(0x66)
    5466                      .dwattr $C$DW$246, DW_AT_decl_column(0x05)
    5467              
    5468              $C$DW$247       .dwtag  DW_TAG_enumerator
    5469                      .dwattr $C$DW$247, DW_AT_name("CTRL_RESET")
    5470                      .dwattr $C$DW$247, DW_AT_const_value(0x03)
    5471                      .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    5472                      .dwattr $C$DW$247, DW_AT_decl_line(0x67)
    5473                      .dwattr $C$DW$247, DW_AT_decl_column(0x05)
    5474              
    5475              $C$DW$248       .dwtag  DW_TAG_enumerator
    5476                      .dwattr $C$DW$248, DW_AT_name("CTRL_FAULT")
    5477                      .dwattr $C$DW$248, DW_AT_const_value(0x04)
    5478                      .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    5479                      .dwattr $C$DW$248, DW_AT_decl_line(0x68)
    5480                      .dwattr $C$DW$248, DW_AT_decl_column(0x05)
    5481              
    5482                      .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    5483                      .dwattr $C$DW$T$122, DW_AT_decl_line(0x63)
    5484                      .dwattr $C$DW$T$122, DW_AT_decl_column(0x01)
    5485                      .dwendtag $C$DW$T$122
    5486              
    5487                      .dwendtag $C$DW$TU$122
    5488              
    5489              
    5490              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    5491                      .dwmtype  $C$DW$T$123
    5492              $C$DW$T$123     .dwtag  DW_TAG_typedef
    5493                      .dwattr $C$DW$T$123, DW_AT_name("CtrlState_e")
    5494                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    5495                      .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    5496                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x69)
    5497                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x03)
    5498              
    5499                      .dwendtag $C$DW$TU$123
    5500              
    5501              
    5502              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    5503                      .dwmtype  $C$DW$T$20
    5504              
    5505              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5506                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    5507              $C$DW$249       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    5509                      .dwattr $C$DW$249, DW_AT_name("Freq")
    5510                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5511                      .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5512                      .dwattr $C$DW$249, DW_AT_decl_line(0x29)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  114

    5513                      .dwattr $C$DW$249, DW_AT_decl_column(0x1d)
    5514              
    5515              $C$DW$250       .dwtag  DW_TAG_member
    5516                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    5517                      .dwattr $C$DW$250, DW_AT_name("StepAngleMax")
    5518                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5519                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5520                      .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5521                      .dwattr $C$DW$250, DW_AT_decl_line(0x2a)
    5522                      .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    5523              
    5524              $C$DW$251       .dwtag  DW_TAG_member
    5525                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    5526                      .dwattr $C$DW$251, DW_AT_name("Angle")
    5527                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5528                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5529                      .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5530                      .dwattr $C$DW$251, DW_AT_decl_line(0x2b)
    5531                      .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    5532              
    5533              $C$DW$252       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    5535                      .dwattr $C$DW$252, DW_AT_name("Gain")
    5536                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5537                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5538                      .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5539                      .dwattr $C$DW$252, DW_AT_decl_line(0x2c)
    5540                      .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    5541              
    5542              $C$DW$253       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    5544                      .dwattr $C$DW$253, DW_AT_name("Out")
    5545                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5546                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5547                      .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5548                      .dwattr $C$DW$253, DW_AT_decl_line(0x2d)
    5549                      .dwattr $C$DW$253, DW_AT_decl_column(0x11)
    5550              
    5551              $C$DW$254       .dwtag  DW_TAG_member
    5552                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    5553                      .dwattr $C$DW$254, DW_AT_name("Offset")
    5554                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5555                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5556                      .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5557                      .dwattr $C$DW$254, DW_AT_decl_line(0x2e)
    5558                      .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    5559              
    5560                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5561                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x29)
    5562                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    5563                      .dwendtag $C$DW$T$20
    5564              
    5565                      .dwendtag $C$DW$TU$20
    5566              
    5567              
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  115

    5568              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5569                      .dwmtype  $C$DW$T$94
    5570              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5571                      .dwattr $C$DW$T$94, DW_AT_name("RAMPGEN")
    5572                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
    5573                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5574                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x2f)
    5575                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0d)
    5576              
    5577                      .dwendtag $C$DW$TU$94
    5578              
    5579              
    5580              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5581                      .dwmtype  $C$DW$T$23
    5582              
    5583              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5584                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    5585              $C$DW$255       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    5587                      .dwattr $C$DW$255, DW_AT_name("TargetValue")
    5588                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5589                      .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5590                      .dwattr $C$DW$255, DW_AT_decl_line(0x2b)
    5591                      .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    5592              
    5593              $C$DW$256       .dwtag  DW_TAG_member
    5594                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$22)
    5595                      .dwattr $C$DW$256, DW_AT_name("RampDelayMax")
    5596                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5597                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5598                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5599                      .dwattr $C$DW$256, DW_AT_decl_line(0x2c)
    5600                      .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    5601              
    5602              $C$DW$257       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    5604                      .dwattr $C$DW$257, DW_AT_name("RampLowLimit")
    5605                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5606                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5607                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5608                      .dwattr $C$DW$257, DW_AT_decl_line(0x2d)
    5609                      .dwattr $C$DW$257, DW_AT_decl_column(0x0f)
    5610              
    5611              $C$DW$258       .dwtag  DW_TAG_member
    5612                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    5613                      .dwattr $C$DW$258, DW_AT_name("RampHighLimit")
    5614                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5615                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5616                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5617                      .dwattr $C$DW$258, DW_AT_decl_line(0x2e)
    5618                      .dwattr $C$DW$258, DW_AT_decl_column(0x0f)
    5619              
    5620              $C$DW$259       .dwtag  DW_TAG_member
    5621                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$22)
    5622                      .dwattr $C$DW$259, DW_AT_name("RampDelayCount")
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  116

    5623                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5624                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5625                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5626                      .dwattr $C$DW$259, DW_AT_decl_line(0x2f)
    5627                      .dwattr $C$DW$259, DW_AT_decl_column(0x0c)
    5628              
    5629              $C$DW$260       .dwtag  DW_TAG_member
    5630                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    5631                      .dwattr $C$DW$260, DW_AT_name("SetpointValue")
    5632                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5633                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5634                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5635                      .dwattr $C$DW$260, DW_AT_decl_line(0x30)
    5636                      .dwattr $C$DW$260, DW_AT_decl_column(0x0c)
    5637              
    5638              $C$DW$261       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
    5640                      .dwattr $C$DW$261, DW_AT_name("EqualFlag")
    5641                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5642                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5643                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5644                      .dwattr $C$DW$261, DW_AT_decl_line(0x31)
    5645                      .dwattr $C$DW$261, DW_AT_decl_column(0x0c)
    5646              
    5647              $C$DW$262       .dwtag  DW_TAG_member
    5648                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    5649                      .dwattr $C$DW$262, DW_AT_name("Tmp")
    5650                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5651                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5652                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5653                      .dwattr $C$DW$262, DW_AT_decl_line(0x32)
    5654                      .dwattr $C$DW$262, DW_AT_decl_column(0x0c)
    5655              
    5656                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5657                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x2a)
    5658                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    5659                      .dwendtag $C$DW$T$23
    5660              
    5661                      .dwendtag $C$DW$TU$23
    5662              
    5663              
    5664              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    5665                      .dwmtype  $C$DW$T$95
    5666              $C$DW$T$95      .dwtag  DW_TAG_typedef
    5667                      .dwattr $C$DW$T$95, DW_AT_name("RMPCNTL")
    5668                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$23)
    5669                      .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5670                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x33)
    5671                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    5672              
    5673                      .dwendtag $C$DW$TU$95
    5674              
    5675              
    5676              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5677                      .dwmtype  $C$DW$T$26
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  117

    5678              
    5679              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5680                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    5681              $C$DW$263       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    5683                      .dwattr $C$DW$263, DW_AT_name("ElecTheta")
    5684                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5685                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5686                      .dwattr $C$DW$263, DW_AT_decl_line(0x2b)
    5687                      .dwattr $C$DW$263, DW_AT_decl_column(0x12)
    5688              
    5689              $C$DW$264       .dwtag  DW_TAG_member
    5690                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$22)
    5691                      .dwattr $C$DW$264, DW_AT_name("DirectionQep")
    5692                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5693                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5694                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5695                      .dwattr $C$DW$264, DW_AT_decl_line(0x2c)
    5696                      .dwattr $C$DW$264, DW_AT_decl_column(0x11)
    5697              
    5698              $C$DW$265       .dwtag  DW_TAG_member
    5699                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    5700                      .dwattr $C$DW$265, DW_AT_name("OldElecTheta")
    5701                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5702                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5703                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5704                      .dwattr $C$DW$265, DW_AT_decl_line(0x2d)
    5705                      .dwattr $C$DW$265, DW_AT_decl_column(0x12)
    5706              
    5707              $C$DW$266       .dwtag  DW_TAG_member
    5708                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    5709                      .dwattr $C$DW$266, DW_AT_name("Speed")
    5710                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5711                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5712                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5713                      .dwattr $C$DW$266, DW_AT_decl_line(0x2e)
    5714                      .dwattr $C$DW$266, DW_AT_decl_column(0x12)
    5715              
    5716              $C$DW$267       .dwtag  DW_TAG_member
    5717                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    5718                      .dwattr $C$DW$267, DW_AT_name("BaseRpm")
    5719                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5720                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5721                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5722                      .dwattr $C$DW$267, DW_AT_decl_line(0x2f)
    5723                      .dwattr $C$DW$267, DW_AT_decl_column(0x11)
    5724              
    5725              $C$DW$268       .dwtag  DW_TAG_member
    5726                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    5727                      .dwattr $C$DW$268, DW_AT_name("K1")
    5728                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5729                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5730                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5731                      .dwattr $C$DW$268, DW_AT_decl_line(0x30)
    5732                      .dwattr $C$DW$268, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  118

    5733              
    5734              $C$DW$269       .dwtag  DW_TAG_member
    5735                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    5736                      .dwattr $C$DW$269, DW_AT_name("K2")
    5737                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5738                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5739                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5740                      .dwattr $C$DW$269, DW_AT_decl_line(0x31)
    5741                      .dwattr $C$DW$269, DW_AT_decl_column(0x12)
    5742              
    5743              $C$DW$270       .dwtag  DW_TAG_member
    5744                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    5745                      .dwattr $C$DW$270, DW_AT_name("K3")
    5746                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5747                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5748                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5749                      .dwattr $C$DW$270, DW_AT_decl_line(0x32)
    5750                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    5751              
    5752              $C$DW$271       .dwtag  DW_TAG_member
    5753                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
    5754                      .dwattr $C$DW$271, DW_AT_name("SpeedRpm")
    5755                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5756                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5757                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5758                      .dwattr $C$DW$271, DW_AT_decl_line(0x33)
    5759                      .dwattr $C$DW$271, DW_AT_decl_column(0x10)
    5760              
    5761              $C$DW$272       .dwtag  DW_TAG_member
    5762                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    5763                      .dwattr $C$DW$272, DW_AT_name("Tmp")
    5764                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5765                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5766                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5767                      .dwattr $C$DW$272, DW_AT_decl_line(0x34)
    5768                      .dwattr $C$DW$272, DW_AT_decl_column(0x12)
    5769              
    5770                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5771                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    5772                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5773                      .dwendtag $C$DW$T$26
    5774              
    5775                      .dwendtag $C$DW$TU$26
    5776              
    5777              
    5778              $C$DW$TU$100    .dwtag  DW_TAG_type_unit
    5779                      .dwmtype  $C$DW$T$100
    5780              $C$DW$T$100     .dwtag  DW_TAG_typedef
    5781                      .dwattr $C$DW$T$100, DW_AT_name("SPEED_MEAS_QEP")
    5782                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$26)
    5783                      .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    5784                      .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
    5785                      .dwattr $C$DW$T$100, DW_AT_decl_column(0x0a)
    5786              
    5787                      .dwendtag $C$DW$TU$100
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  119

    5788              
    5789              
    5790              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5791                      .dwmtype  $C$DW$T$27
    5792              
    5793              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5794                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    5795              $C$DW$273       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$12)
    5797                      .dwattr $C$DW$273, DW_AT_name("quot")
    5798                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5799                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5800                      .dwattr $C$DW$273, DW_AT_decl_line(0x59)
    5801                      .dwattr $C$DW$273, DW_AT_decl_column(0x17)
    5802              
    5803              $C$DW$274       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$12)
    5805                      .dwattr $C$DW$274, DW_AT_name("rem")
    5806                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5807                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5808                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5809                      .dwattr $C$DW$274, DW_AT_decl_line(0x59)
    5810                      .dwattr $C$DW$274, DW_AT_decl_column(0x1d)
    5811              
    5812                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5813                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x59)
    5814                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    5815                      .dwendtag $C$DW$T$27
    5816              
    5817                      .dwendtag $C$DW$TU$27
    5818              
    5819              
    5820              $C$DW$TU$130    .dwtag  DW_TAG_type_unit
    5821                      .dwmtype  $C$DW$T$130
    5822              $C$DW$T$130     .dwtag  DW_TAG_typedef
    5823                      .dwattr $C$DW$T$130, DW_AT_name("ldiv_t")
    5824                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$27)
    5825                      .dwattr $C$DW$T$130, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5826                      .dwattr $C$DW$T$130, DW_AT_decl_line(0x59)
    5827                      .dwattr $C$DW$T$130, DW_AT_decl_column(0x24)
    5828              
    5829                      .dwendtag $C$DW$TU$130
    5830              
    5831              
    5832              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5833                      .dwmtype  $C$DW$T$28
    5834              
    5835              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5836                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    5837              $C$DW$275       .dwtag  DW_TAG_member
    5838                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$14)
    5839                      .dwattr $C$DW$275, DW_AT_name("quot")
    5840                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5841                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5842                      .dwattr $C$DW$275, DW_AT_decl_line(0x63)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  120

    5843                      .dwattr $C$DW$275, DW_AT_decl_column(0x1c)
    5844              
    5845              $C$DW$276       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$14)
    5847                      .dwattr $C$DW$276, DW_AT_name("rem")
    5848                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5849                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5850                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5851                      .dwattr $C$DW$276, DW_AT_decl_line(0x63)
    5852                      .dwattr $C$DW$276, DW_AT_decl_column(0x22)
    5853              
    5854                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5855                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x63)
    5856                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5857                      .dwendtag $C$DW$T$28
    5858              
    5859                      .dwendtag $C$DW$TU$28
    5860              
    5861              
    5862              $C$DW$TU$133    .dwtag  DW_TAG_type_unit
    5863                      .dwmtype  $C$DW$T$133
    5864              $C$DW$T$133     .dwtag  DW_TAG_typedef
    5865                      .dwattr $C$DW$T$133, DW_AT_name("lldiv_t")
    5866                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$28)
    5867                      .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5868                      .dwattr $C$DW$T$133, DW_AT_decl_line(0x63)
    5869                      .dwattr $C$DW$T$133, DW_AT_decl_column(0x29)
    5870              
    5871                      .dwendtag $C$DW$TU$133
    5872              
    5873              
    5874              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5875                      .dwmtype  $C$DW$T$29
    5876              
    5877              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5878                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    5879              $C$DW$277       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    5881                      .dwattr $C$DW$277, DW_AT_name("As")
    5882                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5883                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5884                      .dwattr $C$DW$277, DW_AT_decl_line(0x2a)
    5885                      .dwattr $C$DW$277, DW_AT_decl_column(0x1e)
    5886              
    5887              $C$DW$278       .dwtag  DW_TAG_member
    5888                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    5889                      .dwattr $C$DW$278, DW_AT_name("Bs")
    5890                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5891                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5892                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5893                      .dwattr $C$DW$278, DW_AT_decl_line(0x2b)
    5894                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    5895              
    5896              $C$DW$279       .dwtag  DW_TAG_member
    5897                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  121

    5898                      .dwattr $C$DW$279, DW_AT_name("Cs")
    5899                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5900                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5901                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5902                      .dwattr $C$DW$279, DW_AT_decl_line(0x2c)
    5903                      .dwattr $C$DW$279, DW_AT_decl_column(0x12)
    5904              
    5905              $C$DW$280       .dwtag  DW_TAG_member
    5906                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    5907                      .dwattr $C$DW$280, DW_AT_name("Alpha")
    5908                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5909                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5910                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5911                      .dwattr $C$DW$280, DW_AT_decl_line(0x2d)
    5912                      .dwattr $C$DW$280, DW_AT_decl_column(0x12)
    5913              
    5914              $C$DW$281       .dwtag  DW_TAG_member
    5915                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    5916                      .dwattr $C$DW$281, DW_AT_name("Beta")
    5917                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5918                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5919                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5920                      .dwattr $C$DW$281, DW_AT_decl_line(0x2e)
    5921                      .dwattr $C$DW$281, DW_AT_decl_column(0x12)
    5922              
    5923                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5924                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x2a)
    5925                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5926                      .dwendtag $C$DW$T$29
    5927              
    5928                      .dwendtag $C$DW$TU$29
    5929              
    5930              
    5931              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    5932                      .dwmtype  $C$DW$T$96
    5933              $C$DW$T$96      .dwtag  DW_TAG_typedef
    5934                      .dwattr $C$DW$T$96, DW_AT_name("CLARKE")
    5935                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$29)
    5936                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5937                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x2f)
    5938                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x09)
    5939              
    5940                      .dwendtag $C$DW$TU$96
    5941              
    5942              
    5943              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5944                      .dwmtype  $C$DW$T$30
    5945              
    5946              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5947                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
    5948              $C$DW$282       .dwtag  DW_TAG_member
    5949                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5950                      .dwattr $C$DW$282, DW_AT_name("Alpha")
    5951                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5952                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  122

    5953                      .dwattr $C$DW$282, DW_AT_decl_line(0x29)
    5954                      .dwattr $C$DW$282, DW_AT_decl_column(0x1e)
    5955              
    5956              $C$DW$283       .dwtag  DW_TAG_member
    5957                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5958                      .dwattr $C$DW$283, DW_AT_name("Beta")
    5959                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5960                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5961                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5962                      .dwattr $C$DW$283, DW_AT_decl_line(0x2a)
    5963                      .dwattr $C$DW$283, DW_AT_decl_column(0x12)
    5964              
    5965              $C$DW$284       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    5967                      .dwattr $C$DW$284, DW_AT_name("Angle")
    5968                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5969                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5970                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5971                      .dwattr $C$DW$284, DW_AT_decl_line(0x2b)
    5972                      .dwattr $C$DW$284, DW_AT_decl_column(0x12)
    5973              
    5974              $C$DW$285       .dwtag  DW_TAG_member
    5975                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    5976                      .dwattr $C$DW$285, DW_AT_name("Ds")
    5977                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5978                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5979                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5980                      .dwattr $C$DW$285, DW_AT_decl_line(0x2c)
    5981                      .dwattr $C$DW$285, DW_AT_decl_column(0x12)
    5982              
    5983              $C$DW$286       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    5985                      .dwattr $C$DW$286, DW_AT_name("Qs")
    5986                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5987                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5988                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5989                      .dwattr $C$DW$286, DW_AT_decl_line(0x2d)
    5990                      .dwattr $C$DW$286, DW_AT_decl_column(0x12)
    5991              
    5992              $C$DW$287       .dwtag  DW_TAG_member
    5993                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5994                      .dwattr $C$DW$287, DW_AT_name("Sine")
    5995                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5996                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5997                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5998                      .dwattr $C$DW$287, DW_AT_decl_line(0x2e)
    5999                      .dwattr $C$DW$287, DW_AT_decl_column(0x12)
    6000              
    6001              $C$DW$288       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    6003                      .dwattr $C$DW$288, DW_AT_name("Cosine")
    6004                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6005                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    6006                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6007                      .dwattr $C$DW$288, DW_AT_decl_line(0x2f)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  123

    6008                      .dwattr $C$DW$288, DW_AT_decl_column(0x12)
    6009              
    6010                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6011                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x29)
    6012                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    6013                      .dwendtag $C$DW$T$30
    6014              
    6015                      .dwendtag $C$DW$TU$30
    6016              
    6017              
    6018              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    6019                      .dwmtype  $C$DW$T$97
    6020              $C$DW$T$97      .dwtag  DW_TAG_typedef
    6021                      .dwattr $C$DW$T$97, DW_AT_name("PARK")
    6022                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$30)
    6023                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6024                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x30)
    6025                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x09)
    6026              
    6027                      .dwendtag $C$DW$TU$97
    6028              
    6029              
    6030              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    6031                      .dwmtype  $C$DW$T$31
    6032              
    6033              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6034                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    6035              $C$DW$289       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    6037                      .dwattr $C$DW$289, DW_AT_name("Alpha")
    6038                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    6039                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6040                      .dwattr $C$DW$289, DW_AT_decl_line(0x29)
    6041                      .dwattr $C$DW$289, DW_AT_decl_column(0x1e)
    6042              
    6043              $C$DW$290       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    6045                      .dwattr $C$DW$290, DW_AT_name("Beta")
    6046                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6047                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    6048                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6049                      .dwattr $C$DW$290, DW_AT_decl_line(0x2a)
    6050                      .dwattr $C$DW$290, DW_AT_decl_column(0x12)
    6051              
    6052              $C$DW$291       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    6054                      .dwattr $C$DW$291, DW_AT_name("Angle")
    6055                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6056                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    6057                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6058                      .dwattr $C$DW$291, DW_AT_decl_line(0x2b)
    6059                      .dwattr $C$DW$291, DW_AT_decl_column(0x12)
    6060              
    6061              $C$DW$292       .dwtag  DW_TAG_member
    6062                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  124

    6063                      .dwattr $C$DW$292, DW_AT_name("Ds")
    6064                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6065                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    6066                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6067                      .dwattr $C$DW$292, DW_AT_decl_line(0x2c)
    6068                      .dwattr $C$DW$292, DW_AT_decl_column(0x12)
    6069              
    6070              $C$DW$293       .dwtag  DW_TAG_member
    6071                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    6072                      .dwattr $C$DW$293, DW_AT_name("Qs")
    6073                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6074                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    6075                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6076                      .dwattr $C$DW$293, DW_AT_decl_line(0x2d)
    6077                      .dwattr $C$DW$293, DW_AT_decl_column(0x12)
    6078              
    6079              $C$DW$294       .dwtag  DW_TAG_member
    6080                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    6081                      .dwattr $C$DW$294, DW_AT_name("Sine")
    6082                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6083                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    6084                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6085                      .dwattr $C$DW$294, DW_AT_decl_line(0x2e)
    6086                      .dwattr $C$DW$294, DW_AT_decl_column(0x12)
    6087              
    6088              $C$DW$295       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    6090                      .dwattr $C$DW$295, DW_AT_name("Cosine")
    6091                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6092                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    6093                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6094                      .dwattr $C$DW$295, DW_AT_decl_line(0x2f)
    6095                      .dwattr $C$DW$295, DW_AT_decl_column(0x12)
    6096              
    6097                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6098                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x29)
    6099                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    6100                      .dwendtag $C$DW$T$31
    6101              
    6102                      .dwendtag $C$DW$TU$31
    6103              
    6104              
    6105              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    6106                      .dwmtype  $C$DW$T$98
    6107              $C$DW$T$98      .dwtag  DW_TAG_typedef
    6108                      .dwattr $C$DW$T$98, DW_AT_name("IPARK")
    6109                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$31)
    6110                      .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6111                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x30)
    6112                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x0b)
    6113              
    6114                      .dwendtag $C$DW$TU$98
    6115              
    6116              
    6117              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  125

    6118                      .dwmtype  $C$DW$T$34
    6119              
    6120              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6121                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x12)
    6122              $C$DW$296       .dwtag  DW_TAG_member
    6123                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    6124                      .dwattr $C$DW$296, DW_AT_name("Ualpha")
    6125                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6126                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6127                      .dwattr $C$DW$296, DW_AT_decl_line(0x2b)
    6128                      .dwattr $C$DW$296, DW_AT_decl_column(0x10)
    6129              
    6130              $C$DW$297       .dwtag  DW_TAG_member
    6131                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    6132                      .dwattr $C$DW$297, DW_AT_name("Ubeta")
    6133                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6134                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6135                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6136                      .dwattr $C$DW$297, DW_AT_decl_line(0x2c)
    6137                      .dwattr $C$DW$297, DW_AT_decl_column(0x10)
    6138              
    6139              $C$DW$298       .dwtag  DW_TAG_member
    6140                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    6141                      .dwattr $C$DW$298, DW_AT_name("Ta")
    6142                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6143                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6144                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6145                      .dwattr $C$DW$298, DW_AT_decl_line(0x2d)
    6146                      .dwattr $C$DW$298, DW_AT_decl_column(0x10)
    6147              
    6148              $C$DW$299       .dwtag  DW_TAG_member
    6149                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    6150                      .dwattr $C$DW$299, DW_AT_name("Tb")
    6151                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6152                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6153                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6154                      .dwattr $C$DW$299, DW_AT_decl_line(0x2e)
    6155                      .dwattr $C$DW$299, DW_AT_decl_column(0x10)
    6156              
    6157              $C$DW$300       .dwtag  DW_TAG_member
    6158                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    6159                      .dwattr $C$DW$300, DW_AT_name("Tc")
    6160                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6161                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6162                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6163                      .dwattr $C$DW$300, DW_AT_decl_line(0x2f)
    6164                      .dwattr $C$DW$300, DW_AT_decl_column(0x10)
    6165              
    6166              $C$DW$301       .dwtag  DW_TAG_member
    6167                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    6168                      .dwattr $C$DW$301, DW_AT_name("tmp1")
    6169                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6170                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6171                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6172                      .dwattr $C$DW$301, DW_AT_decl_line(0x30)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  126

    6173                      .dwattr $C$DW$301, DW_AT_decl_column(0x10)
    6174              
    6175              $C$DW$302       .dwtag  DW_TAG_member
    6176                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    6177                      .dwattr $C$DW$302, DW_AT_name("tmp2")
    6178                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6179                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6180                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6181                      .dwattr $C$DW$302, DW_AT_decl_line(0x31)
    6182                      .dwattr $C$DW$302, DW_AT_decl_column(0x10)
    6183              
    6184              $C$DW$303       .dwtag  DW_TAG_member
    6185                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    6186                      .dwattr $C$DW$303, DW_AT_name("tmp3")
    6187                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6188                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6189                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6190                      .dwattr $C$DW$303, DW_AT_decl_line(0x32)
    6191                      .dwattr $C$DW$303, DW_AT_decl_column(0x10)
    6192              
    6193              $C$DW$304       .dwtag  DW_TAG_member
    6194                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$33)
    6195                      .dwattr $C$DW$304, DW_AT_name("VecSector")
    6196                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6197                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6198                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6199                      .dwattr $C$DW$304, DW_AT_decl_line(0x33)
    6200                      .dwattr $C$DW$304, DW_AT_decl_column(0x0b)
    6201              
    6202                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6203                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a)
    6204                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x11)
    6205                      .dwendtag $C$DW$T$34
    6206              
    6207                      .dwendtag $C$DW$TU$34
    6208              
    6209              
    6210              $C$DW$TU$99     .dwtag  DW_TAG_type_unit
    6211                      .dwmtype  $C$DW$T$99
    6212              $C$DW$T$99      .dwtag  DW_TAG_typedef
    6213                      .dwattr $C$DW$T$99, DW_AT_name("SVGEN")
    6214                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$34)
    6215                      .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6216                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x34)
    6217                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x04)
    6218              
    6219                      .dwendtag $C$DW$TU$99
    6220              
    6221              
    6222              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    6223                      .dwmtype  $C$DW$T$35
    6224              
    6225              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6226                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    6227              $C$DW$305       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  127

    6228                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    6229                      .dwattr $C$DW$305, DW_AT_name("Ref")
    6230                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6231                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6232                      .dwattr $C$DW$305, DW_AT_decl_line(0x2a)
    6233                      .dwattr $C$DW$305, DW_AT_decl_column(0x1e)
    6234              
    6235              $C$DW$306       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    6237                      .dwattr $C$DW$306, DW_AT_name("Fbk")
    6238                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6239                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6240                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6241                      .dwattr $C$DW$306, DW_AT_decl_line(0x2b)
    6242                      .dwattr $C$DW$306, DW_AT_decl_column(0x12)
    6243              
    6244              $C$DW$307       .dwtag  DW_TAG_member
    6245                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    6246                      .dwattr $C$DW$307, DW_AT_name("Out")
    6247                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6248                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6249                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6250                      .dwattr $C$DW$307, DW_AT_decl_line(0x2c)
    6251                      .dwattr $C$DW$307, DW_AT_decl_column(0x12)
    6252              
    6253              $C$DW$308       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    6255                      .dwattr $C$DW$308, DW_AT_name("c1")
    6256                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6257                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6258                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6259                      .dwattr $C$DW$308, DW_AT_decl_line(0x2d)
    6260                      .dwattr $C$DW$308, DW_AT_decl_column(0x12)
    6261              
    6262              $C$DW$309       .dwtag  DW_TAG_member
    6263                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    6264                      .dwattr $C$DW$309, DW_AT_name("c2")
    6265                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6266                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6267                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6268                      .dwattr $C$DW$309, DW_AT_decl_line(0x2e)
    6269                      .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    6270              
    6271                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6272                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    6273                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    6274                      .dwendtag $C$DW$T$35
    6275              
    6276                      .dwendtag $C$DW$TU$35
    6277              
    6278              
    6279              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    6280                      .dwmtype  $C$DW$T$38
    6281              $C$DW$T$38      .dwtag  DW_TAG_typedef
    6282                      .dwattr $C$DW$T$38, DW_AT_name("PID_TERMINALS")
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  128

    6283                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    6284                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6285                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    6286                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x07)
    6287              
    6288                      .dwendtag $C$DW$TU$38
    6289              
    6290              
    6291              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    6292                      .dwmtype  $C$DW$T$36
    6293              
    6294              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6295                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    6296              $C$DW$310       .dwtag  DW_TAG_member
    6297                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    6298                      .dwattr $C$DW$310, DW_AT_name("Kr")
    6299                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6300                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6301                      .dwattr $C$DW$310, DW_AT_decl_line(0x32)
    6302                      .dwattr $C$DW$310, DW_AT_decl_column(0x1e)
    6303              
    6304              $C$DW$311       .dwtag  DW_TAG_member
    6305                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    6306                      .dwattr $C$DW$311, DW_AT_name("Kp")
    6307                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6308                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6309                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6310                      .dwattr $C$DW$311, DW_AT_decl_line(0x33)
    6311                      .dwattr $C$DW$311, DW_AT_decl_column(0x12)
    6312              
    6313              $C$DW$312       .dwtag  DW_TAG_member
    6314                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    6315                      .dwattr $C$DW$312, DW_AT_name("Ki")
    6316                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6317                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6318                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6319                      .dwattr $C$DW$312, DW_AT_decl_line(0x34)
    6320                      .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    6321              
    6322              $C$DW$313       .dwtag  DW_TAG_member
    6323                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    6324                      .dwattr $C$DW$313, DW_AT_name("Kd")
    6325                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6326                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6327                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6328                      .dwattr $C$DW$313, DW_AT_decl_line(0x35)
    6329                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    6330              
    6331              $C$DW$314       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    6333                      .dwattr $C$DW$314, DW_AT_name("Km")
    6334                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6335                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6336                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6337                      .dwattr $C$DW$314, DW_AT_decl_line(0x36)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  129

    6338                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    6339              
    6340              $C$DW$315       .dwtag  DW_TAG_member
    6341                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    6342                      .dwattr $C$DW$315, DW_AT_name("Umax")
    6343                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6344                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6345                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6346                      .dwattr $C$DW$315, DW_AT_decl_line(0x37)
    6347                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    6348              
    6349              $C$DW$316       .dwtag  DW_TAG_member
    6350                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    6351                      .dwattr $C$DW$316, DW_AT_name("Umin")
    6352                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6353                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6354                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6355                      .dwattr $C$DW$316, DW_AT_decl_line(0x38)
    6356                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    6357              
    6358                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6359                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x32)
    6360                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    6361                      .dwendtag $C$DW$T$36
    6362              
    6363                      .dwendtag $C$DW$TU$36
    6364              
    6365              
    6366              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    6367                      .dwmtype  $C$DW$T$39
    6368              $C$DW$T$39      .dwtag  DW_TAG_typedef
    6369                      .dwattr $C$DW$T$39, DW_AT_name("PID_PARAMETERS")
    6370                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    6371                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6372                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x39)
    6373                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x07)
    6374              
    6375                      .dwendtag $C$DW$TU$39
    6376              
    6377              
    6378              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    6379                      .dwmtype  $C$DW$T$37
    6380              
    6381              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6382                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    6383              $C$DW$317       .dwtag  DW_TAG_member
    6384                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    6385                      .dwattr $C$DW$317, DW_AT_name("up")
    6386                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6387                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6388                      .dwattr $C$DW$317, DW_AT_decl_line(0x3b)
    6389                      .dwattr $C$DW$317, DW_AT_decl_column(0x1e)
    6390              
    6391              $C$DW$318       .dwtag  DW_TAG_member
    6392                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  130

    6393                      .dwattr $C$DW$318, DW_AT_name("ui")
    6394                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6395                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6396                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6397                      .dwattr $C$DW$318, DW_AT_decl_line(0x3c)
    6398                      .dwattr $C$DW$318, DW_AT_decl_column(0x12)
    6399              
    6400              $C$DW$319       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    6402                      .dwattr $C$DW$319, DW_AT_name("ud")
    6403                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6404                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6405                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6406                      .dwattr $C$DW$319, DW_AT_decl_line(0x3d)
    6407                      .dwattr $C$DW$319, DW_AT_decl_column(0x12)
    6408              
    6409              $C$DW$320       .dwtag  DW_TAG_member
    6410                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    6411                      .dwattr $C$DW$320, DW_AT_name("v1")
    6412                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6413                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6414                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6415                      .dwattr $C$DW$320, DW_AT_decl_line(0x3e)
    6416                      .dwattr $C$DW$320, DW_AT_decl_column(0x12)
    6417              
    6418              $C$DW$321       .dwtag  DW_TAG_member
    6419                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    6420                      .dwattr $C$DW$321, DW_AT_name("i1")
    6421                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6422                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6423                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6424                      .dwattr $C$DW$321, DW_AT_decl_line(0x3f)
    6425                      .dwattr $C$DW$321, DW_AT_decl_column(0x12)
    6426              
    6427              $C$DW$322       .dwtag  DW_TAG_member
    6428                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    6429                      .dwattr $C$DW$322, DW_AT_name("d1")
    6430                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6431                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6432                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6433                      .dwattr $C$DW$322, DW_AT_decl_line(0x40)
    6434                      .dwattr $C$DW$322, DW_AT_decl_column(0x12)
    6435              
    6436              $C$DW$323       .dwtag  DW_TAG_member
    6437                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    6438                      .dwattr $C$DW$323, DW_AT_name("d2")
    6439                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6440                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6441                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6442                      .dwattr $C$DW$323, DW_AT_decl_line(0x41)
    6443                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    6444              
    6445              $C$DW$324       .dwtag  DW_TAG_member
    6446                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    6447                      .dwattr $C$DW$324, DW_AT_name("w1")
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  131

    6448                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6449                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6450                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6451                      .dwattr $C$DW$324, DW_AT_decl_line(0x42)
    6452                      .dwattr $C$DW$324, DW_AT_decl_column(0x12)
    6453              
    6454                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6455                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    6456                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    6457                      .dwendtag $C$DW$T$37
    6458              
    6459                      .dwendtag $C$DW$TU$37
    6460              
    6461              
    6462              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    6463                      .dwmtype  $C$DW$T$40
    6464              $C$DW$T$40      .dwtag  DW_TAG_typedef
    6465                      .dwattr $C$DW$T$40, DW_AT_name("PID_DATA")
    6466                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    6467                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6468                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    6469                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x07)
    6470              
    6471                      .dwendtag $C$DW$TU$40
    6472              
    6473              
    6474              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6475                      .dwmtype  $C$DW$T$41
    6476              
    6477              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6478                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    6479              $C$DW$325       .dwtag  DW_TAG_member
    6480                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$38)
    6481                      .dwattr $C$DW$325, DW_AT_name("term")
    6482                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6483                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6484                      .dwattr $C$DW$325, DW_AT_decl_line(0x46)
    6485                      .dwattr $C$DW$325, DW_AT_decl_column(0x21)
    6486              
    6487              $C$DW$326       .dwtag  DW_TAG_member
    6488                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$39)
    6489                      .dwattr $C$DW$326, DW_AT_name("param")
    6490                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6491                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6492                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6493                      .dwattr $C$DW$326, DW_AT_decl_line(0x47)
    6494                      .dwattr $C$DW$326, DW_AT_decl_column(0x16)
    6495              
    6496              $C$DW$327       .dwtag  DW_TAG_member
    6497                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$40)
    6498                      .dwattr $C$DW$327, DW_AT_name("data")
    6499                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6500                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6501                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6502                      .dwattr $C$DW$327, DW_AT_decl_line(0x48)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  132

    6503                      .dwattr $C$DW$327, DW_AT_decl_column(0x11)
    6504              
    6505                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6506                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    6507                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6508                      .dwendtag $C$DW$T$41
    6509              
    6510                      .dwendtag $C$DW$TU$41
    6511              
    6512              
    6513              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6514                      .dwmtype  $C$DW$T$102
    6515              $C$DW$T$102     .dwtag  DW_TAG_typedef
    6516                      .dwattr $C$DW$T$102, DW_AT_name("PID_CONTROLLER")
    6517                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$41)
    6518                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    6519                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x49)
    6520                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x07)
    6521              
    6522                      .dwendtag $C$DW$TU$102
    6523              
    6524              
    6525              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    6526                      .dwmtype  $C$DW$T$42
    6527              
    6528              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6529                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    6530              $C$DW$328       .dwtag  DW_TAG_member
    6531                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    6532                      .dwattr $C$DW$328, DW_AT_name("Ref")
    6533                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6534                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6535                      .dwattr $C$DW$328, DW_AT_decl_line(0x2a)
    6536                      .dwattr $C$DW$328, DW_AT_decl_column(0x1e)
    6537              
    6538              $C$DW$329       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    6540                      .dwattr $C$DW$329, DW_AT_name("Fbk")
    6541                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6542                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6543                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6544                      .dwattr $C$DW$329, DW_AT_decl_line(0x2b)
    6545                      .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    6546              
    6547              $C$DW$330       .dwtag  DW_TAG_member
    6548                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    6549                      .dwattr $C$DW$330, DW_AT_name("Out")
    6550                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6551                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6552                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6553                      .dwattr $C$DW$330, DW_AT_decl_line(0x2c)
    6554                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    6555              
    6556              $C$DW$331       .dwtag  DW_TAG_member
    6557                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  133

    6558                      .dwattr $C$DW$331, DW_AT_name("Kp")
    6559                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6560                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6561                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6562                      .dwattr $C$DW$331, DW_AT_decl_line(0x2d)
    6563                      .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    6564              
    6565              $C$DW$332       .dwtag  DW_TAG_member
    6566                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    6567                      .dwattr $C$DW$332, DW_AT_name("Ki")
    6568                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6569                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6570                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6571                      .dwattr $C$DW$332, DW_AT_decl_line(0x2e)
    6572                      .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    6573              
    6574              $C$DW$333       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    6576                      .dwattr $C$DW$333, DW_AT_name("Umax")
    6577                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6578                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6579                      .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6580                      .dwattr $C$DW$333, DW_AT_decl_line(0x2f)
    6581                      .dwattr $C$DW$333, DW_AT_decl_column(0x12)
    6582              
    6583              $C$DW$334       .dwtag  DW_TAG_member
    6584                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    6585                      .dwattr $C$DW$334, DW_AT_name("Umin")
    6586                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6587                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6588                      .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6589                      .dwattr $C$DW$334, DW_AT_decl_line(0x30)
    6590                      .dwattr $C$DW$334, DW_AT_decl_column(0x12)
    6591              
    6592              $C$DW$335       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    6594                      .dwattr $C$DW$335, DW_AT_name("up")
    6595                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6596                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6597                      .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6598                      .dwattr $C$DW$335, DW_AT_decl_line(0x31)
    6599                      .dwattr $C$DW$335, DW_AT_decl_column(0x12)
    6600              
    6601              $C$DW$336       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    6603                      .dwattr $C$DW$336, DW_AT_name("ui")
    6604                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6605                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6606                      .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6607                      .dwattr $C$DW$336, DW_AT_decl_line(0x32)
    6608                      .dwattr $C$DW$336, DW_AT_decl_column(0x12)
    6609              
    6610              $C$DW$337       .dwtag  DW_TAG_member
    6611                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    6612                      .dwattr $C$DW$337, DW_AT_name("v1")
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  134

    6613                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6614                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6615                      .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6616                      .dwattr $C$DW$337, DW_AT_decl_line(0x33)
    6617                      .dwattr $C$DW$337, DW_AT_decl_column(0x12)
    6618              
    6619              $C$DW$338       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    6621                      .dwattr $C$DW$338, DW_AT_name("i1")
    6622                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6623                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6624                      .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6625                      .dwattr $C$DW$338, DW_AT_decl_line(0x34)
    6626                      .dwattr $C$DW$338, DW_AT_decl_column(0x12)
    6627              
    6628              $C$DW$339       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    6630                      .dwattr $C$DW$339, DW_AT_name("w1")
    6631                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6632                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6633                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6634                      .dwattr $C$DW$339, DW_AT_decl_line(0x35)
    6635                      .dwattr $C$DW$339, DW_AT_decl_column(0x12)
    6636              
    6637                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6638                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    6639                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    6640                      .dwendtag $C$DW$T$42
    6641              
    6642                      .dwendtag $C$DW$TU$42
    6643              
    6644              
    6645              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    6646                      .dwmtype  $C$DW$T$103
    6647              $C$DW$T$103     .dwtag  DW_TAG_typedef
    6648                      .dwattr $C$DW$T$103, DW_AT_name("PI_CONTROLLER")
    6649                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$42)
    6650                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    6651                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x36)
    6652                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x07)
    6653              
    6654                      .dwendtag $C$DW$TU$103
    6655              
    6656              
    6657              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    6658                      .dwmtype  $C$DW$T$46
    6659              
    6660              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6661                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    6662              $C$DW$340       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$43)
    6664                      .dwattr $C$DW$340, DW_AT_name("input_ptr1")
    6665                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6666                      .dwattr $C$DW$340, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6667                      .dwattr $C$DW$340, DW_AT_decl_line(0x32)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  135

    6668                      .dwattr $C$DW$340, DW_AT_decl_column(0x0d)
    6669              
    6670              $C$DW$341       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$43)
    6672                      .dwattr $C$DW$341, DW_AT_name("input_ptr2")
    6673                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6674                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6675                      .dwattr $C$DW$341, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6676                      .dwattr $C$DW$341, DW_AT_decl_line(0x33)
    6677                      .dwattr $C$DW$341, DW_AT_decl_column(0x0d)
    6678              
    6679              $C$DW$342       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$43)
    6681                      .dwattr $C$DW$342, DW_AT_name("output_ptr1")
    6682                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6683                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6684                      .dwattr $C$DW$342, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6685                      .dwattr $C$DW$342, DW_AT_decl_line(0x34)
    6686                      .dwattr $C$DW$342, DW_AT_decl_column(0x0d)
    6687              
    6688              $C$DW$343       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$43)
    6690                      .dwattr $C$DW$343, DW_AT_name("output_ptr2")
    6691                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6692                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6693                      .dwattr $C$DW$343, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6694                      .dwattr $C$DW$343, DW_AT_decl_line(0x35)
    6695                      .dwattr $C$DW$343, DW_AT_decl_column(0x0d)
    6696              
    6697              $C$DW$344       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    6699                      .dwattr $C$DW$344, DW_AT_name("prev_value")
    6700                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6701                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6702                      .dwattr $C$DW$344, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6703                      .dwattr $C$DW$344, DW_AT_decl_line(0x36)
    6704                      .dwattr $C$DW$344, DW_AT_decl_column(0x0c)
    6705              
    6706              $C$DW$345       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    6708                      .dwattr $C$DW$345, DW_AT_name("trig_value")
    6709                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6710                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6711                      .dwattr $C$DW$345, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6712                      .dwattr $C$DW$345, DW_AT_decl_line(0x37)
    6713                      .dwattr $C$DW$345, DW_AT_decl_column(0x0c)
    6714              
    6715              $C$DW$346       .dwtag  DW_TAG_member
    6716                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$45)
    6717                      .dwattr $C$DW$346, DW_AT_name("status")
    6718                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6719                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6720                      .dwattr $C$DW$346, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6721                      .dwattr $C$DW$346, DW_AT_decl_line(0x38)
    6722                      .dwattr $C$DW$346, DW_AT_decl_column(0x0a)
TMS320C2000 Assembler PC v22.6.2 Mon Dec 22 12:49:19 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  136

    6723              
    6724              $C$DW$347       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$45)
    6726                      .dwattr $C$DW$347, DW_AT_name("pre_scalar")
    6727                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6728                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6729                      .dwattr $C$DW$347, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6730                      .dwattr $C$DW$347, DW_AT_decl_line(0x39)
    6731                      .dwattr $C$DW$347, DW_AT_decl_column(0x0a)
    6732              
    6733              $C$DW$348       .dwtag  DW_TAG_member
    6734                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$45)
    6735                      .dwattr $C$DW$348, DW_AT_name("skip_count")
    6736                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6737                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6738                      .dwattr $C$DW$348, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6739                      .dwattr $C$DW$348, DW_AT_decl_line(0x3a)
    6740                      .dwattr $C$DW$348, DW_AT_decl_column(0x0a)
    6741              
    6742              $C$DW$349       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$45)
    6744                      .dwattr $C$DW$349, DW_AT_name("size")
    6745                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6746                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6747                      .dwattr $C$DW$349, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6748                      .dwattr $C$DW$349, DW_AT_decl_line(0x3b)
    6749                      .dwattr $C$DW$349, DW_AT_decl_column(0x0a)
    6750              
    6751              $C$DW$350       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$45)
    6753                      .dwattr $C$DW$350, DW_AT_name("count")
    6754                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6755                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6756                      .dwattr $C$DW$350, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6757                      .dwattr $C$DW$350, DW_AT_decl_line(0x3c)
    6758                      .dwattr $C$DW$350, DW_AT_decl_column(0x0a)
    6759              
    6760                      .dwattr $C$DW$T$46, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    6761                      .dwattr $C$DW$T$46, DW_AT_decl_line(0x31)
    6762                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x0f)
    6763                      .dwendtag $C$DW$T$46
    6764              
    6765                      .dwendtag $C$DW$TU$46
    6766              
    6767              
    6768              $C$DW$TU$135    .dwtag  DW_TAG_type_unit
    6769                      .dwmtype  $C$DW$T$135
    6770              $C$DW$T$135     .dwtag  DW_TAG_typedef
    6771                      .dwattr $C$DW$T$135, DW_AT_name("DLOG_2CH_F")
