TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Fri Dec 19 17:46:47 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_user_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FCL_initADC_2In")

    4728                      .dwattr $C$DW$235, DW_AT_name("ADC_SOC_NUMBER9")
    4729                      .dwattr $C$DW$235, DW_AT_const_value(0x09)
    4730                      .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4731                      .dwattr $C$DW$235, DW_AT_decl_line(0x111)
    4732                      .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    4733              
    4734              $C$DW$236       .dwtag  DW_TAG_enumerator
    4735                      .dwattr $C$DW$236, DW_AT_name("ADC_SOC_NUMBER10")
    4736                      .dwattr $C$DW$236, DW_AT_const_value(0x0a)
    4737                      .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4738                      .dwattr $C$DW$236, DW_AT_decl_line(0x112)
    4739                      .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    4740              
    4741              $C$DW$237       .dwtag  DW_TAG_enumerator
    4742                      .dwattr $C$DW$237, DW_AT_name("ADC_SOC_NUMBER11")
    4743                      .dwattr $C$DW$237, DW_AT_const_value(0x0b)
    4744                      .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4745                      .dwattr $C$DW$237, DW_AT_decl_line(0x113)
    4746                      .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    4747              
    4748              $C$DW$238       .dwtag  DW_TAG_enumerator
    4749                      .dwattr $C$DW$238, DW_AT_name("ADC_SOC_NUMBER12")
    4750                      .dwattr $C$DW$238, DW_AT_const_value(0x0c)
    4751                      .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4752                      .dwattr $C$DW$238, DW_AT_decl_line(0x114)
    4753                      .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    4754              
    4755              $C$DW$239       .dwtag  DW_TAG_enumerator
    4756                      .dwattr $C$DW$239, DW_AT_name("ADC_SOC_NUMBER13")
    4757                      .dwattr $C$DW$239, DW_AT_const_value(0x0d)
    4758                      .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4759                      .dwattr $C$DW$239, DW_AT_decl_line(0x115)
    4760                      .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    4761              
    4762              $C$DW$240       .dwtag  DW_TAG_enumerator
    4763                      .dwattr $C$DW$240, DW_AT_name("ADC_SOC_NUMBER14")
    4764                      .dwattr $C$DW$240, DW_AT_const_value(0x0e)
    4765                      .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4766                      .dwattr $C$DW$240, DW_AT_decl_line(0x116)
    4767                      .dwattr $C$DW$240, DW_AT_decl_column(0x05)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE   99

    4768              
    4769              $C$DW$241       .dwtag  DW_TAG_enumerator
    4770                      .dwattr $C$DW$241, DW_AT_name("ADC_SOC_NUMBER15")
    4771                      .dwattr $C$DW$241, DW_AT_const_value(0x0f)
    4772                      .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4773                      .dwattr $C$DW$241, DW_AT_decl_line(0x117)
    4774                      .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    4775              
    4776                      .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4777                      .dwattr $C$DW$T$120, DW_AT_decl_line(0x107)
    4778                      .dwattr $C$DW$T$120, DW_AT_decl_column(0x01)
    4779                      .dwendtag $C$DW$T$120
    4780              
    4781                      .dwendtag $C$DW$TU$120
    4782              
    4783              
    4784              $C$DW$TU$121    .dwtag  DW_TAG_type_unit
    4785                      .dwmtype  $C$DW$T$121
    4786              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4787                      .dwattr $C$DW$T$121, DW_AT_name("ADC_SOCNumber")
    4788                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4789                      .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4790                      .dwattr $C$DW$T$121, DW_AT_decl_line(0x118)
    4791                      .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    4792              
    4793                      .dwendtag $C$DW$TU$121
    4794              
    4795              
    4796              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    4797                      .dwmtype  $C$DW$T$19
    4798              
    4799              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4800                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    4801              $C$DW$242       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$12)
    4803                      .dwattr $C$DW$242, DW_AT_name("quot")
    4804                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4805                      .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4806                      .dwattr $C$DW$242, DW_AT_decl_line(0x59)
    4807                      .dwattr $C$DW$242, DW_AT_decl_column(0x17)
    4808              
    4809              $C$DW$243       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$12)
    4811                      .dwattr $C$DW$243, DW_AT_name("rem")
    4812                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4813                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4814                      .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4815                      .dwattr $C$DW$243, DW_AT_decl_line(0x59)
    4816                      .dwattr $C$DW$243, DW_AT_decl_column(0x1d)
    4817              
    4818                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4819                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    4820                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    4821                      .dwendtag $C$DW$T$19
    4822              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  100

    4823                      .dwendtag $C$DW$TU$19
    4824              
    4825              
    4826              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    4827                      .dwmtype  $C$DW$T$123
    4828              $C$DW$T$123     .dwtag  DW_TAG_typedef
    4829                      .dwattr $C$DW$T$123, DW_AT_name("ldiv_t")
    4830                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
    4831                      .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4832                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x59)
    4833                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x24)
    4834              
    4835                      .dwendtag $C$DW$TU$123
    4836              
    4837              
    4838              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    4839                      .dwmtype  $C$DW$T$20
    4840              
    4841              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4842                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    4843              $C$DW$244       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$14)
    4845                      .dwattr $C$DW$244, DW_AT_name("quot")
    4846                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4847                      .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4848                      .dwattr $C$DW$244, DW_AT_decl_line(0x63)
    4849                      .dwattr $C$DW$244, DW_AT_decl_column(0x1c)
    4850              
    4851              $C$DW$245       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$14)
    4853                      .dwattr $C$DW$245, DW_AT_name("rem")
    4854                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4855                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4856                      .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4857                      .dwattr $C$DW$245, DW_AT_decl_line(0x63)
    4858                      .dwattr $C$DW$245, DW_AT_decl_column(0x22)
    4859              
    4860                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4861                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    4862                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    4863                      .dwendtag $C$DW$T$20
    4864              
    4865                      .dwendtag $C$DW$TU$20
    4866              
    4867              
    4868              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    4869                      .dwmtype  $C$DW$T$126
    4870              $C$DW$T$126     .dwtag  DW_TAG_typedef
    4871                      .dwattr $C$DW$T$126, DW_AT_name("lldiv_t")
    4872                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$20)
    4873                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4874                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x63)
    4875                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x29)
    4876              
    4877                      .dwendtag $C$DW$TU$126
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  101

    4878              
    4879              
    4880              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    4881                      .dwmtype  $C$DW$T$22
    4882              
    4883              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4884                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0c)
    4885              $C$DW$246       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    4887                      .dwattr $C$DW$246, DW_AT_name("Freq")
    4888                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4889                      .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4890                      .dwattr $C$DW$246, DW_AT_decl_line(0x29)
    4891                      .dwattr $C$DW$246, DW_AT_decl_column(0x1d)
    4892              
    4893              $C$DW$247       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    4895                      .dwattr $C$DW$247, DW_AT_name("StepAngleMax")
    4896                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4897                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4898                      .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4899                      .dwattr $C$DW$247, DW_AT_decl_line(0x2a)
    4900                      .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    4901              
    4902              $C$DW$248       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    4904                      .dwattr $C$DW$248, DW_AT_name("Angle")
    4905                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4906                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4907                      .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4908                      .dwattr $C$DW$248, DW_AT_decl_line(0x2b)
    4909                      .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    4910              
    4911              $C$DW$249       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$21)
    4913                      .dwattr $C$DW$249, DW_AT_name("Gain")
    4914                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4915                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4916                      .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4917                      .dwattr $C$DW$249, DW_AT_decl_line(0x2c)
    4918                      .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    4919              
    4920              $C$DW$250       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
    4922                      .dwattr $C$DW$250, DW_AT_name("Out")
    4923                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4924                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4925                      .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4926                      .dwattr $C$DW$250, DW_AT_decl_line(0x2d)
    4927                      .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    4928              
    4929              $C$DW$251       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    4931                      .dwattr $C$DW$251, DW_AT_name("Offset")
    4932                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  102

    4933                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4934                      .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4935                      .dwattr $C$DW$251, DW_AT_decl_line(0x2e)
    4936                      .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    4937              
    4938                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4939                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x29)
    4940                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4941                      .dwendtag $C$DW$T$22
    4942              
    4943                      .dwendtag $C$DW$TU$22
    4944              
    4945              
    4946              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    4947                      .dwmtype  $C$DW$T$88
    4948              $C$DW$T$88      .dwtag  DW_TAG_typedef
    4949                      .dwattr $C$DW$T$88, DW_AT_name("RAMPGEN")
    4950                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$22)
    4951                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4952                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x2f)
    4953                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x0d)
    4954              
    4955                      .dwendtag $C$DW$TU$88
    4956              
    4957              
    4958              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4959                      .dwmtype  $C$DW$T$25
    4960              
    4961              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4962                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4963              $C$DW$252       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
    4965                      .dwattr $C$DW$252, DW_AT_name("TargetValue")
    4966                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4967                      .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4968                      .dwattr $C$DW$252, DW_AT_decl_line(0x2b)
    4969                      .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    4970              
    4971              $C$DW$253       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    4973                      .dwattr $C$DW$253, DW_AT_name("RampDelayMax")
    4974                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4975                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4976                      .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4977                      .dwattr $C$DW$253, DW_AT_decl_line(0x2c)
    4978                      .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    4979              
    4980              $C$DW$254       .dwtag  DW_TAG_member
    4981                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
    4982                      .dwattr $C$DW$254, DW_AT_name("RampLowLimit")
    4983                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4984                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4985                      .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4986                      .dwattr $C$DW$254, DW_AT_decl_line(0x2d)
    4987                      .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  103

    4988              
    4989              $C$DW$255       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
    4991                      .dwattr $C$DW$255, DW_AT_name("RampHighLimit")
    4992                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4993                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4994                      .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4995                      .dwattr $C$DW$255, DW_AT_decl_line(0x2e)
    4996                      .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    4997              
    4998              $C$DW$256       .dwtag  DW_TAG_member
    4999                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    5000                      .dwattr $C$DW$256, DW_AT_name("RampDelayCount")
    5001                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5002                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5003                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5004                      .dwattr $C$DW$256, DW_AT_decl_line(0x2f)
    5005                      .dwattr $C$DW$256, DW_AT_decl_column(0x0c)
    5006              
    5007              $C$DW$257       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    5009                      .dwattr $C$DW$257, DW_AT_name("SetpointValue")
    5010                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5011                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5012                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5013                      .dwattr $C$DW$257, DW_AT_decl_line(0x30)
    5014                      .dwattr $C$DW$257, DW_AT_decl_column(0x0c)
    5015              
    5016              $C$DW$258       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    5018                      .dwattr $C$DW$258, DW_AT_name("EqualFlag")
    5019                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5020                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5021                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5022                      .dwattr $C$DW$258, DW_AT_decl_line(0x31)
    5023                      .dwattr $C$DW$258, DW_AT_decl_column(0x0c)
    5024              
    5025              $C$DW$259       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$21)
    5027                      .dwattr $C$DW$259, DW_AT_name("Tmp")
    5028                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5029                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5030                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5031                      .dwattr $C$DW$259, DW_AT_decl_line(0x32)
    5032                      .dwattr $C$DW$259, DW_AT_decl_column(0x0c)
    5033              
    5034                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5035                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x2a)
    5036                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5037                      .dwendtag $C$DW$T$25
    5038              
    5039                      .dwendtag $C$DW$TU$25
    5040              
    5041              
    5042              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  104

    5043                      .dwmtype  $C$DW$T$89
    5044              $C$DW$T$89      .dwtag  DW_TAG_typedef
    5045                      .dwattr $C$DW$T$89, DW_AT_name("RMPCNTL")
    5046                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$25)
    5047                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5048                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x33)
    5049                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    5050              
    5051                      .dwendtag $C$DW$TU$89
    5052              
    5053              
    5054              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5055                      .dwmtype  $C$DW$T$26
    5056              
    5057              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5058                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    5059              $C$DW$260       .dwtag  DW_TAG_member
    5060                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    5061                      .dwattr $C$DW$260, DW_AT_name("As")
    5062                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5063                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5064                      .dwattr $C$DW$260, DW_AT_decl_line(0x2a)
    5065                      .dwattr $C$DW$260, DW_AT_decl_column(0x1e)
    5066              
    5067              $C$DW$261       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    5069                      .dwattr $C$DW$261, DW_AT_name("Bs")
    5070                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5071                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5072                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5073                      .dwattr $C$DW$261, DW_AT_decl_line(0x2b)
    5074                      .dwattr $C$DW$261, DW_AT_decl_column(0x12)
    5075              
    5076              $C$DW$262       .dwtag  DW_TAG_member
    5077                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    5078                      .dwattr $C$DW$262, DW_AT_name("Cs")
    5079                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5080                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5081                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5082                      .dwattr $C$DW$262, DW_AT_decl_line(0x2c)
    5083                      .dwattr $C$DW$262, DW_AT_decl_column(0x12)
    5084              
    5085              $C$DW$263       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    5087                      .dwattr $C$DW$263, DW_AT_name("Alpha")
    5088                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5089                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5090                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5091                      .dwattr $C$DW$263, DW_AT_decl_line(0x2d)
    5092                      .dwattr $C$DW$263, DW_AT_decl_column(0x12)
    5093              
    5094              $C$DW$264       .dwtag  DW_TAG_member
    5095                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    5096                      .dwattr $C$DW$264, DW_AT_name("Beta")
    5097                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  105

    5098                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5099                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5100                      .dwattr $C$DW$264, DW_AT_decl_line(0x2e)
    5101                      .dwattr $C$DW$264, DW_AT_decl_column(0x12)
    5102              
    5103                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5104                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    5105                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5106                      .dwendtag $C$DW$T$26
    5107              
    5108                      .dwendtag $C$DW$TU$26
    5109              
    5110              
    5111              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    5112                      .dwmtype  $C$DW$T$90
    5113              $C$DW$T$90      .dwtag  DW_TAG_typedef
    5114                      .dwattr $C$DW$T$90, DW_AT_name("CLARKE")
    5115                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    5116                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5117                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x2f)
    5118                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x09)
    5119              
    5120                      .dwendtag $C$DW$TU$90
    5121              
    5122              
    5123              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5124                      .dwmtype  $C$DW$T$27
    5125              
    5126              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5127                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    5128              $C$DW$265       .dwtag  DW_TAG_member
    5129                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    5130                      .dwattr $C$DW$265, DW_AT_name("Alpha")
    5131                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5132                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5133                      .dwattr $C$DW$265, DW_AT_decl_line(0x29)
    5134                      .dwattr $C$DW$265, DW_AT_decl_column(0x1e)
    5135              
    5136              $C$DW$266       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$21)
    5138                      .dwattr $C$DW$266, DW_AT_name("Beta")
    5139                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5140                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5141                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5142                      .dwattr $C$DW$266, DW_AT_decl_line(0x2a)
    5143                      .dwattr $C$DW$266, DW_AT_decl_column(0x12)
    5144              
    5145              $C$DW$267       .dwtag  DW_TAG_member
    5146                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    5147                      .dwattr $C$DW$267, DW_AT_name("Angle")
    5148                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5149                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5150                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5151                      .dwattr $C$DW$267, DW_AT_decl_line(0x2b)
    5152                      .dwattr $C$DW$267, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  106

    5153              
    5154              $C$DW$268       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    5156                      .dwattr $C$DW$268, DW_AT_name("Ds")
    5157                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5158                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5159                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5160                      .dwattr $C$DW$268, DW_AT_decl_line(0x2c)
    5161                      .dwattr $C$DW$268, DW_AT_decl_column(0x12)
    5162              
    5163              $C$DW$269       .dwtag  DW_TAG_member
    5164                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    5165                      .dwattr $C$DW$269, DW_AT_name("Qs")
    5166                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5167                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5168                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5169                      .dwattr $C$DW$269, DW_AT_decl_line(0x2d)
    5170                      .dwattr $C$DW$269, DW_AT_decl_column(0x12)
    5171              
    5172              $C$DW$270       .dwtag  DW_TAG_member
    5173                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    5174                      .dwattr $C$DW$270, DW_AT_name("Sine")
    5175                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5176                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5177                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5178                      .dwattr $C$DW$270, DW_AT_decl_line(0x2e)
    5179                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    5180              
    5181              $C$DW$271       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    5183                      .dwattr $C$DW$271, DW_AT_name("Cosine")
    5184                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5185                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5186                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5187                      .dwattr $C$DW$271, DW_AT_decl_line(0x2f)
    5188                      .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    5189              
    5190                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5191                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    5192                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    5193                      .dwendtag $C$DW$T$27
    5194              
    5195                      .dwendtag $C$DW$TU$27
    5196              
    5197              
    5198              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    5199                      .dwmtype  $C$DW$T$91
    5200              $C$DW$T$91      .dwtag  DW_TAG_typedef
    5201                      .dwattr $C$DW$T$91, DW_AT_name("PARK")
    5202                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$27)
    5203                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5204                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x30)
    5205                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x09)
    5206              
    5207                      .dwendtag $C$DW$TU$91
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  107

    5208              
    5209              
    5210              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5211                      .dwmtype  $C$DW$T$28
    5212              
    5213              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5214                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    5215              $C$DW$272       .dwtag  DW_TAG_member
    5216                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    5217                      .dwattr $C$DW$272, DW_AT_name("Alpha")
    5218                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5219                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5220                      .dwattr $C$DW$272, DW_AT_decl_line(0x29)
    5221                      .dwattr $C$DW$272, DW_AT_decl_column(0x1e)
    5222              
    5223              $C$DW$273       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    5225                      .dwattr $C$DW$273, DW_AT_name("Beta")
    5226                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5227                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5228                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5229                      .dwattr $C$DW$273, DW_AT_decl_line(0x2a)
    5230                      .dwattr $C$DW$273, DW_AT_decl_column(0x12)
    5231              
    5232              $C$DW$274       .dwtag  DW_TAG_member
    5233                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    5234                      .dwattr $C$DW$274, DW_AT_name("Angle")
    5235                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5236                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5237                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5238                      .dwattr $C$DW$274, DW_AT_decl_line(0x2b)
    5239                      .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    5240              
    5241              $C$DW$275       .dwtag  DW_TAG_member
    5242                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    5243                      .dwattr $C$DW$275, DW_AT_name("Ds")
    5244                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5245                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5246                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5247                      .dwattr $C$DW$275, DW_AT_decl_line(0x2c)
    5248                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    5249              
    5250              $C$DW$276       .dwtag  DW_TAG_member
    5251                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    5252                      .dwattr $C$DW$276, DW_AT_name("Qs")
    5253                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5254                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5255                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5256                      .dwattr $C$DW$276, DW_AT_decl_line(0x2d)
    5257                      .dwattr $C$DW$276, DW_AT_decl_column(0x12)
    5258              
    5259              $C$DW$277       .dwtag  DW_TAG_member
    5260                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    5261                      .dwattr $C$DW$277, DW_AT_name("Sine")
    5262                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  108

    5263                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5264                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5265                      .dwattr $C$DW$277, DW_AT_decl_line(0x2e)
    5266                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    5267              
    5268              $C$DW$278       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    5270                      .dwattr $C$DW$278, DW_AT_name("Cosine")
    5271                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5272                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5273                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5274                      .dwattr $C$DW$278, DW_AT_decl_line(0x2f)
    5275                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    5276              
    5277                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5278                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x29)
    5279                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5280                      .dwendtag $C$DW$T$28
    5281              
    5282                      .dwendtag $C$DW$TU$28
    5283              
    5284              
    5285              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    5286                      .dwmtype  $C$DW$T$92
    5287              $C$DW$T$92      .dwtag  DW_TAG_typedef
    5288                      .dwattr $C$DW$T$92, DW_AT_name("IPARK")
    5289                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$28)
    5290                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5291                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x30)
    5292                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x0b)
    5293              
    5294                      .dwendtag $C$DW$TU$92
    5295              
    5296              
    5297              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5298                      .dwmtype  $C$DW$T$31
    5299              
    5300              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5301                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x12)
    5302              $C$DW$279       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    5304                      .dwattr $C$DW$279, DW_AT_name("Ualpha")
    5305                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5306                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5307                      .dwattr $C$DW$279, DW_AT_decl_line(0x2b)
    5308                      .dwattr $C$DW$279, DW_AT_decl_column(0x10)
    5309              
    5310              $C$DW$280       .dwtag  DW_TAG_member
    5311                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    5312                      .dwattr $C$DW$280, DW_AT_name("Ubeta")
    5313                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5314                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5315                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5316                      .dwattr $C$DW$280, DW_AT_decl_line(0x2c)
    5317                      .dwattr $C$DW$280, DW_AT_decl_column(0x10)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  109

    5318              
    5319              $C$DW$281       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    5321                      .dwattr $C$DW$281, DW_AT_name("Ta")
    5322                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5323                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5324                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5325                      .dwattr $C$DW$281, DW_AT_decl_line(0x2d)
    5326                      .dwattr $C$DW$281, DW_AT_decl_column(0x10)
    5327              
    5328              $C$DW$282       .dwtag  DW_TAG_member
    5329                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    5330                      .dwattr $C$DW$282, DW_AT_name("Tb")
    5331                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5332                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5333                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5334                      .dwattr $C$DW$282, DW_AT_decl_line(0x2e)
    5335                      .dwattr $C$DW$282, DW_AT_decl_column(0x10)
    5336              
    5337              $C$DW$283       .dwtag  DW_TAG_member
    5338                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    5339                      .dwattr $C$DW$283, DW_AT_name("Tc")
    5340                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5341                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5342                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5343                      .dwattr $C$DW$283, DW_AT_decl_line(0x2f)
    5344                      .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    5345              
    5346              $C$DW$284       .dwtag  DW_TAG_member
    5347                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    5348                      .dwattr $C$DW$284, DW_AT_name("tmp1")
    5349                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5350                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5351                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5352                      .dwattr $C$DW$284, DW_AT_decl_line(0x30)
    5353                      .dwattr $C$DW$284, DW_AT_decl_column(0x10)
    5354              
    5355              $C$DW$285       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    5357                      .dwattr $C$DW$285, DW_AT_name("tmp2")
    5358                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5359                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5360                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5361                      .dwattr $C$DW$285, DW_AT_decl_line(0x31)
    5362                      .dwattr $C$DW$285, DW_AT_decl_column(0x10)
    5363              
    5364              $C$DW$286       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    5366                      .dwattr $C$DW$286, DW_AT_name("tmp3")
    5367                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5368                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5369                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5370                      .dwattr $C$DW$286, DW_AT_decl_line(0x32)
    5371                      .dwattr $C$DW$286, DW_AT_decl_column(0x10)
    5372              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  110

    5373              $C$DW$287       .dwtag  DW_TAG_member
    5374                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$30)
    5375                      .dwattr $C$DW$287, DW_AT_name("VecSector")
    5376                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5377                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5378                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5379                      .dwattr $C$DW$287, DW_AT_decl_line(0x33)
    5380                      .dwattr $C$DW$287, DW_AT_decl_column(0x0b)
    5381              
    5382                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5383                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    5384                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
    5385                      .dwendtag $C$DW$T$31
    5386              
    5387                      .dwendtag $C$DW$TU$31
    5388              
    5389              
    5390              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    5391                      .dwmtype  $C$DW$T$93
    5392              $C$DW$T$93      .dwtag  DW_TAG_typedef
    5393                      .dwattr $C$DW$T$93, DW_AT_name("SVGEN")
    5394                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$31)
    5395                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5396                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x34)
    5397                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x04)
    5398              
    5399                      .dwendtag $C$DW$TU$93
    5400              
    5401              
    5402              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    5403                      .dwmtype  $C$DW$T$34
    5404              
    5405              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5406                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    5407              $C$DW$288       .dwtag  DW_TAG_member
    5408                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    5409                      .dwattr $C$DW$288, DW_AT_name("ElecTheta")
    5410                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5411                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5412                      .dwattr $C$DW$288, DW_AT_decl_line(0x2b)
    5413                      .dwattr $C$DW$288, DW_AT_decl_column(0x12)
    5414              
    5415              $C$DW$289       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    5417                      .dwattr $C$DW$289, DW_AT_name("DirectionQep")
    5418                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5419                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5420                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5421                      .dwattr $C$DW$289, DW_AT_decl_line(0x2c)
    5422                      .dwattr $C$DW$289, DW_AT_decl_column(0x11)
    5423              
    5424              $C$DW$290       .dwtag  DW_TAG_member
    5425                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    5426                      .dwattr $C$DW$290, DW_AT_name("OldElecTheta")
    5427                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  111

    5428                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5429                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5430                      .dwattr $C$DW$290, DW_AT_decl_line(0x2d)
    5431                      .dwattr $C$DW$290, DW_AT_decl_column(0x12)
    5432              
    5433              $C$DW$291       .dwtag  DW_TAG_member
    5434                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    5435                      .dwattr $C$DW$291, DW_AT_name("Speed")
    5436                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5437                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5438                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5439                      .dwattr $C$DW$291, DW_AT_decl_line(0x2e)
    5440                      .dwattr $C$DW$291, DW_AT_decl_column(0x12)
    5441              
    5442              $C$DW$292       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$24)
    5444                      .dwattr $C$DW$292, DW_AT_name("BaseRpm")
    5445                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5446                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5447                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5448                      .dwattr $C$DW$292, DW_AT_decl_line(0x2f)
    5449                      .dwattr $C$DW$292, DW_AT_decl_column(0x11)
    5450              
    5451              $C$DW$293       .dwtag  DW_TAG_member
    5452                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    5453                      .dwattr $C$DW$293, DW_AT_name("K1")
    5454                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5455                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5456                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5457                      .dwattr $C$DW$293, DW_AT_decl_line(0x30)
    5458                      .dwattr $C$DW$293, DW_AT_decl_column(0x12)
    5459              
    5460              $C$DW$294       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    5462                      .dwattr $C$DW$294, DW_AT_name("K2")
    5463                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5464                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5465                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5466                      .dwattr $C$DW$294, DW_AT_decl_line(0x31)
    5467                      .dwattr $C$DW$294, DW_AT_decl_column(0x12)
    5468              
    5469              $C$DW$295       .dwtag  DW_TAG_member
    5470                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    5471                      .dwattr $C$DW$295, DW_AT_name("K3")
    5472                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5473                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5474                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5475                      .dwattr $C$DW$295, DW_AT_decl_line(0x32)
    5476                      .dwattr $C$DW$295, DW_AT_decl_column(0x12)
    5477              
    5478              $C$DW$296       .dwtag  DW_TAG_member
    5479                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$33)
    5480                      .dwattr $C$DW$296, DW_AT_name("SpeedRpm")
    5481                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5482                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  112

    5483                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5484                      .dwattr $C$DW$296, DW_AT_decl_line(0x33)
    5485                      .dwattr $C$DW$296, DW_AT_decl_column(0x10)
    5486              
    5487              $C$DW$297       .dwtag  DW_TAG_member
    5488                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    5489                      .dwattr $C$DW$297, DW_AT_name("Tmp")
    5490                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5491                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5492                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5493                      .dwattr $C$DW$297, DW_AT_decl_line(0x34)
    5494                      .dwattr $C$DW$297, DW_AT_decl_column(0x12)
    5495              
    5496                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5497                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a)
    5498                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5499                      .dwendtag $C$DW$T$34
    5500              
    5501                      .dwendtag $C$DW$TU$34
    5502              
    5503              
    5504              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5505                      .dwmtype  $C$DW$T$94
    5506              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5507                      .dwattr $C$DW$T$94, DW_AT_name("SPEED_MEAS_QEP")
    5508                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$34)
    5509                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5510                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x35)
    5511                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0a)
    5512              
    5513                      .dwendtag $C$DW$TU$94
    5514              
    5515              
    5516              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5517                      .dwmtype  $C$DW$T$35
    5518              
    5519              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5520                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    5521              $C$DW$298       .dwtag  DW_TAG_member
    5522                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    5523                      .dwattr $C$DW$298, DW_AT_name("Ref")
    5524                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5525                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5526                      .dwattr $C$DW$298, DW_AT_decl_line(0x2a)
    5527                      .dwattr $C$DW$298, DW_AT_decl_column(0x1e)
    5528              
    5529              $C$DW$299       .dwtag  DW_TAG_member
    5530                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    5531                      .dwattr $C$DW$299, DW_AT_name("Fbk")
    5532                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5533                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5534                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5535                      .dwattr $C$DW$299, DW_AT_decl_line(0x2b)
    5536                      .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    5537              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  113

    5538              $C$DW$300       .dwtag  DW_TAG_member
    5539                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    5540                      .dwattr $C$DW$300, DW_AT_name("Out")
    5541                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5542                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5543                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5544                      .dwattr $C$DW$300, DW_AT_decl_line(0x2c)
    5545                      .dwattr $C$DW$300, DW_AT_decl_column(0x12)
    5546              
    5547              $C$DW$301       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    5549                      .dwattr $C$DW$301, DW_AT_name("c1")
    5550                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5551                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5552                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5553                      .dwattr $C$DW$301, DW_AT_decl_line(0x2d)
    5554                      .dwattr $C$DW$301, DW_AT_decl_column(0x12)
    5555              
    5556              $C$DW$302       .dwtag  DW_TAG_member
    5557                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    5558                      .dwattr $C$DW$302, DW_AT_name("c2")
    5559                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5560                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5561                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5562                      .dwattr $C$DW$302, DW_AT_decl_line(0x2e)
    5563                      .dwattr $C$DW$302, DW_AT_decl_column(0x12)
    5564              
    5565                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5566                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    5567                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5568                      .dwendtag $C$DW$T$35
    5569              
    5570                      .dwendtag $C$DW$TU$35
    5571              
    5572              
    5573              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5574                      .dwmtype  $C$DW$T$38
    5575              $C$DW$T$38      .dwtag  DW_TAG_typedef
    5576                      .dwattr $C$DW$T$38, DW_AT_name("PID_TERMINALS")
    5577                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    5578                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5579                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    5580                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x07)
    5581              
    5582                      .dwendtag $C$DW$TU$38
    5583              
    5584              
    5585              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    5586                      .dwmtype  $C$DW$T$36
    5587              
    5588              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5589                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    5590              $C$DW$303       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    5592                      .dwattr $C$DW$303, DW_AT_name("Kr")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  114

    5593                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5594                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5595                      .dwattr $C$DW$303, DW_AT_decl_line(0x32)
    5596                      .dwattr $C$DW$303, DW_AT_decl_column(0x1e)
    5597              
    5598              $C$DW$304       .dwtag  DW_TAG_member
    5599                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    5600                      .dwattr $C$DW$304, DW_AT_name("Kp")
    5601                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5602                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5603                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5604                      .dwattr $C$DW$304, DW_AT_decl_line(0x33)
    5605                      .dwattr $C$DW$304, DW_AT_decl_column(0x12)
    5606              
    5607              $C$DW$305       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    5609                      .dwattr $C$DW$305, DW_AT_name("Ki")
    5610                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5611                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5612                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5613                      .dwattr $C$DW$305, DW_AT_decl_line(0x34)
    5614                      .dwattr $C$DW$305, DW_AT_decl_column(0x12)
    5615              
    5616              $C$DW$306       .dwtag  DW_TAG_member
    5617                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    5618                      .dwattr $C$DW$306, DW_AT_name("Kd")
    5619                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5620                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5621                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5622                      .dwattr $C$DW$306, DW_AT_decl_line(0x35)
    5623                      .dwattr $C$DW$306, DW_AT_decl_column(0x12)
    5624              
    5625              $C$DW$307       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    5627                      .dwattr $C$DW$307, DW_AT_name("Km")
    5628                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5629                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5630                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5631                      .dwattr $C$DW$307, DW_AT_decl_line(0x36)
    5632                      .dwattr $C$DW$307, DW_AT_decl_column(0x12)
    5633              
    5634              $C$DW$308       .dwtag  DW_TAG_member
    5635                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    5636                      .dwattr $C$DW$308, DW_AT_name("Umax")
    5637                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5638                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5639                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5640                      .dwattr $C$DW$308, DW_AT_decl_line(0x37)
    5641                      .dwattr $C$DW$308, DW_AT_decl_column(0x12)
    5642              
    5643              $C$DW$309       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    5645                      .dwattr $C$DW$309, DW_AT_name("Umin")
    5646                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5647                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  115

    5648                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5649                      .dwattr $C$DW$309, DW_AT_decl_line(0x38)
    5650                      .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    5651              
    5652                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5653                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x32)
    5654                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5655                      .dwendtag $C$DW$T$36
    5656              
    5657                      .dwendtag $C$DW$TU$36
    5658              
    5659              
    5660              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5661                      .dwmtype  $C$DW$T$39
    5662              $C$DW$T$39      .dwtag  DW_TAG_typedef
    5663                      .dwattr $C$DW$T$39, DW_AT_name("PID_PARAMETERS")
    5664                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    5665                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5666                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x39)
    5667                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x07)
    5668              
    5669                      .dwendtag $C$DW$TU$39
    5670              
    5671              
    5672              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    5673                      .dwmtype  $C$DW$T$37
    5674              
    5675              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5676                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    5677              $C$DW$310       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    5679                      .dwattr $C$DW$310, DW_AT_name("up")
    5680                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5681                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5682                      .dwattr $C$DW$310, DW_AT_decl_line(0x3b)
    5683                      .dwattr $C$DW$310, DW_AT_decl_column(0x1e)
    5684              
    5685              $C$DW$311       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    5687                      .dwattr $C$DW$311, DW_AT_name("ui")
    5688                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5689                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5690                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5691                      .dwattr $C$DW$311, DW_AT_decl_line(0x3c)
    5692                      .dwattr $C$DW$311, DW_AT_decl_column(0x12)
    5693              
    5694              $C$DW$312       .dwtag  DW_TAG_member
    5695                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    5696                      .dwattr $C$DW$312, DW_AT_name("ud")
    5697                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5698                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5699                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5700                      .dwattr $C$DW$312, DW_AT_decl_line(0x3d)
    5701                      .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    5702              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  116

    5703              $C$DW$313       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    5705                      .dwattr $C$DW$313, DW_AT_name("v1")
    5706                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5707                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5708                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5709                      .dwattr $C$DW$313, DW_AT_decl_line(0x3e)
    5710                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    5711              
    5712              $C$DW$314       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    5714                      .dwattr $C$DW$314, DW_AT_name("i1")
    5715                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5716                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5717                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5718                      .dwattr $C$DW$314, DW_AT_decl_line(0x3f)
    5719                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    5720              
    5721              $C$DW$315       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    5723                      .dwattr $C$DW$315, DW_AT_name("d1")
    5724                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5725                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5726                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5727                      .dwattr $C$DW$315, DW_AT_decl_line(0x40)
    5728                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    5729              
    5730              $C$DW$316       .dwtag  DW_TAG_member
    5731                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    5732                      .dwattr $C$DW$316, DW_AT_name("d2")
    5733                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5734                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5735                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5736                      .dwattr $C$DW$316, DW_AT_decl_line(0x41)
    5737                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    5738              
    5739              $C$DW$317       .dwtag  DW_TAG_member
    5740                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    5741                      .dwattr $C$DW$317, DW_AT_name("w1")
    5742                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5743                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5744                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5745                      .dwattr $C$DW$317, DW_AT_decl_line(0x42)
    5746                      .dwattr $C$DW$317, DW_AT_decl_column(0x12)
    5747              
    5748                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5749                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    5750                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5751                      .dwendtag $C$DW$T$37
    5752              
    5753                      .dwendtag $C$DW$TU$37
    5754              
    5755              
    5756              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5757                      .dwmtype  $C$DW$T$40
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  117

    5758              $C$DW$T$40      .dwtag  DW_TAG_typedef
    5759                      .dwattr $C$DW$T$40, DW_AT_name("PID_DATA")
    5760                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    5761                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5762                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    5763                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x07)
    5764              
    5765                      .dwendtag $C$DW$TU$40
    5766              
    5767              
    5768              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    5769                      .dwmtype  $C$DW$T$41
    5770              
    5771              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5772                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    5773              $C$DW$318       .dwtag  DW_TAG_member
    5774                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$38)
    5775                      .dwattr $C$DW$318, DW_AT_name("term")
    5776                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5777                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5778                      .dwattr $C$DW$318, DW_AT_decl_line(0x46)
    5779                      .dwattr $C$DW$318, DW_AT_decl_column(0x21)
    5780              
    5781              $C$DW$319       .dwtag  DW_TAG_member
    5782                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$39)
    5783                      .dwattr $C$DW$319, DW_AT_name("param")
    5784                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5785                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5786                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5787                      .dwattr $C$DW$319, DW_AT_decl_line(0x47)
    5788                      .dwattr $C$DW$319, DW_AT_decl_column(0x16)
    5789              
    5790              $C$DW$320       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$40)
    5792                      .dwattr $C$DW$320, DW_AT_name("data")
    5793                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5794                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5795                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5796                      .dwattr $C$DW$320, DW_AT_decl_line(0x48)
    5797                      .dwattr $C$DW$320, DW_AT_decl_column(0x11)
    5798              
    5799                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5800                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    5801                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5802                      .dwendtag $C$DW$T$41
    5803              
    5804                      .dwendtag $C$DW$TU$41
    5805              
    5806              
    5807              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    5808                      .dwmtype  $C$DW$T$96
    5809              $C$DW$T$96      .dwtag  DW_TAG_typedef
    5810                      .dwattr $C$DW$T$96, DW_AT_name("PID_CONTROLLER")
    5811                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$41)
    5812                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  118

    5813                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x49)
    5814                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x07)
    5815              
    5816                      .dwendtag $C$DW$TU$96
    5817              
    5818              
    5819              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5820                      .dwmtype  $C$DW$T$42
    5821              
    5822              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5823                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    5824              $C$DW$321       .dwtag  DW_TAG_member
    5825                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    5826                      .dwattr $C$DW$321, DW_AT_name("Ref")
    5827                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5828                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5829                      .dwattr $C$DW$321, DW_AT_decl_line(0x2a)
    5830                      .dwattr $C$DW$321, DW_AT_decl_column(0x1e)
    5831              
    5832              $C$DW$322       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    5834                      .dwattr $C$DW$322, DW_AT_name("Fbk")
    5835                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5836                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5837                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5838                      .dwattr $C$DW$322, DW_AT_decl_line(0x2b)
    5839                      .dwattr $C$DW$322, DW_AT_decl_column(0x12)
    5840              
    5841              $C$DW$323       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    5843                      .dwattr $C$DW$323, DW_AT_name("Out")
    5844                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5845                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5846                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5847                      .dwattr $C$DW$323, DW_AT_decl_line(0x2c)
    5848                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    5849              
    5850              $C$DW$324       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    5852                      .dwattr $C$DW$324, DW_AT_name("Kp")
    5853                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5854                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5855                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5856                      .dwattr $C$DW$324, DW_AT_decl_line(0x2d)
    5857                      .dwattr $C$DW$324, DW_AT_decl_column(0x12)
    5858              
    5859              $C$DW$325       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    5861                      .dwattr $C$DW$325, DW_AT_name("Ki")
    5862                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5863                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5864                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5865                      .dwattr $C$DW$325, DW_AT_decl_line(0x2e)
    5866                      .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    5867              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  119

    5868              $C$DW$326       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    5870                      .dwattr $C$DW$326, DW_AT_name("Umax")
    5871                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5872                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5873                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5874                      .dwattr $C$DW$326, DW_AT_decl_line(0x2f)
    5875                      .dwattr $C$DW$326, DW_AT_decl_column(0x12)
    5876              
    5877              $C$DW$327       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
    5879                      .dwattr $C$DW$327, DW_AT_name("Umin")
    5880                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5881                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5882                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5883                      .dwattr $C$DW$327, DW_AT_decl_line(0x30)
    5884                      .dwattr $C$DW$327, DW_AT_decl_column(0x12)
    5885              
    5886              $C$DW$328       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    5888                      .dwattr $C$DW$328, DW_AT_name("up")
    5889                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5890                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5891                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5892                      .dwattr $C$DW$328, DW_AT_decl_line(0x31)
    5893                      .dwattr $C$DW$328, DW_AT_decl_column(0x12)
    5894              
    5895              $C$DW$329       .dwtag  DW_TAG_member
    5896                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    5897                      .dwattr $C$DW$329, DW_AT_name("ui")
    5898                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5899                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5900                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5901                      .dwattr $C$DW$329, DW_AT_decl_line(0x32)
    5902                      .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    5903              
    5904              $C$DW$330       .dwtag  DW_TAG_member
    5905                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    5906                      .dwattr $C$DW$330, DW_AT_name("v1")
    5907                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5908                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5909                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5910                      .dwattr $C$DW$330, DW_AT_decl_line(0x33)
    5911                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    5912              
    5913              $C$DW$331       .dwtag  DW_TAG_member
    5914                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    5915                      .dwattr $C$DW$331, DW_AT_name("i1")
    5916                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5917                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5918                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5919                      .dwattr $C$DW$331, DW_AT_decl_line(0x34)
    5920                      .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    5921              
    5922              $C$DW$332       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  120

    5923                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    5924                      .dwattr $C$DW$332, DW_AT_name("w1")
    5925                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5926                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5927                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5928                      .dwattr $C$DW$332, DW_AT_decl_line(0x35)
    5929                      .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    5930              
    5931                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5932                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    5933                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    5934                      .dwendtag $C$DW$T$42
    5935              
    5936                      .dwendtag $C$DW$TU$42
    5937              
    5938              
    5939              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    5940                      .dwmtype  $C$DW$T$97
    5941              $C$DW$T$97      .dwtag  DW_TAG_typedef
    5942                      .dwattr $C$DW$T$97, DW_AT_name("PI_CONTROLLER")
    5943                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$42)
    5944                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5945                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x36)
    5946                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x07)
    5947              
    5948                      .dwendtag $C$DW$TU$97
    5949              
    5950              
    5951              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    5952                      .dwmtype  $C$DW$T$44
    5953              
    5954              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5955                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTFLG_BITS")
    5956                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5957              $C$DW$333       .dwtag  DW_TAG_member
    5958                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$43)
    5959                      .dwattr $C$DW$333, DW_AT_name("ADCINT1")
    5960                      .dwattr $C$DW$333, DW_AT_bit_offset(0x0f)
    5961                      .dwattr $C$DW$333, DW_AT_bit_size(0x01)
    5962                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5963                      .dwattr $C$DW$333, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5964                      .dwattr $C$DW$333, DW_AT_decl_line(0x60)
    5965                      .dwattr $C$DW$333, DW_AT_decl_column(0x0c)
    5966              
    5967              $C$DW$334       .dwtag  DW_TAG_member
    5968                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    5969                      .dwattr $C$DW$334, DW_AT_name("ADCINT2")
    5970                      .dwattr $C$DW$334, DW_AT_bit_offset(0x0e)
    5971                      .dwattr $C$DW$334, DW_AT_bit_size(0x01)
    5972                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5973                      .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5974                      .dwattr $C$DW$334, DW_AT_decl_line(0x61)
    5975                      .dwattr $C$DW$334, DW_AT_decl_column(0x0c)
    5976              
    5977              $C$DW$335       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  121

    5978                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$43)
    5979                      .dwattr $C$DW$335, DW_AT_name("ADCINT3")
    5980                      .dwattr $C$DW$335, DW_AT_bit_offset(0x0d)
    5981                      .dwattr $C$DW$335, DW_AT_bit_size(0x01)
    5982                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5983                      .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5984                      .dwattr $C$DW$335, DW_AT_decl_line(0x62)
    5985                      .dwattr $C$DW$335, DW_AT_decl_column(0x0c)
    5986              
    5987              $C$DW$336       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    5989                      .dwattr $C$DW$336, DW_AT_name("ADCINT4")
    5990                      .dwattr $C$DW$336, DW_AT_bit_offset(0x0c)
    5991                      .dwattr $C$DW$336, DW_AT_bit_size(0x01)
    5992                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5993                      .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5994                      .dwattr $C$DW$336, DW_AT_decl_line(0x63)
    5995                      .dwattr $C$DW$336, DW_AT_decl_column(0x0c)
    5996              
    5997              $C$DW$337       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$43)
    5999                      .dwattr $C$DW$337, DW_AT_name("rsvd1")
    6000                      .dwattr $C$DW$337, DW_AT_bit_offset(0x00)
    6001                      .dwattr $C$DW$337, DW_AT_bit_size(0x0c)
    6002                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6003                      .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6004                      .dwattr $C$DW$337, DW_AT_decl_line(0x64)
    6005                      .dwattr $C$DW$337, DW_AT_decl_column(0x0c)
    6006              
    6007                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6008                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x5f)
    6009                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    6010                      .dwendtag $C$DW$T$44
    6011              
    6012                      .dwendtag $C$DW$TU$44
    6013              
    6014              
    6015              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    6016                      .dwmtype  $C$DW$T$45
    6017              
    6018              $C$DW$T$45      .dwtag  DW_TAG_union_type
    6019                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTFLG_REG")
    6020                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    6021              $C$DW$338       .dwtag  DW_TAG_member
    6022                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$43)
    6023                      .dwattr $C$DW$338, DW_AT_name("all")
    6024                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6025                      .dwattr $C$DW$338, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6026                      .dwattr $C$DW$338, DW_AT_decl_line(0x68)
    6027                      .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
    6028              
    6029              $C$DW$339       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$44)
    6031                      .dwattr $C$DW$339, DW_AT_name("bit")
    6032                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 17:46:48 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  122

    6033                      .dwattr $C$DW$339, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6034                      .dwattr $C$DW$339, DW_AT_decl_line(0x69)
    6035                      .dwattr $C$DW$339, DW_AT_decl_column(0x1d)
    6036              
    6037                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6038                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x67)
    6039                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x07)
    6040                      .dwendtag $C$DW$T$45
    6041              
    6042                      .dwendtag $C$DW$TU$45
    6043              
    6044              
    6045              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6046                      .dwmtype  $C$DW$T$102
    6047              $C$DW$340       .dwtag  DW_TAG_TI_far_type
    6048                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$45)
    6049              
    6050              $C$DW$T$102     .dwtag  DW_TAG_volatile_type
    6051                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$340)
    6052              
    6053                      .dwendtag $C$DW$TU$102
    6054              
    6055              
    6056              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    6057                      .dwmtype  $C$DW$T$103
    6058              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    6059                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6060                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    6061              
    6062                      .dwendtag $C$DW$TU$103
    6063              
    6064              
    6065              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    6066                      .dwmtype  $C$DW$T$48
    6067              
    6068              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6069                      .dwattr $C$DW$T$48, DW_AT_name("EQEP_REGS")
