TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Fri Dec 19 11:01:58 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_main_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_LAUNCHXL-F280025C\251210_LAUNC
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    4986                      .dwattr $C$DW$332, DW_AT_decl_line(0x176)
    4987                      .dwattr $C$DW$332, DW_AT_decl_column(0x05)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   97

    4988              
    4989              $C$DW$333       .dwtag  DW_TAG_enumerator
    4990                      .dwattr $C$DW$333, DW_AT_name("SYSCTL_PERIPH_CLK_LINB")
    4991                      .dwattr $C$DW$333, DW_AT_const_value(0x113)
    4992                      .dwattr $C$DW$333, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4993                      .dwattr $C$DW$333, DW_AT_decl_line(0x177)
    4994                      .dwattr $C$DW$333, DW_AT_decl_column(0x05)
    4995              
    4996              $C$DW$334       .dwtag  DW_TAG_enumerator
    4997                      .dwattr $C$DW$334, DW_AT_name("SYSCTL_PERIPH_CLK_PMBUSA")
    4998                      .dwattr $C$DW$334, DW_AT_const_value(0x14)
    4999                      .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    5000                      .dwattr $C$DW$334, DW_AT_decl_line(0x178)
    5001                      .dwattr $C$DW$334, DW_AT_decl_column(0x05)
    5002              
    5003              $C$DW$335       .dwtag  DW_TAG_enumerator
    5004                      .dwattr $C$DW$335, DW_AT_name("SYSCTL_PERIPH_CLK_DCC0")
    5005                      .dwattr $C$DW$335, DW_AT_const_value(0x15)
    5006                      .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    5007                      .dwattr $C$DW$335, DW_AT_decl_line(0x179)
    5008                      .dwattr $C$DW$335, DW_AT_decl_column(0x05)
    5009              
    5010              $C$DW$336       .dwtag  DW_TAG_enumerator
    5011                      .dwattr $C$DW$336, DW_AT_name("SYSCTL_PERIPH_CLK_DCC1")
    5012                      .dwattr $C$DW$336, DW_AT_const_value(0x115)
    5013                      .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    5014                      .dwattr $C$DW$336, DW_AT_decl_line(0x17a)
    5015                      .dwattr $C$DW$336, DW_AT_decl_column(0x05)
    5016              
    5017              $C$DW$337       .dwtag  DW_TAG_enumerator
    5018                      .dwattr $C$DW$337, DW_AT_name("SYSCTL_PERIPH_CLK_MPOST0")
    5019                      .dwattr $C$DW$337, DW_AT_const_value(0x16)
    5020                      .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    5021                      .dwattr $C$DW$337, DW_AT_decl_line(0x17b)
    5022                      .dwattr $C$DW$337, DW_AT_decl_column(0x05)
    5023              
    5024              $C$DW$338       .dwtag  DW_TAG_enumerator
    5025                      .dwattr $C$DW$338, DW_AT_name("SYSCTL_PERIPH_CLK_HICA")
    5026                      .dwattr $C$DW$338, DW_AT_const_value(0x19)
    5027                      .dwattr $C$DW$338, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    5028                      .dwattr $C$DW$338, DW_AT_decl_line(0x17c)
    5029                      .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    5030              
    5031                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib
    5032                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x151)
    5033                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x01)
    5034                      .dwendtag $C$DW$T$126
    5035              
    5036                      .dwendtag $C$DW$TU$126
    5037              
    5038              
    5039              $C$DW$TU$127    .dwtag  DW_TAG_type_unit
    5040                      .dwmtype  $C$DW$T$127
    5041              $C$DW$T$127     .dwtag  DW_TAG_typedef
    5042                      .dwattr $C$DW$T$127, DW_AT_name("SysCtl_PeripheralPCLOCKCR")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   98

    5043                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    5044                      .dwattr $C$DW$T$127, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib
    5045                      .dwattr $C$DW$T$127, DW_AT_decl_line(0x17d)
    5046                      .dwattr $C$DW$T$127, DW_AT_decl_column(0x03)
    5047              
    5048                      .dwendtag $C$DW$TU$127
    5049              
    5050              
    5051              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    5052                      .dwmtype  $C$DW$T$19
    5053              
    5054              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5055                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    5056              $C$DW$339       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$12)
    5058                      .dwattr $C$DW$339, DW_AT_name("quot")
    5059                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5060                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5061                      .dwattr $C$DW$339, DW_AT_decl_line(0x59)
    5062                      .dwattr $C$DW$339, DW_AT_decl_column(0x17)
    5063              
    5064              $C$DW$340       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$12)
    5066                      .dwattr $C$DW$340, DW_AT_name("rem")
    5067                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5068                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5069                      .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5070                      .dwattr $C$DW$340, DW_AT_decl_line(0x59)
    5071                      .dwattr $C$DW$340, DW_AT_decl_column(0x1d)
    5072              
    5073                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5074                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    5075                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    5076                      .dwendtag $C$DW$T$19
    5077              
    5078                      .dwendtag $C$DW$TU$19
    5079              
    5080              
    5081              $C$DW$TU$129    .dwtag  DW_TAG_type_unit
    5082                      .dwmtype  $C$DW$T$129
    5083              $C$DW$T$129     .dwtag  DW_TAG_typedef
    5084                      .dwattr $C$DW$T$129, DW_AT_name("ldiv_t")
    5085                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$19)
    5086                      .dwattr $C$DW$T$129, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5087                      .dwattr $C$DW$T$129, DW_AT_decl_line(0x59)
    5088                      .dwattr $C$DW$T$129, DW_AT_decl_column(0x24)
    5089              
    5090                      .dwendtag $C$DW$TU$129
    5091              
    5092              
    5093              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    5094                      .dwmtype  $C$DW$T$20
    5095              
    5096              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5097                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   99

    5098              $C$DW$341       .dwtag  DW_TAG_member
    5099                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$14)
    5100                      .dwattr $C$DW$341, DW_AT_name("quot")
    5101                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5102                      .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5103                      .dwattr $C$DW$341, DW_AT_decl_line(0x63)
    5104                      .dwattr $C$DW$341, DW_AT_decl_column(0x1c)
    5105              
    5106              $C$DW$342       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$14)
    5108                      .dwattr $C$DW$342, DW_AT_name("rem")
    5109                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5110                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5111                      .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5112                      .dwattr $C$DW$342, DW_AT_decl_line(0x63)
    5113                      .dwattr $C$DW$342, DW_AT_decl_column(0x22)
    5114              
    5115                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5116                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    5117                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    5118                      .dwendtag $C$DW$T$20
    5119              
    5120                      .dwendtag $C$DW$TU$20
    5121              
    5122              
    5123              $C$DW$TU$132    .dwtag  DW_TAG_type_unit
    5124                      .dwmtype  $C$DW$T$132
    5125              $C$DW$T$132     .dwtag  DW_TAG_typedef
    5126                      .dwattr $C$DW$T$132, DW_AT_name("lldiv_t")
    5127                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$20)
    5128                      .dwattr $C$DW$T$132, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5129                      .dwattr $C$DW$T$132, DW_AT_decl_line(0x63)
    5130                      .dwattr $C$DW$T$132, DW_AT_decl_column(0x29)
    5131              
    5132                      .dwendtag $C$DW$TU$132
    5133              
    5134              
    5135              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5136                      .dwmtype  $C$DW$T$25
    5137              
    5138              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5139                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    5140              $C$DW$343       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    5142                      .dwattr $C$DW$343, DW_AT_name("input_ptr1")
    5143                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5144                      .dwattr $C$DW$343, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5145                      .dwattr $C$DW$343, DW_AT_decl_line(0x32)
    5146                      .dwattr $C$DW$343, DW_AT_decl_column(0x0d)
    5147              
    5148              $C$DW$344       .dwtag  DW_TAG_member
    5149                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    5150                      .dwattr $C$DW$344, DW_AT_name("input_ptr2")
    5151                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5152                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  100

    5153                      .dwattr $C$DW$344, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5154                      .dwattr $C$DW$344, DW_AT_decl_line(0x33)
    5155                      .dwattr $C$DW$344, DW_AT_decl_column(0x0d)
    5156              
    5157              $C$DW$345       .dwtag  DW_TAG_member
    5158                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    5159                      .dwattr $C$DW$345, DW_AT_name("output_ptr1")
    5160                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5161                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5162                      .dwattr $C$DW$345, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5163                      .dwattr $C$DW$345, DW_AT_decl_line(0x34)
    5164                      .dwattr $C$DW$345, DW_AT_decl_column(0x0d)
    5165              
    5166              $C$DW$346       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    5168                      .dwattr $C$DW$346, DW_AT_name("output_ptr2")
    5169                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5170                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5171                      .dwattr $C$DW$346, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5172                      .dwattr $C$DW$346, DW_AT_decl_line(0x35)
    5173                      .dwattr $C$DW$346, DW_AT_decl_column(0x0d)
    5174              
    5175              $C$DW$347       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$21)
    5177                      .dwattr $C$DW$347, DW_AT_name("prev_value")
    5178                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5179                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5180                      .dwattr $C$DW$347, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5181                      .dwattr $C$DW$347, DW_AT_decl_line(0x36)
    5182                      .dwattr $C$DW$347, DW_AT_decl_column(0x0c)
    5183              
    5184              $C$DW$348       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$21)
    5186                      .dwattr $C$DW$348, DW_AT_name("trig_value")
    5187                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5188                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5189                      .dwattr $C$DW$348, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5190                      .dwattr $C$DW$348, DW_AT_decl_line(0x37)
    5191                      .dwattr $C$DW$348, DW_AT_decl_column(0x0c)
    5192              
    5193              $C$DW$349       .dwtag  DW_TAG_member
    5194                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$24)
    5195                      .dwattr $C$DW$349, DW_AT_name("status")
    5196                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5197                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5198                      .dwattr $C$DW$349, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5199                      .dwattr $C$DW$349, DW_AT_decl_line(0x38)
    5200                      .dwattr $C$DW$349, DW_AT_decl_column(0x0a)
    5201              
    5202              $C$DW$350       .dwtag  DW_TAG_member
    5203                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$24)
    5204                      .dwattr $C$DW$350, DW_AT_name("pre_scalar")
    5205                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5206                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5207                      .dwattr $C$DW$350, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  101

    5208                      .dwattr $C$DW$350, DW_AT_decl_line(0x39)
    5209                      .dwattr $C$DW$350, DW_AT_decl_column(0x0a)
    5210              
    5211              $C$DW$351       .dwtag  DW_TAG_member
    5212                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    5213                      .dwattr $C$DW$351, DW_AT_name("skip_count")
    5214                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5215                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5216                      .dwattr $C$DW$351, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5217                      .dwattr $C$DW$351, DW_AT_decl_line(0x3a)
    5218                      .dwattr $C$DW$351, DW_AT_decl_column(0x0a)
    5219              
    5220              $C$DW$352       .dwtag  DW_TAG_member
    5221                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$24)
    5222                      .dwattr $C$DW$352, DW_AT_name("size")
    5223                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5224                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5225                      .dwattr $C$DW$352, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5226                      .dwattr $C$DW$352, DW_AT_decl_line(0x3b)
    5227                      .dwattr $C$DW$352, DW_AT_decl_column(0x0a)
    5228              
    5229              $C$DW$353       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$24)
    5231                      .dwattr $C$DW$353, DW_AT_name("count")
    5232                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5233                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5234                      .dwattr $C$DW$353, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5235                      .dwattr $C$DW$353, DW_AT_decl_line(0x3c)
    5236                      .dwattr $C$DW$353, DW_AT_decl_column(0x0a)
    5237              
    5238                      .dwattr $C$DW$T$25, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5239                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x31)
    5240                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
    5241                      .dwendtag $C$DW$T$25
    5242              
    5243                      .dwendtag $C$DW$TU$25
    5244              
    5245              
    5246              $C$DW$TU$134    .dwtag  DW_TAG_type_unit
    5247                      .dwmtype  $C$DW$T$134
    5248              $C$DW$T$134     .dwtag  DW_TAG_typedef
    5249                      .dwattr $C$DW$T$134, DW_AT_name("DLOG_2CH_F")
    5250                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$25)
    5251                      .dwattr $C$DW$T$134, DW_AT_decl_file("..\sources\dlog_2ch_f.h")
    5252                      .dwattr $C$DW$T$134, DW_AT_decl_line(0x3d)
    5253                      .dwattr $C$DW$T$134, DW_AT_decl_column(0x02)
    5254              
    5255                      .dwendtag $C$DW$TU$134
    5256              
    5257              
    5258              $C$DW$TU$135    .dwtag  DW_TAG_type_unit
    5259                      .dwmtype  $C$DW$T$135
    5260              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    5261                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    5262                      .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  102

    5263              
    5264                      .dwendtag $C$DW$TU$135
    5265              
    5266              
    5267              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5268                      .dwmtype  $C$DW$T$26
    5269              
    5270              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5271                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    5272              $C$DW$354       .dwtag  DW_TAG_member
    5273                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    5274                      .dwattr $C$DW$354, DW_AT_name("Freq")
    5275                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5276                      .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5277                      .dwattr $C$DW$354, DW_AT_decl_line(0x29)
    5278                      .dwattr $C$DW$354, DW_AT_decl_column(0x1d)
    5279              
    5280              $C$DW$355       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    5282                      .dwattr $C$DW$355, DW_AT_name("StepAngleMax")
    5283                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5284                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5285                      .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5286                      .dwattr $C$DW$355, DW_AT_decl_line(0x2a)
    5287                      .dwattr $C$DW$355, DW_AT_decl_column(0x11)
    5288              
    5289              $C$DW$356       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
    5291                      .dwattr $C$DW$356, DW_AT_name("Angle")
    5292                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5293                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5294                      .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5295                      .dwattr $C$DW$356, DW_AT_decl_line(0x2b)
    5296                      .dwattr $C$DW$356, DW_AT_decl_column(0x11)
    5297              
    5298              $C$DW$357       .dwtag  DW_TAG_member
    5299                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    5300                      .dwattr $C$DW$357, DW_AT_name("Gain")
    5301                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5302                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5303                      .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5304                      .dwattr $C$DW$357, DW_AT_decl_line(0x2c)
    5305                      .dwattr $C$DW$357, DW_AT_decl_column(0x11)
    5306              
    5307              $C$DW$358       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
    5309                      .dwattr $C$DW$358, DW_AT_name("Out")
    5310                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5311                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5312                      .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5313                      .dwattr $C$DW$358, DW_AT_decl_line(0x2d)
    5314                      .dwattr $C$DW$358, DW_AT_decl_column(0x11)
    5315              
    5316              $C$DW$359       .dwtag  DW_TAG_member
    5317                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  103

    5318                      .dwattr $C$DW$359, DW_AT_name("Offset")
    5319                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5320                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5321                      .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5322                      .dwattr $C$DW$359, DW_AT_decl_line(0x2e)
    5323                      .dwattr $C$DW$359, DW_AT_decl_column(0x11)
    5324              
    5325                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5326                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x29)
    5327                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5328                      .dwendtag $C$DW$T$26
    5329              
    5330                      .dwendtag $C$DW$TU$26
    5331              
    5332              
    5333              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5334                      .dwmtype  $C$DW$T$94
    5335              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5336                      .dwattr $C$DW$T$94, DW_AT_name("RAMPGEN")
    5337                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$26)
    5338                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5339                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x2f)
    5340                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0d)
    5341              
    5342                      .dwendtag $C$DW$TU$94
    5343              
    5344              
    5345              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5346                      .dwmtype  $C$DW$T$29
    5347              
    5348              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5349                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    5350              $C$DW$360       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
    5352                      .dwattr $C$DW$360, DW_AT_name("TargetValue")
    5353                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5354                      .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5355                      .dwattr $C$DW$360, DW_AT_decl_line(0x2b)
    5356                      .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    5357              
    5358              $C$DW$361       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$28)
    5360                      .dwattr $C$DW$361, DW_AT_name("RampDelayMax")
    5361                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5362                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5363                      .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5364                      .dwattr $C$DW$361, DW_AT_decl_line(0x2c)
    5365                      .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    5366              
    5367              $C$DW$362       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
    5369                      .dwattr $C$DW$362, DW_AT_name("RampLowLimit")
    5370                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5371                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5372                      .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  104

    5373                      .dwattr $C$DW$362, DW_AT_decl_line(0x2d)
    5374                      .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
    5375              
    5376              $C$DW$363       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
    5378                      .dwattr $C$DW$363, DW_AT_name("RampHighLimit")
    5379                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5380                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5381                      .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5382                      .dwattr $C$DW$363, DW_AT_decl_line(0x2e)
    5383                      .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    5384              
    5385              $C$DW$364       .dwtag  DW_TAG_member
    5386                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$28)
    5387                      .dwattr $C$DW$364, DW_AT_name("RampDelayCount")
    5388                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5389                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5390                      .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5391                      .dwattr $C$DW$364, DW_AT_decl_line(0x2f)
    5392                      .dwattr $C$DW$364, DW_AT_decl_column(0x0c)
    5393              
    5394              $C$DW$365       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$21)
    5396                      .dwattr $C$DW$365, DW_AT_name("SetpointValue")
    5397                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5398                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5399                      .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5400                      .dwattr $C$DW$365, DW_AT_decl_line(0x30)
    5401                      .dwattr $C$DW$365, DW_AT_decl_column(0x0c)
    5402              
    5403              $C$DW$366       .dwtag  DW_TAG_member
    5404                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$28)
    5405                      .dwattr $C$DW$366, DW_AT_name("EqualFlag")
    5406                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5407                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5408                      .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5409                      .dwattr $C$DW$366, DW_AT_decl_line(0x31)
    5410                      .dwattr $C$DW$366, DW_AT_decl_column(0x0c)
    5411              
    5412              $C$DW$367       .dwtag  DW_TAG_member
    5413                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    5414                      .dwattr $C$DW$367, DW_AT_name("Tmp")
    5415                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5416                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5417                      .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5418                      .dwattr $C$DW$367, DW_AT_decl_line(0x32)
    5419                      .dwattr $C$DW$367, DW_AT_decl_column(0x0c)
    5420              
    5421                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5422                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x2a)
    5423                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5424                      .dwendtag $C$DW$T$29
    5425              
    5426                      .dwendtag $C$DW$TU$29
    5427              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  105

    5428              
    5429              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    5430                      .dwmtype  $C$DW$T$95
    5431              $C$DW$T$95      .dwtag  DW_TAG_typedef
    5432                      .dwattr $C$DW$T$95, DW_AT_name("RMPCNTL")
    5433                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$29)
    5434                      .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5435                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x33)
    5436                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    5437              
    5438                      .dwendtag $C$DW$TU$95
    5439              
    5440              
    5441              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5442                      .dwmtype  $C$DW$T$30
    5443              
    5444              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5445                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    5446              $C$DW$368       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$21)
    5448                      .dwattr $C$DW$368, DW_AT_name("As")
    5449                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5450                      .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5451                      .dwattr $C$DW$368, DW_AT_decl_line(0x2a)
    5452                      .dwattr $C$DW$368, DW_AT_decl_column(0x1e)
    5453              
    5454              $C$DW$369       .dwtag  DW_TAG_member
    5455                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    5456                      .dwattr $C$DW$369, DW_AT_name("Bs")
    5457                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5458                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5459                      .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5460                      .dwattr $C$DW$369, DW_AT_decl_line(0x2b)
    5461                      .dwattr $C$DW$369, DW_AT_decl_column(0x12)
    5462              
    5463              $C$DW$370       .dwtag  DW_TAG_member
    5464                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    5465                      .dwattr $C$DW$370, DW_AT_name("Cs")
    5466                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5467                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5468                      .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5469                      .dwattr $C$DW$370, DW_AT_decl_line(0x2c)
    5470                      .dwattr $C$DW$370, DW_AT_decl_column(0x12)
    5471              
    5472              $C$DW$371       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    5474                      .dwattr $C$DW$371, DW_AT_name("Alpha")
    5475                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5476                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5477                      .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5478                      .dwattr $C$DW$371, DW_AT_decl_line(0x2d)
    5479                      .dwattr $C$DW$371, DW_AT_decl_column(0x12)
    5480              
    5481              $C$DW$372       .dwtag  DW_TAG_member
    5482                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  106

    5483                      .dwattr $C$DW$372, DW_AT_name("Beta")
    5484                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5485                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5486                      .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5487                      .dwattr $C$DW$372, DW_AT_decl_line(0x2e)
    5488                      .dwattr $C$DW$372, DW_AT_decl_column(0x12)
    5489              
    5490                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5491                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2a)
    5492                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    5493                      .dwendtag $C$DW$T$30
    5494              
    5495                      .dwendtag $C$DW$TU$30
    5496              
    5497              
    5498              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    5499                      .dwmtype  $C$DW$T$96
    5500              $C$DW$T$96      .dwtag  DW_TAG_typedef
    5501                      .dwattr $C$DW$T$96, DW_AT_name("CLARKE")
    5502                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$30)
    5503                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5504                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x2f)
    5505                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x09)
    5506              
    5507                      .dwendtag $C$DW$TU$96
    5508              
    5509              
    5510              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5511                      .dwmtype  $C$DW$T$31
    5512              
    5513              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5514                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    5515              $C$DW$373       .dwtag  DW_TAG_member
    5516                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
    5517                      .dwattr $C$DW$373, DW_AT_name("Alpha")
    5518                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5519                      .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5520                      .dwattr $C$DW$373, DW_AT_decl_line(0x29)
    5521                      .dwattr $C$DW$373, DW_AT_decl_column(0x1e)
    5522              
    5523              $C$DW$374       .dwtag  DW_TAG_member
    5524                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    5525                      .dwattr $C$DW$374, DW_AT_name("Beta")
    5526                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5527                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5528                      .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5529                      .dwattr $C$DW$374, DW_AT_decl_line(0x2a)
    5530                      .dwattr $C$DW$374, DW_AT_decl_column(0x12)
    5531              
    5532              $C$DW$375       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    5534                      .dwattr $C$DW$375, DW_AT_name("Angle")
    5535                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5536                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5537                      .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  107

    5538                      .dwattr $C$DW$375, DW_AT_decl_line(0x2b)
    5539                      .dwattr $C$DW$375, DW_AT_decl_column(0x12)
    5540              
    5541              $C$DW$376       .dwtag  DW_TAG_member
    5542                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    5543                      .dwattr $C$DW$376, DW_AT_name("Ds")
    5544                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5545                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5546                      .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5547                      .dwattr $C$DW$376, DW_AT_decl_line(0x2c)
    5548                      .dwattr $C$DW$376, DW_AT_decl_column(0x12)
    5549              
    5550              $C$DW$377       .dwtag  DW_TAG_member
    5551                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    5552                      .dwattr $C$DW$377, DW_AT_name("Qs")
    5553                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5554                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5555                      .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5556                      .dwattr $C$DW$377, DW_AT_decl_line(0x2d)
    5557                      .dwattr $C$DW$377, DW_AT_decl_column(0x12)
    5558              
    5559              $C$DW$378       .dwtag  DW_TAG_member
    5560                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    5561                      .dwattr $C$DW$378, DW_AT_name("Sine")
    5562                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5563                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5564                      .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5565                      .dwattr $C$DW$378, DW_AT_decl_line(0x2e)
    5566                      .dwattr $C$DW$378, DW_AT_decl_column(0x12)
    5567              
    5568              $C$DW$379       .dwtag  DW_TAG_member
    5569                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    5570                      .dwattr $C$DW$379, DW_AT_name("Cosine")
    5571                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5572                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5573                      .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5574                      .dwattr $C$DW$379, DW_AT_decl_line(0x2f)
    5575                      .dwattr $C$DW$379, DW_AT_decl_column(0x12)
    5576              
    5577                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5578                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x29)
    5579                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5580                      .dwendtag $C$DW$T$31
    5581              
    5582                      .dwendtag $C$DW$TU$31
    5583              
    5584              
    5585              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    5586                      .dwmtype  $C$DW$T$97
    5587              $C$DW$T$97      .dwtag  DW_TAG_typedef
    5588                      .dwattr $C$DW$T$97, DW_AT_name("PARK")
    5589                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$31)
    5590                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5591                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x30)
    5592                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x09)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  108

    5593              
    5594                      .dwendtag $C$DW$TU$97
    5595              
    5596              
    5597              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    5598                      .dwmtype  $C$DW$T$32
    5599              
    5600              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5601                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5602              $C$DW$380       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    5604                      .dwattr $C$DW$380, DW_AT_name("Alpha")
    5605                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5606                      .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5607                      .dwattr $C$DW$380, DW_AT_decl_line(0x29)
    5608                      .dwattr $C$DW$380, DW_AT_decl_column(0x1e)
    5609              
    5610              $C$DW$381       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    5612                      .dwattr $C$DW$381, DW_AT_name("Beta")
    5613                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5614                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5615                      .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5616                      .dwattr $C$DW$381, DW_AT_decl_line(0x2a)
    5617                      .dwattr $C$DW$381, DW_AT_decl_column(0x12)
    5618              
    5619              $C$DW$382       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    5621                      .dwattr $C$DW$382, DW_AT_name("Angle")
    5622                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5623                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5624                      .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5625                      .dwattr $C$DW$382, DW_AT_decl_line(0x2b)
    5626                      .dwattr $C$DW$382, DW_AT_decl_column(0x12)
    5627              
    5628              $C$DW$383       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    5630                      .dwattr $C$DW$383, DW_AT_name("Ds")
    5631                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5632                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5633                      .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5634                      .dwattr $C$DW$383, DW_AT_decl_line(0x2c)
    5635                      .dwattr $C$DW$383, DW_AT_decl_column(0x12)
    5636              
    5637              $C$DW$384       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$21)
    5639                      .dwattr $C$DW$384, DW_AT_name("Qs")
    5640                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5641                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5642                      .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5643                      .dwattr $C$DW$384, DW_AT_decl_line(0x2d)
    5644                      .dwattr $C$DW$384, DW_AT_decl_column(0x12)
    5645              
    5646              $C$DW$385       .dwtag  DW_TAG_member
    5647                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  109

    5648                      .dwattr $C$DW$385, DW_AT_name("Sine")
    5649                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5650                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5651                      .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5652                      .dwattr $C$DW$385, DW_AT_decl_line(0x2e)
    5653                      .dwattr $C$DW$385, DW_AT_decl_column(0x12)
    5654              
    5655              $C$DW$386       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    5657                      .dwattr $C$DW$386, DW_AT_name("Cosine")
    5658                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5659                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5660                      .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5661                      .dwattr $C$DW$386, DW_AT_decl_line(0x2f)
    5662                      .dwattr $C$DW$386, DW_AT_decl_column(0x12)
    5663              
    5664                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5665                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x29)
    5666                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5667                      .dwendtag $C$DW$T$32
    5668              
    5669                      .dwendtag $C$DW$TU$32
    5670              
    5671              
    5672              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    5673                      .dwmtype  $C$DW$T$98
    5674              $C$DW$T$98      .dwtag  DW_TAG_typedef
    5675                      .dwattr $C$DW$T$98, DW_AT_name("IPARK")
    5676                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$32)
    5677                      .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5678                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x30)
    5679                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x0b)
    5680              
    5681                      .dwendtag $C$DW$TU$98
    5682              
    5683              
    5684              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5685                      .dwmtype  $C$DW$T$35
    5686              
    5687              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5688                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    5689              $C$DW$387       .dwtag  DW_TAG_member
    5690                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    5691                      .dwattr $C$DW$387, DW_AT_name("Ualpha")
    5692                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5693                      .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5694                      .dwattr $C$DW$387, DW_AT_decl_line(0x2b)
    5695                      .dwattr $C$DW$387, DW_AT_decl_column(0x10)
    5696              
    5697              $C$DW$388       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    5699                      .dwattr $C$DW$388, DW_AT_name("Ubeta")
    5700                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5701                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5702                      .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  110

    5703                      .dwattr $C$DW$388, DW_AT_decl_line(0x2c)
    5704                      .dwattr $C$DW$388, DW_AT_decl_column(0x10)
    5705              
    5706              $C$DW$389       .dwtag  DW_TAG_member
    5707                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
    5708                      .dwattr $C$DW$389, DW_AT_name("Ta")
    5709                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5710                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5711                      .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5712                      .dwattr $C$DW$389, DW_AT_decl_line(0x2d)
    5713                      .dwattr $C$DW$389, DW_AT_decl_column(0x10)
    5714              
    5715              $C$DW$390       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
    5717                      .dwattr $C$DW$390, DW_AT_name("Tb")
    5718                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5719                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5720                      .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5721                      .dwattr $C$DW$390, DW_AT_decl_line(0x2e)
    5722                      .dwattr $C$DW$390, DW_AT_decl_column(0x10)
    5723              
    5724              $C$DW$391       .dwtag  DW_TAG_member
    5725                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$21)
    5726                      .dwattr $C$DW$391, DW_AT_name("Tc")
    5727                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5728                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5729                      .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5730                      .dwattr $C$DW$391, DW_AT_decl_line(0x2f)
    5731                      .dwattr $C$DW$391, DW_AT_decl_column(0x10)
    5732              
    5733              $C$DW$392       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
    5735                      .dwattr $C$DW$392, DW_AT_name("tmp1")
    5736                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5737                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5738                      .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5739                      .dwattr $C$DW$392, DW_AT_decl_line(0x30)
    5740                      .dwattr $C$DW$392, DW_AT_decl_column(0x10)
    5741              
    5742              $C$DW$393       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    5744                      .dwattr $C$DW$393, DW_AT_name("tmp2")
    5745                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5746                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5747                      .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5748                      .dwattr $C$DW$393, DW_AT_decl_line(0x31)
    5749                      .dwattr $C$DW$393, DW_AT_decl_column(0x10)
    5750              
    5751              $C$DW$394       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$21)
    5753                      .dwattr $C$DW$394, DW_AT_name("tmp3")
    5754                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5755                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5756                      .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5757                      .dwattr $C$DW$394, DW_AT_decl_line(0x32)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  111

    5758                      .dwattr $C$DW$394, DW_AT_decl_column(0x10)
    5759              
    5760              $C$DW$395       .dwtag  DW_TAG_member
    5761                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$34)
    5762                      .dwattr $C$DW$395, DW_AT_name("VecSector")
    5763                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5764                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5765                      .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5766                      .dwattr $C$DW$395, DW_AT_decl_line(0x33)
    5767                      .dwattr $C$DW$395, DW_AT_decl_column(0x0b)
    5768              
    5769                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5770                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    5771                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
    5772                      .dwendtag $C$DW$T$35
    5773              
    5774                      .dwendtag $C$DW$TU$35
    5775              
    5776              
    5777              $C$DW$TU$99     .dwtag  DW_TAG_type_unit
    5778                      .dwmtype  $C$DW$T$99
    5779              $C$DW$T$99      .dwtag  DW_TAG_typedef
    5780                      .dwattr $C$DW$T$99, DW_AT_name("SVGEN")
    5781                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$35)
    5782                      .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5783                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x34)
    5784                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x04)
    5785              
    5786                      .dwendtag $C$DW$TU$99
    5787              
    5788              
    5789              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5790                      .dwmtype  $C$DW$T$38
    5791              
    5792              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5793                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    5794              $C$DW$396       .dwtag  DW_TAG_member
    5795                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    5796                      .dwattr $C$DW$396, DW_AT_name("ElecTheta")
    5797                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5798                      .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5799                      .dwattr $C$DW$396, DW_AT_decl_line(0x2b)
    5800                      .dwattr $C$DW$396, DW_AT_decl_column(0x12)
    5801              
    5802              $C$DW$397       .dwtag  DW_TAG_member
    5803                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$28)
    5804                      .dwattr $C$DW$397, DW_AT_name("DirectionQep")
    5805                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5806                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5807                      .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5808                      .dwattr $C$DW$397, DW_AT_decl_line(0x2c)
    5809                      .dwattr $C$DW$397, DW_AT_decl_column(0x11)
    5810              
    5811              $C$DW$398       .dwtag  DW_TAG_member
    5812                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  112

    5813                      .dwattr $C$DW$398, DW_AT_name("OldElecTheta")
    5814                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5815                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5816                      .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5817                      .dwattr $C$DW$398, DW_AT_decl_line(0x2d)
    5818                      .dwattr $C$DW$398, DW_AT_decl_column(0x12)
    5819              
    5820              $C$DW$399       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    5822                      .dwattr $C$DW$399, DW_AT_name("Speed")
    5823                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5824                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5825                      .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5826                      .dwattr $C$DW$399, DW_AT_decl_line(0x2e)
    5827                      .dwattr $C$DW$399, DW_AT_decl_column(0x12)
    5828              
    5829              $C$DW$400       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$28)
    5831                      .dwattr $C$DW$400, DW_AT_name("BaseRpm")
    5832                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5833                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5834                      .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5835                      .dwattr $C$DW$400, DW_AT_decl_line(0x2f)
    5836                      .dwattr $C$DW$400, DW_AT_decl_column(0x11)
    5837              
    5838              $C$DW$401       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    5840                      .dwattr $C$DW$401, DW_AT_name("K1")
    5841                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5842                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5843                      .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5844                      .dwattr $C$DW$401, DW_AT_decl_line(0x30)
    5845                      .dwattr $C$DW$401, DW_AT_decl_column(0x12)
    5846              
    5847              $C$DW$402       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$21)
    5849                      .dwattr $C$DW$402, DW_AT_name("K2")
    5850                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5851                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5852                      .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5853                      .dwattr $C$DW$402, DW_AT_decl_line(0x31)
    5854                      .dwattr $C$DW$402, DW_AT_decl_column(0x12)
    5855              
    5856              $C$DW$403       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    5858                      .dwattr $C$DW$403, DW_AT_name("K3")
    5859                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5860                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5861                      .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5862                      .dwattr $C$DW$403, DW_AT_decl_line(0x32)
    5863                      .dwattr $C$DW$403, DW_AT_decl_column(0x12)
    5864              
    5865              $C$DW$404       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$37)
    5867                      .dwattr $C$DW$404, DW_AT_name("SpeedRpm")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  113

    5868                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5869                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5870                      .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5871                      .dwattr $C$DW$404, DW_AT_decl_line(0x33)
    5872                      .dwattr $C$DW$404, DW_AT_decl_column(0x10)
    5873              
    5874              $C$DW$405       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$21)
    5876                      .dwattr $C$DW$405, DW_AT_name("Tmp")
    5877                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5878                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5879                      .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5880                      .dwattr $C$DW$405, DW_AT_decl_line(0x34)
    5881                      .dwattr $C$DW$405, DW_AT_decl_column(0x12)
    5882              
    5883                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5884                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2a)
    5885                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5886                      .dwendtag $C$DW$T$38
    5887              
    5888                      .dwendtag $C$DW$TU$38
    5889              
    5890              
    5891              $C$DW$TU$100    .dwtag  DW_TAG_type_unit
    5892                      .dwmtype  $C$DW$T$100
    5893              $C$DW$T$100     .dwtag  DW_TAG_typedef
    5894                      .dwattr $C$DW$T$100, DW_AT_name("SPEED_MEAS_QEP")
    5895                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$38)
    5896                      .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    5897                      .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
    5898                      .dwattr $C$DW$T$100, DW_AT_decl_column(0x0a)
    5899              
    5900                      .dwendtag $C$DW$TU$100
    5901              
    5902              
    5903              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5904                      .dwmtype  $C$DW$T$39
    5905              
    5906              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5907                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    5908              $C$DW$406       .dwtag  DW_TAG_member
    5909                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    5910                      .dwattr $C$DW$406, DW_AT_name("Ref")
    5911                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5912                      .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5913                      .dwattr $C$DW$406, DW_AT_decl_line(0x2a)
    5914                      .dwattr $C$DW$406, DW_AT_decl_column(0x1e)
    5915              
    5916              $C$DW$407       .dwtag  DW_TAG_member
    5917                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$21)
    5918                      .dwattr $C$DW$407, DW_AT_name("Fbk")
    5919                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5920                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5921                      .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5922                      .dwattr $C$DW$407, DW_AT_decl_line(0x2b)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  114

    5923                      .dwattr $C$DW$407, DW_AT_decl_column(0x12)
    5924              
    5925              $C$DW$408       .dwtag  DW_TAG_member
    5926                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$21)
    5927                      .dwattr $C$DW$408, DW_AT_name("Out")
    5928                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5929                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5930                      .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5931                      .dwattr $C$DW$408, DW_AT_decl_line(0x2c)
    5932                      .dwattr $C$DW$408, DW_AT_decl_column(0x12)
    5933              
    5934              $C$DW$409       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    5936                      .dwattr $C$DW$409, DW_AT_name("c1")
    5937                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5938                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5939                      .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5940                      .dwattr $C$DW$409, DW_AT_decl_line(0x2d)
    5941                      .dwattr $C$DW$409, DW_AT_decl_column(0x12)
    5942              
    5943              $C$DW$410       .dwtag  DW_TAG_member
    5944                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$21)
    5945                      .dwattr $C$DW$410, DW_AT_name("c2")
    5946                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5947                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5948                      .dwattr $C$DW$410, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5949                      .dwattr $C$DW$410, DW_AT_decl_line(0x2e)
    5950                      .dwattr $C$DW$410, DW_AT_decl_column(0x12)
    5951              
    5952                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5953                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x2a)
    5954                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5955                      .dwendtag $C$DW$T$39
    5956              
    5957                      .dwendtag $C$DW$TU$39
    5958              
    5959              
    5960              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5961                      .dwmtype  $C$DW$T$42
    5962              $C$DW$T$42      .dwtag  DW_TAG_typedef
    5963                      .dwattr $C$DW$T$42, DW_AT_name("PID_TERMINALS")
    5964                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    5965                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5966                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2f)
    5967                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x07)
    5968              
    5969                      .dwendtag $C$DW$TU$42
    5970              
    5971              
    5972              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5973                      .dwmtype  $C$DW$T$40
    5974              
    5975              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5976                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    5977              $C$DW$411       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  115

    5978                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$21)
    5979                      .dwattr $C$DW$411, DW_AT_name("Kr")
    5980                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5981                      .dwattr $C$DW$411, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5982                      .dwattr $C$DW$411, DW_AT_decl_line(0x32)
    5983                      .dwattr $C$DW$411, DW_AT_decl_column(0x1e)
    5984              
    5985              $C$DW$412       .dwtag  DW_TAG_member
    5986                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$21)
    5987                      .dwattr $C$DW$412, DW_AT_name("Kp")
    5988                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5989                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5990                      .dwattr $C$DW$412, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5991                      .dwattr $C$DW$412, DW_AT_decl_line(0x33)
    5992                      .dwattr $C$DW$412, DW_AT_decl_column(0x12)
    5993              
    5994              $C$DW$413       .dwtag  DW_TAG_member
    5995                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    5996                      .dwattr $C$DW$413, DW_AT_name("Ki")
    5997                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5998                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5999                      .dwattr $C$DW$413, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6000                      .dwattr $C$DW$413, DW_AT_decl_line(0x34)
    6001                      .dwattr $C$DW$413, DW_AT_decl_column(0x12)
    6002              
    6003              $C$DW$414       .dwtag  DW_TAG_member
    6004                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$21)
    6005                      .dwattr $C$DW$414, DW_AT_name("Kd")
    6006                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6007                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6008                      .dwattr $C$DW$414, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6009                      .dwattr $C$DW$414, DW_AT_decl_line(0x35)
    6010                      .dwattr $C$DW$414, DW_AT_decl_column(0x12)
    6011              
    6012              $C$DW$415       .dwtag  DW_TAG_member
    6013                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    6014                      .dwattr $C$DW$415, DW_AT_name("Km")
    6015                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6016                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6017                      .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6018                      .dwattr $C$DW$415, DW_AT_decl_line(0x36)
    6019                      .dwattr $C$DW$415, DW_AT_decl_column(0x12)
    6020              
    6021              $C$DW$416       .dwtag  DW_TAG_member
    6022                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    6023                      .dwattr $C$DW$416, DW_AT_name("Umax")
    6024                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6025                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6026                      .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6027                      .dwattr $C$DW$416, DW_AT_decl_line(0x37)
    6028                      .dwattr $C$DW$416, DW_AT_decl_column(0x12)
    6029              
    6030              $C$DW$417       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$21)
    6032                      .dwattr $C$DW$417, DW_AT_name("Umin")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  116

    6033                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6034                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6035                      .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6036                      .dwattr $C$DW$417, DW_AT_decl_line(0x38)
    6037                      .dwattr $C$DW$417, DW_AT_decl_column(0x12)
    6038              
    6039                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6040                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x32)
    6041                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6042                      .dwendtag $C$DW$T$40
    6043              
    6044                      .dwendtag $C$DW$TU$40
    6045              
    6046              
    6047              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    6048                      .dwmtype  $C$DW$T$43
    6049              $C$DW$T$43      .dwtag  DW_TAG_typedef
    6050                      .dwattr $C$DW$T$43, DW_AT_name("PID_PARAMETERS")
    6051                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    6052                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6053                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x39)
    6054                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x07)
    6055              
    6056                      .dwendtag $C$DW$TU$43
    6057              
    6058              
    6059              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6060                      .dwmtype  $C$DW$T$41
    6061              
    6062              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6063                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    6064              $C$DW$418       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    6066                      .dwattr $C$DW$418, DW_AT_name("up")
    6067                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6068                      .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6069                      .dwattr $C$DW$418, DW_AT_decl_line(0x3b)
    6070                      .dwattr $C$DW$418, DW_AT_decl_column(0x1e)
    6071              
    6072              $C$DW$419       .dwtag  DW_TAG_member
    6073                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
    6074                      .dwattr $C$DW$419, DW_AT_name("ui")
    6075                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6076                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6077                      .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6078                      .dwattr $C$DW$419, DW_AT_decl_line(0x3c)
    6079                      .dwattr $C$DW$419, DW_AT_decl_column(0x12)
    6080              
    6081              $C$DW$420       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    6083                      .dwattr $C$DW$420, DW_AT_name("ud")
    6084                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6085                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6086                      .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6087                      .dwattr $C$DW$420, DW_AT_decl_line(0x3d)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  117

    6088                      .dwattr $C$DW$420, DW_AT_decl_column(0x12)
    6089              
    6090              $C$DW$421       .dwtag  DW_TAG_member
    6091                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    6092                      .dwattr $C$DW$421, DW_AT_name("v1")
    6093                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6094                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6095                      .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6096                      .dwattr $C$DW$421, DW_AT_decl_line(0x3e)
    6097                      .dwattr $C$DW$421, DW_AT_decl_column(0x12)
    6098              
    6099              $C$DW$422       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    6101                      .dwattr $C$DW$422, DW_AT_name("i1")
    6102                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6103                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6104                      .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6105                      .dwattr $C$DW$422, DW_AT_decl_line(0x3f)
    6106                      .dwattr $C$DW$422, DW_AT_decl_column(0x12)
    6107              
    6108              $C$DW$423       .dwtag  DW_TAG_member
    6109                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$21)
    6110                      .dwattr $C$DW$423, DW_AT_name("d1")
    6111                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6112                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6113                      .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6114                      .dwattr $C$DW$423, DW_AT_decl_line(0x40)
    6115                      .dwattr $C$DW$423, DW_AT_decl_column(0x12)
    6116              
    6117              $C$DW$424       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$21)
    6119                      .dwattr $C$DW$424, DW_AT_name("d2")
    6120                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6121                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6122                      .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6123                      .dwattr $C$DW$424, DW_AT_decl_line(0x41)
    6124                      .dwattr $C$DW$424, DW_AT_decl_column(0x12)
    6125              
    6126              $C$DW$425       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    6128                      .dwattr $C$DW$425, DW_AT_name("w1")
    6129                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6130                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6131                      .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6132                      .dwattr $C$DW$425, DW_AT_decl_line(0x42)
    6133                      .dwattr $C$DW$425, DW_AT_decl_column(0x12)
    6134              
    6135                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6136                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x3b)
    6137                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6138                      .dwendtag $C$DW$T$41
    6139              
    6140                      .dwendtag $C$DW$TU$41
    6141              
    6142              
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  118

    6143              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    6144                      .dwmtype  $C$DW$T$44
    6145              $C$DW$T$44      .dwtag  DW_TAG_typedef
    6146                      .dwattr $C$DW$T$44, DW_AT_name("PID_DATA")
    6147                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$41)
    6148                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6149                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x43)
    6150                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x07)
    6151              
    6152                      .dwendtag $C$DW$TU$44
    6153              
    6154              
    6155              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    6156                      .dwmtype  $C$DW$T$45
    6157              
    6158              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6159                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x28)
    6160              $C$DW$426       .dwtag  DW_TAG_member
    6161                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$42)
    6162                      .dwattr $C$DW$426, DW_AT_name("term")
    6163                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6164                      .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6165                      .dwattr $C$DW$426, DW_AT_decl_line(0x46)
    6166                      .dwattr $C$DW$426, DW_AT_decl_column(0x21)
    6167              
    6168              $C$DW$427       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$43)
    6170                      .dwattr $C$DW$427, DW_AT_name("param")
    6171                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6172                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6173                      .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6174                      .dwattr $C$DW$427, DW_AT_decl_line(0x47)
    6175                      .dwattr $C$DW$427, DW_AT_decl_column(0x16)
    6176              
    6177              $C$DW$428       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$44)
    6179                      .dwattr $C$DW$428, DW_AT_name("data")
    6180                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6181                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6182                      .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6183                      .dwattr $C$DW$428, DW_AT_decl_line(0x48)
    6184                      .dwattr $C$DW$428, DW_AT_decl_column(0x11)
    6185              
    6186                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6187                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x46)
    6188                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    6189                      .dwendtag $C$DW$T$45
    6190              
    6191                      .dwendtag $C$DW$TU$45
    6192              
    6193              
    6194              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6195                      .dwmtype  $C$DW$T$102
    6196              $C$DW$T$102     .dwtag  DW_TAG_typedef
    6197                      .dwattr $C$DW$T$102, DW_AT_name("PID_CONTROLLER")
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  119

    6198                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$45)
    6199                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    6200                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x49)
    6201                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x07)
    6202              
    6203                      .dwendtag $C$DW$TU$102
    6204              
    6205              
    6206              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    6207                      .dwmtype  $C$DW$T$46
    6208              
    6209              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6210                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    6211              $C$DW$429       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$21)
    6213                      .dwattr $C$DW$429, DW_AT_name("Ref")
    6214                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6215                      .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6216                      .dwattr $C$DW$429, DW_AT_decl_line(0x2a)
    6217                      .dwattr $C$DW$429, DW_AT_decl_column(0x1e)
    6218              
    6219              $C$DW$430       .dwtag  DW_TAG_member
    6220                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    6221                      .dwattr $C$DW$430, DW_AT_name("Fbk")
    6222                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6223                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6224                      .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6225                      .dwattr $C$DW$430, DW_AT_decl_line(0x2b)
    6226                      .dwattr $C$DW$430, DW_AT_decl_column(0x12)
    6227              
    6228              $C$DW$431       .dwtag  DW_TAG_member
    6229                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$21)
    6230                      .dwattr $C$DW$431, DW_AT_name("Out")
    6231                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6232                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6233                      .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6234                      .dwattr $C$DW$431, DW_AT_decl_line(0x2c)
    6235                      .dwattr $C$DW$431, DW_AT_decl_column(0x12)
    6236              
    6237              $C$DW$432       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$21)
    6239                      .dwattr $C$DW$432, DW_AT_name("Kp")
    6240                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6241                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6242                      .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6243                      .dwattr $C$DW$432, DW_AT_decl_line(0x2d)
    6244                      .dwattr $C$DW$432, DW_AT_decl_column(0x12)
    6245              
    6246              $C$DW$433       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
    6248                      .dwattr $C$DW$433, DW_AT_name("Ki")
    6249                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6250                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6251                      .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6252                      .dwattr $C$DW$433, DW_AT_decl_line(0x2e)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  120

    6253                      .dwattr $C$DW$433, DW_AT_decl_column(0x12)
    6254              
    6255              $C$DW$434       .dwtag  DW_TAG_member
    6256                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    6257                      .dwattr $C$DW$434, DW_AT_name("Umax")
    6258                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6259                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6260                      .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6261                      .dwattr $C$DW$434, DW_AT_decl_line(0x2f)
    6262                      .dwattr $C$DW$434, DW_AT_decl_column(0x12)
    6263              
    6264              $C$DW$435       .dwtag  DW_TAG_member
    6265                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$21)
    6266                      .dwattr $C$DW$435, DW_AT_name("Umin")
    6267                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6268                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6269                      .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6270                      .dwattr $C$DW$435, DW_AT_decl_line(0x30)
    6271                      .dwattr $C$DW$435, DW_AT_decl_column(0x12)
    6272              
    6273              $C$DW$436       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    6275                      .dwattr $C$DW$436, DW_AT_name("up")
    6276                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6277                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6278                      .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6279                      .dwattr $C$DW$436, DW_AT_decl_line(0x31)
    6280                      .dwattr $C$DW$436, DW_AT_decl_column(0x12)
    6281              
    6282              $C$DW$437       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    6284                      .dwattr $C$DW$437, DW_AT_name("ui")
    6285                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6286                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6287                      .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6288                      .dwattr $C$DW$437, DW_AT_decl_line(0x32)
    6289                      .dwattr $C$DW$437, DW_AT_decl_column(0x12)
    6290              
    6291              $C$DW$438       .dwtag  DW_TAG_member
    6292                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$21)
    6293                      .dwattr $C$DW$438, DW_AT_name("v1")
    6294                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6295                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6296                      .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6297                      .dwattr $C$DW$438, DW_AT_decl_line(0x33)
    6298                      .dwattr $C$DW$438, DW_AT_decl_column(0x12)
    6299              
    6300              $C$DW$439       .dwtag  DW_TAG_member
    6301                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$21)
    6302                      .dwattr $C$DW$439, DW_AT_name("i1")
    6303                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6304                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6305                      .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6306                      .dwattr $C$DW$439, DW_AT_decl_line(0x34)
    6307                      .dwattr $C$DW$439, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Fri Dec 19 11:01:59 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  121

    6308              
    6309              $C$DW$440       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$21)
    6311                      .dwattr $C$DW$440, DW_AT_name("w1")
    6312                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6313                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6314                      .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6315                      .dwattr $C$DW$440, DW_AT_decl_line(0x35)
    6316                      .dwattr $C$DW$440, DW_AT_decl_column(0x12)
    6317              
