TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Dec 23 16:22:00 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_user_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FCL_initADC_2In")

    4734                      .dwattr $C$DW$235, DW_AT_name("ADC_SOC_NUMBER9")
    4735                      .dwattr $C$DW$235, DW_AT_const_value(0x09)
    4736                      .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4737                      .dwattr $C$DW$235, DW_AT_decl_line(0x111)
    4738                      .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    4739              
    4740              $C$DW$236       .dwtag  DW_TAG_enumerator
    4741                      .dwattr $C$DW$236, DW_AT_name("ADC_SOC_NUMBER10")
    4742                      .dwattr $C$DW$236, DW_AT_const_value(0x0a)
    4743                      .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4744                      .dwattr $C$DW$236, DW_AT_decl_line(0x112)
    4745                      .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    4746              
    4747              $C$DW$237       .dwtag  DW_TAG_enumerator
    4748                      .dwattr $C$DW$237, DW_AT_name("ADC_SOC_NUMBER11")
    4749                      .dwattr $C$DW$237, DW_AT_const_value(0x0b)
    4750                      .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4751                      .dwattr $C$DW$237, DW_AT_decl_line(0x113)
    4752                      .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    4753              
    4754              $C$DW$238       .dwtag  DW_TAG_enumerator
    4755                      .dwattr $C$DW$238, DW_AT_name("ADC_SOC_NUMBER12")
    4756                      .dwattr $C$DW$238, DW_AT_const_value(0x0c)
    4757                      .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4758                      .dwattr $C$DW$238, DW_AT_decl_line(0x114)
    4759                      .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    4760              
    4761              $C$DW$239       .dwtag  DW_TAG_enumerator
    4762                      .dwattr $C$DW$239, DW_AT_name("ADC_SOC_NUMBER13")
    4763                      .dwattr $C$DW$239, DW_AT_const_value(0x0d)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE   99

    4764                      .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4765                      .dwattr $C$DW$239, DW_AT_decl_line(0x115)
    4766                      .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    4767              
    4768              $C$DW$240       .dwtag  DW_TAG_enumerator
    4769                      .dwattr $C$DW$240, DW_AT_name("ADC_SOC_NUMBER14")
    4770                      .dwattr $C$DW$240, DW_AT_const_value(0x0e)
    4771                      .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4772                      .dwattr $C$DW$240, DW_AT_decl_line(0x116)
    4773                      .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    4774              
    4775              $C$DW$241       .dwtag  DW_TAG_enumerator
    4776                      .dwattr $C$DW$241, DW_AT_name("ADC_SOC_NUMBER15")
    4777                      .dwattr $C$DW$241, DW_AT_const_value(0x0f)
    4778                      .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4779                      .dwattr $C$DW$241, DW_AT_decl_line(0x117)
    4780                      .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    4781              
    4782                      .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4783                      .dwattr $C$DW$T$120, DW_AT_decl_line(0x107)
    4784                      .dwattr $C$DW$T$120, DW_AT_decl_column(0x01)
    4785                      .dwendtag $C$DW$T$120
    4786              
    4787                      .dwendtag $C$DW$TU$120
    4788              
    4789              
    4790              $C$DW$TU$121    .dwtag  DW_TAG_type_unit
    4791                      .dwmtype  $C$DW$T$121
    4792              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4793                      .dwattr $C$DW$T$121, DW_AT_name("ADC_SOCNumber")
    4794                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4795                      .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4796                      .dwattr $C$DW$T$121, DW_AT_decl_line(0x118)
    4797                      .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    4798              
    4799                      .dwendtag $C$DW$TU$121
    4800              
    4801              
    4802              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    4803                      .dwmtype  $C$DW$T$19
    4804              
    4805              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4806                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    4807              $C$DW$242       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$12)
    4809                      .dwattr $C$DW$242, DW_AT_name("quot")
    4810                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4811                      .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4812                      .dwattr $C$DW$242, DW_AT_decl_line(0x59)
    4813                      .dwattr $C$DW$242, DW_AT_decl_column(0x17)
    4814              
    4815              $C$DW$243       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$12)
    4817                      .dwattr $C$DW$243, DW_AT_name("rem")
    4818                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  100

    4819                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4820                      .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4821                      .dwattr $C$DW$243, DW_AT_decl_line(0x59)
    4822                      .dwattr $C$DW$243, DW_AT_decl_column(0x1d)
    4823              
    4824                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4825                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    4826                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    4827                      .dwendtag $C$DW$T$19
    4828              
    4829                      .dwendtag $C$DW$TU$19
    4830              
    4831              
    4832              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    4833                      .dwmtype  $C$DW$T$123
    4834              $C$DW$T$123     .dwtag  DW_TAG_typedef
    4835                      .dwattr $C$DW$T$123, DW_AT_name("ldiv_t")
    4836                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
    4837                      .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4838                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x59)
    4839                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x24)
    4840              
    4841                      .dwendtag $C$DW$TU$123
    4842              
    4843              
    4844              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    4845                      .dwmtype  $C$DW$T$20
    4846              
    4847              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4848                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    4849              $C$DW$244       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$14)
    4851                      .dwattr $C$DW$244, DW_AT_name("quot")
    4852                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4853                      .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4854                      .dwattr $C$DW$244, DW_AT_decl_line(0x63)
    4855                      .dwattr $C$DW$244, DW_AT_decl_column(0x1c)
    4856              
    4857              $C$DW$245       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$14)
    4859                      .dwattr $C$DW$245, DW_AT_name("rem")
    4860                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4861                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4862                      .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4863                      .dwattr $C$DW$245, DW_AT_decl_line(0x63)
    4864                      .dwattr $C$DW$245, DW_AT_decl_column(0x22)
    4865              
    4866                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4867                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    4868                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    4869                      .dwendtag $C$DW$T$20
    4870              
    4871                      .dwendtag $C$DW$TU$20
    4872              
    4873              
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  101

    4874              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    4875                      .dwmtype  $C$DW$T$126
    4876              $C$DW$T$126     .dwtag  DW_TAG_typedef
    4877                      .dwattr $C$DW$T$126, DW_AT_name("lldiv_t")
    4878                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$20)
    4879                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4880                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x63)
    4881                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x29)
    4882              
    4883                      .dwendtag $C$DW$TU$126
    4884              
    4885              
    4886              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    4887                      .dwmtype  $C$DW$T$22
    4888              
    4889              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4890                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0c)
    4891              $C$DW$246       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    4893                      .dwattr $C$DW$246, DW_AT_name("Freq")
    4894                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4895                      .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4896                      .dwattr $C$DW$246, DW_AT_decl_line(0x29)
    4897                      .dwattr $C$DW$246, DW_AT_decl_column(0x1d)
    4898              
    4899              $C$DW$247       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    4901                      .dwattr $C$DW$247, DW_AT_name("StepAngleMax")
    4902                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4903                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4904                      .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4905                      .dwattr $C$DW$247, DW_AT_decl_line(0x2a)
    4906                      .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    4907              
    4908              $C$DW$248       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    4910                      .dwattr $C$DW$248, DW_AT_name("Angle")
    4911                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4912                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4913                      .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4914                      .dwattr $C$DW$248, DW_AT_decl_line(0x2b)
    4915                      .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    4916              
    4917              $C$DW$249       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$21)
    4919                      .dwattr $C$DW$249, DW_AT_name("Gain")
    4920                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4921                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4922                      .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4923                      .dwattr $C$DW$249, DW_AT_decl_line(0x2c)
    4924                      .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    4925              
    4926              $C$DW$250       .dwtag  DW_TAG_member
    4927                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
    4928                      .dwattr $C$DW$250, DW_AT_name("Out")
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  102

    4929                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4930                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4931                      .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4932                      .dwattr $C$DW$250, DW_AT_decl_line(0x2d)
    4933                      .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    4934              
    4935              $C$DW$251       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    4937                      .dwattr $C$DW$251, DW_AT_name("Offset")
    4938                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4939                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4940                      .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4941                      .dwattr $C$DW$251, DW_AT_decl_line(0x2e)
    4942                      .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    4943              
    4944                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4945                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x29)
    4946                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4947                      .dwendtag $C$DW$T$22
    4948              
    4949                      .dwendtag $C$DW$TU$22
    4950              
    4951              
    4952              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    4953                      .dwmtype  $C$DW$T$88
    4954              $C$DW$T$88      .dwtag  DW_TAG_typedef
    4955                      .dwattr $C$DW$T$88, DW_AT_name("RAMPGEN")
    4956                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$22)
    4957                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4958                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x2f)
    4959                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x0d)
    4960              
    4961                      .dwendtag $C$DW$TU$88
    4962              
    4963              
    4964              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4965                      .dwmtype  $C$DW$T$25
    4966              
    4967              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4968                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4969              $C$DW$252       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
    4971                      .dwattr $C$DW$252, DW_AT_name("TargetValue")
    4972                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4973                      .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4974                      .dwattr $C$DW$252, DW_AT_decl_line(0x2b)
    4975                      .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    4976              
    4977              $C$DW$253       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    4979                      .dwattr $C$DW$253, DW_AT_name("RampDelayMax")
    4980                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4981                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4982                      .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4983                      .dwattr $C$DW$253, DW_AT_decl_line(0x2c)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  103

    4984                      .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    4985              
    4986              $C$DW$254       .dwtag  DW_TAG_member
    4987                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
    4988                      .dwattr $C$DW$254, DW_AT_name("RampLowLimit")
    4989                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4990                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4991                      .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4992                      .dwattr $C$DW$254, DW_AT_decl_line(0x2d)
    4993                      .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
    4994              
    4995              $C$DW$255       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
    4997                      .dwattr $C$DW$255, DW_AT_name("RampHighLimit")
    4998                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4999                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5000                      .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5001                      .dwattr $C$DW$255, DW_AT_decl_line(0x2e)
    5002                      .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    5003              
    5004              $C$DW$256       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    5006                      .dwattr $C$DW$256, DW_AT_name("RampDelayCount")
    5007                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5008                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5009                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5010                      .dwattr $C$DW$256, DW_AT_decl_line(0x2f)
    5011                      .dwattr $C$DW$256, DW_AT_decl_column(0x0c)
    5012              
    5013              $C$DW$257       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    5015                      .dwattr $C$DW$257, DW_AT_name("SetpointValue")
    5016                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5017                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5018                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5019                      .dwattr $C$DW$257, DW_AT_decl_line(0x30)
    5020                      .dwattr $C$DW$257, DW_AT_decl_column(0x0c)
    5021              
    5022              $C$DW$258       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    5024                      .dwattr $C$DW$258, DW_AT_name("EqualFlag")
    5025                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5026                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5027                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5028                      .dwattr $C$DW$258, DW_AT_decl_line(0x31)
    5029                      .dwattr $C$DW$258, DW_AT_decl_column(0x0c)
    5030              
    5031              $C$DW$259       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$21)
    5033                      .dwattr $C$DW$259, DW_AT_name("Tmp")
    5034                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5035                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5036                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5037                      .dwattr $C$DW$259, DW_AT_decl_line(0x32)
    5038                      .dwattr $C$DW$259, DW_AT_decl_column(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  104

    5039              
    5040                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5041                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x2a)
    5042                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5043                      .dwendtag $C$DW$T$25
    5044              
    5045                      .dwendtag $C$DW$TU$25
    5046              
    5047              
    5048              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    5049                      .dwmtype  $C$DW$T$89
    5050              $C$DW$T$89      .dwtag  DW_TAG_typedef
    5051                      .dwattr $C$DW$T$89, DW_AT_name("RMPCNTL")
    5052                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$25)
    5053                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5054                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x33)
    5055                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    5056              
    5057                      .dwendtag $C$DW$TU$89
    5058              
    5059              
    5060              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5061                      .dwmtype  $C$DW$T$26
    5062              
    5063              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5064                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    5065              $C$DW$260       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    5067                      .dwattr $C$DW$260, DW_AT_name("As")
    5068                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5069                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5070                      .dwattr $C$DW$260, DW_AT_decl_line(0x2a)
    5071                      .dwattr $C$DW$260, DW_AT_decl_column(0x1e)
    5072              
    5073              $C$DW$261       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    5075                      .dwattr $C$DW$261, DW_AT_name("Bs")
    5076                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5077                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5078                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5079                      .dwattr $C$DW$261, DW_AT_decl_line(0x2b)
    5080                      .dwattr $C$DW$261, DW_AT_decl_column(0x12)
    5081              
    5082              $C$DW$262       .dwtag  DW_TAG_member
    5083                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    5084                      .dwattr $C$DW$262, DW_AT_name("Cs")
    5085                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5086                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5087                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5088                      .dwattr $C$DW$262, DW_AT_decl_line(0x2c)
    5089                      .dwattr $C$DW$262, DW_AT_decl_column(0x12)
    5090              
    5091              $C$DW$263       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    5093                      .dwattr $C$DW$263, DW_AT_name("Alpha")
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  105

    5094                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5095                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5096                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5097                      .dwattr $C$DW$263, DW_AT_decl_line(0x2d)
    5098                      .dwattr $C$DW$263, DW_AT_decl_column(0x12)
    5099              
    5100              $C$DW$264       .dwtag  DW_TAG_member
    5101                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    5102                      .dwattr $C$DW$264, DW_AT_name("Beta")
    5103                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5104                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5105                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5106                      .dwattr $C$DW$264, DW_AT_decl_line(0x2e)
    5107                      .dwattr $C$DW$264, DW_AT_decl_column(0x12)
    5108              
    5109                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5110                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    5111                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5112                      .dwendtag $C$DW$T$26
    5113              
    5114                      .dwendtag $C$DW$TU$26
    5115              
    5116              
    5117              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    5118                      .dwmtype  $C$DW$T$90
    5119              $C$DW$T$90      .dwtag  DW_TAG_typedef
    5120                      .dwattr $C$DW$T$90, DW_AT_name("CLARKE")
    5121                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    5122                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5123                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x2f)
    5124                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x09)
    5125              
    5126                      .dwendtag $C$DW$TU$90
    5127              
    5128              
    5129              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5130                      .dwmtype  $C$DW$T$27
    5131              
    5132              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5133                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    5134              $C$DW$265       .dwtag  DW_TAG_member
    5135                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    5136                      .dwattr $C$DW$265, DW_AT_name("Alpha")
    5137                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5138                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5139                      .dwattr $C$DW$265, DW_AT_decl_line(0x29)
    5140                      .dwattr $C$DW$265, DW_AT_decl_column(0x1e)
    5141              
    5142              $C$DW$266       .dwtag  DW_TAG_member
    5143                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$21)
    5144                      .dwattr $C$DW$266, DW_AT_name("Beta")
    5145                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5146                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5147                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5148                      .dwattr $C$DW$266, DW_AT_decl_line(0x2a)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  106

    5149                      .dwattr $C$DW$266, DW_AT_decl_column(0x12)
    5150              
    5151              $C$DW$267       .dwtag  DW_TAG_member
    5152                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    5153                      .dwattr $C$DW$267, DW_AT_name("Angle")
    5154                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5155                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5156                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5157                      .dwattr $C$DW$267, DW_AT_decl_line(0x2b)
    5158                      .dwattr $C$DW$267, DW_AT_decl_column(0x12)
    5159              
    5160              $C$DW$268       .dwtag  DW_TAG_member
    5161                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    5162                      .dwattr $C$DW$268, DW_AT_name("Ds")
    5163                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5164                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5165                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5166                      .dwattr $C$DW$268, DW_AT_decl_line(0x2c)
    5167                      .dwattr $C$DW$268, DW_AT_decl_column(0x12)
    5168              
    5169              $C$DW$269       .dwtag  DW_TAG_member
    5170                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    5171                      .dwattr $C$DW$269, DW_AT_name("Qs")
    5172                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5173                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5174                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5175                      .dwattr $C$DW$269, DW_AT_decl_line(0x2d)
    5176                      .dwattr $C$DW$269, DW_AT_decl_column(0x12)
    5177              
    5178              $C$DW$270       .dwtag  DW_TAG_member
    5179                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    5180                      .dwattr $C$DW$270, DW_AT_name("Sine")
    5181                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5182                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5183                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5184                      .dwattr $C$DW$270, DW_AT_decl_line(0x2e)
    5185                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    5186              
    5187              $C$DW$271       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    5189                      .dwattr $C$DW$271, DW_AT_name("Cosine")
    5190                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5191                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5192                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5193                      .dwattr $C$DW$271, DW_AT_decl_line(0x2f)
    5194                      .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    5195              
    5196                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5197                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    5198                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    5199                      .dwendtag $C$DW$T$27
    5200              
    5201                      .dwendtag $C$DW$TU$27
    5202              
    5203              
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  107

    5204              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    5205                      .dwmtype  $C$DW$T$91
    5206              $C$DW$T$91      .dwtag  DW_TAG_typedef
    5207                      .dwattr $C$DW$T$91, DW_AT_name("PARK")
    5208                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$27)
    5209                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5210                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x30)
    5211                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x09)
    5212              
    5213                      .dwendtag $C$DW$TU$91
    5214              
    5215              
    5216              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5217                      .dwmtype  $C$DW$T$28
    5218              
    5219              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5220                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    5221              $C$DW$272       .dwtag  DW_TAG_member
    5222                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    5223                      .dwattr $C$DW$272, DW_AT_name("Alpha")
    5224                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5225                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5226                      .dwattr $C$DW$272, DW_AT_decl_line(0x29)
    5227                      .dwattr $C$DW$272, DW_AT_decl_column(0x1e)
    5228              
    5229              $C$DW$273       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    5231                      .dwattr $C$DW$273, DW_AT_name("Beta")
    5232                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5233                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5234                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5235                      .dwattr $C$DW$273, DW_AT_decl_line(0x2a)
    5236                      .dwattr $C$DW$273, DW_AT_decl_column(0x12)
    5237              
    5238              $C$DW$274       .dwtag  DW_TAG_member
    5239                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    5240                      .dwattr $C$DW$274, DW_AT_name("Angle")
    5241                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5242                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5243                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5244                      .dwattr $C$DW$274, DW_AT_decl_line(0x2b)
    5245                      .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    5246              
    5247              $C$DW$275       .dwtag  DW_TAG_member
    5248                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    5249                      .dwattr $C$DW$275, DW_AT_name("Ds")
    5250                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5251                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5252                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5253                      .dwattr $C$DW$275, DW_AT_decl_line(0x2c)
    5254                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    5255              
    5256              $C$DW$276       .dwtag  DW_TAG_member
    5257                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    5258                      .dwattr $C$DW$276, DW_AT_name("Qs")
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  108

    5259                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5260                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5261                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5262                      .dwattr $C$DW$276, DW_AT_decl_line(0x2d)
    5263                      .dwattr $C$DW$276, DW_AT_decl_column(0x12)
    5264              
    5265              $C$DW$277       .dwtag  DW_TAG_member
    5266                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    5267                      .dwattr $C$DW$277, DW_AT_name("Sine")
    5268                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5269                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5270                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5271                      .dwattr $C$DW$277, DW_AT_decl_line(0x2e)
    5272                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    5273              
    5274              $C$DW$278       .dwtag  DW_TAG_member
    5275                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    5276                      .dwattr $C$DW$278, DW_AT_name("Cosine")
    5277                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5278                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5279                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5280                      .dwattr $C$DW$278, DW_AT_decl_line(0x2f)
    5281                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    5282              
    5283                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5284                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x29)
    5285                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5286                      .dwendtag $C$DW$T$28
    5287              
    5288                      .dwendtag $C$DW$TU$28
    5289              
    5290              
    5291              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    5292                      .dwmtype  $C$DW$T$92
    5293              $C$DW$T$92      .dwtag  DW_TAG_typedef
    5294                      .dwattr $C$DW$T$92, DW_AT_name("IPARK")
    5295                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$28)
    5296                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5297                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x30)
    5298                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x0b)
    5299              
    5300                      .dwendtag $C$DW$TU$92
    5301              
    5302              
    5303              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5304                      .dwmtype  $C$DW$T$31
    5305              
    5306              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5307                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x12)
    5308              $C$DW$279       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    5310                      .dwattr $C$DW$279, DW_AT_name("Ualpha")
    5311                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5312                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5313                      .dwattr $C$DW$279, DW_AT_decl_line(0x2b)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  109

    5314                      .dwattr $C$DW$279, DW_AT_decl_column(0x10)
    5315              
    5316              $C$DW$280       .dwtag  DW_TAG_member
    5317                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    5318                      .dwattr $C$DW$280, DW_AT_name("Ubeta")
    5319                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5320                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5321                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5322                      .dwattr $C$DW$280, DW_AT_decl_line(0x2c)
    5323                      .dwattr $C$DW$280, DW_AT_decl_column(0x10)
    5324              
    5325              $C$DW$281       .dwtag  DW_TAG_member
    5326                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    5327                      .dwattr $C$DW$281, DW_AT_name("Ta")
    5328                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5329                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5330                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5331                      .dwattr $C$DW$281, DW_AT_decl_line(0x2d)
    5332                      .dwattr $C$DW$281, DW_AT_decl_column(0x10)
    5333              
    5334              $C$DW$282       .dwtag  DW_TAG_member
    5335                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    5336                      .dwattr $C$DW$282, DW_AT_name("Tb")
    5337                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5338                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5339                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5340                      .dwattr $C$DW$282, DW_AT_decl_line(0x2e)
    5341                      .dwattr $C$DW$282, DW_AT_decl_column(0x10)
    5342              
    5343              $C$DW$283       .dwtag  DW_TAG_member
    5344                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    5345                      .dwattr $C$DW$283, DW_AT_name("Tc")
    5346                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5347                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5348                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5349                      .dwattr $C$DW$283, DW_AT_decl_line(0x2f)
    5350                      .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    5351              
    5352              $C$DW$284       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    5354                      .dwattr $C$DW$284, DW_AT_name("tmp1")
    5355                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5356                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5357                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5358                      .dwattr $C$DW$284, DW_AT_decl_line(0x30)
    5359                      .dwattr $C$DW$284, DW_AT_decl_column(0x10)
    5360              
    5361              $C$DW$285       .dwtag  DW_TAG_member
    5362                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    5363                      .dwattr $C$DW$285, DW_AT_name("tmp2")
    5364                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5365                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5366                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5367                      .dwattr $C$DW$285, DW_AT_decl_line(0x31)
    5368                      .dwattr $C$DW$285, DW_AT_decl_column(0x10)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  110

    5369              
    5370              $C$DW$286       .dwtag  DW_TAG_member
    5371                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    5372                      .dwattr $C$DW$286, DW_AT_name("tmp3")
    5373                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5374                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5375                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5376                      .dwattr $C$DW$286, DW_AT_decl_line(0x32)
    5377                      .dwattr $C$DW$286, DW_AT_decl_column(0x10)
    5378              
    5379              $C$DW$287       .dwtag  DW_TAG_member
    5380                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$30)
    5381                      .dwattr $C$DW$287, DW_AT_name("VecSector")
    5382                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5383                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5384                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5385                      .dwattr $C$DW$287, DW_AT_decl_line(0x33)
    5386                      .dwattr $C$DW$287, DW_AT_decl_column(0x0b)
    5387              
    5388                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5389                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    5390                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
    5391                      .dwendtag $C$DW$T$31
    5392              
    5393                      .dwendtag $C$DW$TU$31
    5394              
    5395              
    5396              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    5397                      .dwmtype  $C$DW$T$93
    5398              $C$DW$T$93      .dwtag  DW_TAG_typedef
    5399                      .dwattr $C$DW$T$93, DW_AT_name("SVGEN")
    5400                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$31)
    5401                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5402                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x34)
    5403                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x04)
    5404              
    5405                      .dwendtag $C$DW$TU$93
    5406              
    5407              
    5408              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    5409                      .dwmtype  $C$DW$T$34
    5410              
    5411              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5412                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    5413              $C$DW$288       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    5415                      .dwattr $C$DW$288, DW_AT_name("ElecTheta")
    5416                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5417                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5418                      .dwattr $C$DW$288, DW_AT_decl_line(0x2b)
    5419                      .dwattr $C$DW$288, DW_AT_decl_column(0x12)
    5420              
    5421              $C$DW$289       .dwtag  DW_TAG_member
    5422                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    5423                      .dwattr $C$DW$289, DW_AT_name("DirectionQep")
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  111

    5424                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5425                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5426                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5427                      .dwattr $C$DW$289, DW_AT_decl_line(0x2c)
    5428                      .dwattr $C$DW$289, DW_AT_decl_column(0x11)
    5429              
    5430              $C$DW$290       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    5432                      .dwattr $C$DW$290, DW_AT_name("OldElecTheta")
    5433                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5434                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5435                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5436                      .dwattr $C$DW$290, DW_AT_decl_line(0x2d)
    5437                      .dwattr $C$DW$290, DW_AT_decl_column(0x12)
    5438              
    5439              $C$DW$291       .dwtag  DW_TAG_member
    5440                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    5441                      .dwattr $C$DW$291, DW_AT_name("Speed")
    5442                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5443                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5444                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5445                      .dwattr $C$DW$291, DW_AT_decl_line(0x2e)
    5446                      .dwattr $C$DW$291, DW_AT_decl_column(0x12)
    5447              
    5448              $C$DW$292       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$24)
    5450                      .dwattr $C$DW$292, DW_AT_name("BaseRpm")
    5451                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5452                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5453                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5454                      .dwattr $C$DW$292, DW_AT_decl_line(0x2f)
    5455                      .dwattr $C$DW$292, DW_AT_decl_column(0x11)
    5456              
    5457              $C$DW$293       .dwtag  DW_TAG_member
    5458                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    5459                      .dwattr $C$DW$293, DW_AT_name("K1")
    5460                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5461                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5462                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5463                      .dwattr $C$DW$293, DW_AT_decl_line(0x30)
    5464                      .dwattr $C$DW$293, DW_AT_decl_column(0x12)
    5465              
    5466              $C$DW$294       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    5468                      .dwattr $C$DW$294, DW_AT_name("K2")
    5469                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5470                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5471                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5472                      .dwattr $C$DW$294, DW_AT_decl_line(0x31)
    5473                      .dwattr $C$DW$294, DW_AT_decl_column(0x12)
    5474              
    5475              $C$DW$295       .dwtag  DW_TAG_member
    5476                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    5477                      .dwattr $C$DW$295, DW_AT_name("K3")
    5478                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  112

    5479                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5480                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5481                      .dwattr $C$DW$295, DW_AT_decl_line(0x32)
    5482                      .dwattr $C$DW$295, DW_AT_decl_column(0x12)
    5483              
    5484              $C$DW$296       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$33)
    5486                      .dwattr $C$DW$296, DW_AT_name("SpeedRpm")
    5487                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5488                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5489                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5490                      .dwattr $C$DW$296, DW_AT_decl_line(0x33)
    5491                      .dwattr $C$DW$296, DW_AT_decl_column(0x10)
    5492              
    5493              $C$DW$297       .dwtag  DW_TAG_member
    5494                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    5495                      .dwattr $C$DW$297, DW_AT_name("Tmp")
    5496                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5497                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5498                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5499                      .dwattr $C$DW$297, DW_AT_decl_line(0x34)
    5500                      .dwattr $C$DW$297, DW_AT_decl_column(0x12)
    5501              
    5502                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5503                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a)
    5504                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5505                      .dwendtag $C$DW$T$34
    5506              
    5507                      .dwendtag $C$DW$TU$34
    5508              
    5509              
    5510              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5511                      .dwmtype  $C$DW$T$94
    5512              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5513                      .dwattr $C$DW$T$94, DW_AT_name("SPEED_MEAS_QEP")
    5514                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$34)
    5515                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5516                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x35)
    5517                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0a)
    5518              
    5519                      .dwendtag $C$DW$TU$94
    5520              
    5521              
    5522              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5523                      .dwmtype  $C$DW$T$35
    5524              
    5525              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5526                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    5527              $C$DW$298       .dwtag  DW_TAG_member
    5528                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    5529                      .dwattr $C$DW$298, DW_AT_name("Ref")
    5530                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5531                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5532                      .dwattr $C$DW$298, DW_AT_decl_line(0x2a)
    5533                      .dwattr $C$DW$298, DW_AT_decl_column(0x1e)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  113

    5534              
    5535              $C$DW$299       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    5537                      .dwattr $C$DW$299, DW_AT_name("Fbk")
    5538                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5539                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5540                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5541                      .dwattr $C$DW$299, DW_AT_decl_line(0x2b)
    5542                      .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    5543              
    5544              $C$DW$300       .dwtag  DW_TAG_member
    5545                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    5546                      .dwattr $C$DW$300, DW_AT_name("Out")
    5547                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5548                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5549                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5550                      .dwattr $C$DW$300, DW_AT_decl_line(0x2c)
    5551                      .dwattr $C$DW$300, DW_AT_decl_column(0x12)
    5552              
    5553              $C$DW$301       .dwtag  DW_TAG_member
    5554                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    5555                      .dwattr $C$DW$301, DW_AT_name("c1")
    5556                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5557                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5558                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5559                      .dwattr $C$DW$301, DW_AT_decl_line(0x2d)
    5560                      .dwattr $C$DW$301, DW_AT_decl_column(0x12)
    5561              
    5562              $C$DW$302       .dwtag  DW_TAG_member
    5563                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    5564                      .dwattr $C$DW$302, DW_AT_name("c2")
    5565                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5566                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5567                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5568                      .dwattr $C$DW$302, DW_AT_decl_line(0x2e)
    5569                      .dwattr $C$DW$302, DW_AT_decl_column(0x12)
    5570              
    5571                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5572                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    5573                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5574                      .dwendtag $C$DW$T$35
    5575              
    5576                      .dwendtag $C$DW$TU$35
    5577              
    5578              
    5579              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5580                      .dwmtype  $C$DW$T$38
    5581              $C$DW$T$38      .dwtag  DW_TAG_typedef
    5582                      .dwattr $C$DW$T$38, DW_AT_name("PID_TERMINALS")
    5583                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    5584                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5585                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    5586                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x07)
    5587              
    5588                      .dwendtag $C$DW$TU$38
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  114

    5589              
    5590              
    5591              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    5592                      .dwmtype  $C$DW$T$36
    5593              
    5594              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5595                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    5596              $C$DW$303       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    5598                      .dwattr $C$DW$303, DW_AT_name("Kr")
    5599                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5600                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5601                      .dwattr $C$DW$303, DW_AT_decl_line(0x32)
    5602                      .dwattr $C$DW$303, DW_AT_decl_column(0x1e)
    5603              
    5604              $C$DW$304       .dwtag  DW_TAG_member
    5605                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    5606                      .dwattr $C$DW$304, DW_AT_name("Kp")
    5607                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5608                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5609                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5610                      .dwattr $C$DW$304, DW_AT_decl_line(0x33)
    5611                      .dwattr $C$DW$304, DW_AT_decl_column(0x12)
    5612              
    5613              $C$DW$305       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    5615                      .dwattr $C$DW$305, DW_AT_name("Ki")
    5616                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5617                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5618                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5619                      .dwattr $C$DW$305, DW_AT_decl_line(0x34)
    5620                      .dwattr $C$DW$305, DW_AT_decl_column(0x12)
    5621              
    5622              $C$DW$306       .dwtag  DW_TAG_member
    5623                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    5624                      .dwattr $C$DW$306, DW_AT_name("Kd")
    5625                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5626                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5627                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5628                      .dwattr $C$DW$306, DW_AT_decl_line(0x35)
    5629                      .dwattr $C$DW$306, DW_AT_decl_column(0x12)
    5630              
    5631              $C$DW$307       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    5633                      .dwattr $C$DW$307, DW_AT_name("Km")
    5634                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5635                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5636                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5637                      .dwattr $C$DW$307, DW_AT_decl_line(0x36)
    5638                      .dwattr $C$DW$307, DW_AT_decl_column(0x12)
    5639              
    5640              $C$DW$308       .dwtag  DW_TAG_member
    5641                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    5642                      .dwattr $C$DW$308, DW_AT_name("Umax")
    5643                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  115

    5644                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5645                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5646                      .dwattr $C$DW$308, DW_AT_decl_line(0x37)
    5647                      .dwattr $C$DW$308, DW_AT_decl_column(0x12)
    5648              
    5649              $C$DW$309       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    5651                      .dwattr $C$DW$309, DW_AT_name("Umin")
    5652                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5653                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5654                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5655                      .dwattr $C$DW$309, DW_AT_decl_line(0x38)
    5656                      .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    5657              
    5658                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5659                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x32)
    5660                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5661                      .dwendtag $C$DW$T$36
    5662              
    5663                      .dwendtag $C$DW$TU$36
    5664              
    5665              
    5666              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5667                      .dwmtype  $C$DW$T$39
    5668              $C$DW$T$39      .dwtag  DW_TAG_typedef
    5669                      .dwattr $C$DW$T$39, DW_AT_name("PID_PARAMETERS")
    5670                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    5671                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5672                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x39)
    5673                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x07)
    5674              
    5675                      .dwendtag $C$DW$TU$39
    5676              
    5677              
    5678              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    5679                      .dwmtype  $C$DW$T$37
    5680              
    5681              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5682                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    5683              $C$DW$310       .dwtag  DW_TAG_member
    5684                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    5685                      .dwattr $C$DW$310, DW_AT_name("up")
    5686                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5687                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5688                      .dwattr $C$DW$310, DW_AT_decl_line(0x3b)
    5689                      .dwattr $C$DW$310, DW_AT_decl_column(0x1e)
    5690              
    5691              $C$DW$311       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    5693                      .dwattr $C$DW$311, DW_AT_name("ui")
    5694                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5695                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5696                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5697                      .dwattr $C$DW$311, DW_AT_decl_line(0x3c)
    5698                      .dwattr $C$DW$311, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  116

    5699              
    5700              $C$DW$312       .dwtag  DW_TAG_member
    5701                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    5702                      .dwattr $C$DW$312, DW_AT_name("ud")
    5703                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5704                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5705                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5706                      .dwattr $C$DW$312, DW_AT_decl_line(0x3d)
    5707                      .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    5708              
    5709              $C$DW$313       .dwtag  DW_TAG_member
    5710                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    5711                      .dwattr $C$DW$313, DW_AT_name("v1")
    5712                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5713                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5714                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5715                      .dwattr $C$DW$313, DW_AT_decl_line(0x3e)
    5716                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    5717              
    5718              $C$DW$314       .dwtag  DW_TAG_member
    5719                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    5720                      .dwattr $C$DW$314, DW_AT_name("i1")
    5721                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5722                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5723                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5724                      .dwattr $C$DW$314, DW_AT_decl_line(0x3f)
    5725                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    5726              
    5727              $C$DW$315       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    5729                      .dwattr $C$DW$315, DW_AT_name("d1")
    5730                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5731                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5732                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5733                      .dwattr $C$DW$315, DW_AT_decl_line(0x40)
    5734                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    5735              
    5736              $C$DW$316       .dwtag  DW_TAG_member
    5737                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    5738                      .dwattr $C$DW$316, DW_AT_name("d2")
    5739                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5740                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5741                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5742                      .dwattr $C$DW$316, DW_AT_decl_line(0x41)
    5743                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    5744              
    5745              $C$DW$317       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    5747                      .dwattr $C$DW$317, DW_AT_name("w1")
    5748                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5749                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5750                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5751                      .dwattr $C$DW$317, DW_AT_decl_line(0x42)
    5752                      .dwattr $C$DW$317, DW_AT_decl_column(0x12)
    5753              
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  117

    5754                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5755                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    5756                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5757                      .dwendtag $C$DW$T$37
    5758              
    5759                      .dwendtag $C$DW$TU$37
    5760              
    5761              
    5762              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5763                      .dwmtype  $C$DW$T$40
    5764              $C$DW$T$40      .dwtag  DW_TAG_typedef
    5765                      .dwattr $C$DW$T$40, DW_AT_name("PID_DATA")
    5766                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    5767                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5768                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    5769                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x07)
    5770              
    5771                      .dwendtag $C$DW$TU$40
    5772              
    5773              
    5774              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    5775                      .dwmtype  $C$DW$T$41
    5776              
    5777              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5778                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    5779              $C$DW$318       .dwtag  DW_TAG_member
    5780                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$38)
    5781                      .dwattr $C$DW$318, DW_AT_name("term")
    5782                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5783                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5784                      .dwattr $C$DW$318, DW_AT_decl_line(0x46)
    5785                      .dwattr $C$DW$318, DW_AT_decl_column(0x21)
    5786              
    5787              $C$DW$319       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$39)
    5789                      .dwattr $C$DW$319, DW_AT_name("param")
    5790                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5791                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5792                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5793                      .dwattr $C$DW$319, DW_AT_decl_line(0x47)
    5794                      .dwattr $C$DW$319, DW_AT_decl_column(0x16)
    5795              
    5796              $C$DW$320       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$40)
    5798                      .dwattr $C$DW$320, DW_AT_name("data")
    5799                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5800                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5801                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5802                      .dwattr $C$DW$320, DW_AT_decl_line(0x48)
    5803                      .dwattr $C$DW$320, DW_AT_decl_column(0x11)
    5804              
    5805                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5806                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    5807                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5808                      .dwendtag $C$DW$T$41
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  118

    5809              
    5810                      .dwendtag $C$DW$TU$41
    5811              
    5812              
    5813              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    5814                      .dwmtype  $C$DW$T$96
    5815              $C$DW$T$96      .dwtag  DW_TAG_typedef
    5816                      .dwattr $C$DW$T$96, DW_AT_name("PID_CONTROLLER")
    5817                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$41)
    5818                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5819                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x49)
    5820                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x07)
    5821              
    5822                      .dwendtag $C$DW$TU$96
    5823              
    5824              
    5825              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5826                      .dwmtype  $C$DW$T$42
    5827              
    5828              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5829                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    5830              $C$DW$321       .dwtag  DW_TAG_member
    5831                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    5832                      .dwattr $C$DW$321, DW_AT_name("Ref")
    5833                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5834                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5835                      .dwattr $C$DW$321, DW_AT_decl_line(0x2a)
    5836                      .dwattr $C$DW$321, DW_AT_decl_column(0x1e)
    5837              
    5838              $C$DW$322       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    5840                      .dwattr $C$DW$322, DW_AT_name("Fbk")
    5841                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5842                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5843                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5844                      .dwattr $C$DW$322, DW_AT_decl_line(0x2b)
    5845                      .dwattr $C$DW$322, DW_AT_decl_column(0x12)
    5846              
    5847              $C$DW$323       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    5849                      .dwattr $C$DW$323, DW_AT_name("Out")
    5850                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5851                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5852                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5853                      .dwattr $C$DW$323, DW_AT_decl_line(0x2c)
    5854                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    5855              
    5856              $C$DW$324       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    5858                      .dwattr $C$DW$324, DW_AT_name("Kp")
    5859                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5860                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5861                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5862                      .dwattr $C$DW$324, DW_AT_decl_line(0x2d)
    5863                      .dwattr $C$DW$324, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  119

    5864              
    5865              $C$DW$325       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    5867                      .dwattr $C$DW$325, DW_AT_name("Ki")
    5868                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5869                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5870                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5871                      .dwattr $C$DW$325, DW_AT_decl_line(0x2e)
    5872                      .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    5873              
    5874              $C$DW$326       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    5876                      .dwattr $C$DW$326, DW_AT_name("Umax")
    5877                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5878                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5879                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5880                      .dwattr $C$DW$326, DW_AT_decl_line(0x2f)
    5881                      .dwattr $C$DW$326, DW_AT_decl_column(0x12)
    5882              
    5883              $C$DW$327       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
    5885                      .dwattr $C$DW$327, DW_AT_name("Umin")
    5886                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5887                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5888                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5889                      .dwattr $C$DW$327, DW_AT_decl_line(0x30)
    5890                      .dwattr $C$DW$327, DW_AT_decl_column(0x12)
    5891              
    5892              $C$DW$328       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    5894                      .dwattr $C$DW$328, DW_AT_name("up")
    5895                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5896                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5897                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5898                      .dwattr $C$DW$328, DW_AT_decl_line(0x31)
    5899                      .dwattr $C$DW$328, DW_AT_decl_column(0x12)
    5900              
    5901              $C$DW$329       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    5903                      .dwattr $C$DW$329, DW_AT_name("ui")
    5904                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5905                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5906                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5907                      .dwattr $C$DW$329, DW_AT_decl_line(0x32)
    5908                      .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    5909              
    5910              $C$DW$330       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    5912                      .dwattr $C$DW$330, DW_AT_name("v1")
    5913                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5914                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5915                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5916                      .dwattr $C$DW$330, DW_AT_decl_line(0x33)
    5917                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    5918              
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  120

    5919              $C$DW$331       .dwtag  DW_TAG_member
    5920                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    5921                      .dwattr $C$DW$331, DW_AT_name("i1")
    5922                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5923                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5924                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5925                      .dwattr $C$DW$331, DW_AT_decl_line(0x34)
    5926                      .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    5927              
    5928              $C$DW$332       .dwtag  DW_TAG_member
    5929                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    5930                      .dwattr $C$DW$332, DW_AT_name("w1")
    5931                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5932                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5933                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5934                      .dwattr $C$DW$332, DW_AT_decl_line(0x35)
    5935                      .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    5936              
    5937                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5938                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    5939                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    5940                      .dwendtag $C$DW$T$42
    5941              
    5942                      .dwendtag $C$DW$TU$42
    5943              
    5944              
    5945              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    5946                      .dwmtype  $C$DW$T$97
    5947              $C$DW$T$97      .dwtag  DW_TAG_typedef
    5948                      .dwattr $C$DW$T$97, DW_AT_name("PI_CONTROLLER")
    5949                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$42)
    5950                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5951                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x36)
    5952                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x07)
    5953              
    5954                      .dwendtag $C$DW$TU$97
    5955              
    5956              
    5957              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    5958                      .dwmtype  $C$DW$T$44
    5959              
    5960              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5961                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTFLG_BITS")
    5962                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5963              $C$DW$333       .dwtag  DW_TAG_member
    5964                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$43)
    5965                      .dwattr $C$DW$333, DW_AT_name("ADCINT1")
    5966                      .dwattr $C$DW$333, DW_AT_bit_offset(0x0f)
    5967                      .dwattr $C$DW$333, DW_AT_bit_size(0x01)
    5968                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5969                      .dwattr $C$DW$333, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5970                      .dwattr $C$DW$333, DW_AT_decl_line(0x60)
    5971                      .dwattr $C$DW$333, DW_AT_decl_column(0x0c)
    5972              
    5973              $C$DW$334       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  121

    5974                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    5975                      .dwattr $C$DW$334, DW_AT_name("ADCINT2")
    5976                      .dwattr $C$DW$334, DW_AT_bit_offset(0x0e)
    5977                      .dwattr $C$DW$334, DW_AT_bit_size(0x01)
    5978                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5979                      .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5980                      .dwattr $C$DW$334, DW_AT_decl_line(0x61)
    5981                      .dwattr $C$DW$334, DW_AT_decl_column(0x0c)
    5982              
    5983              $C$DW$335       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$43)
    5985                      .dwattr $C$DW$335, DW_AT_name("ADCINT3")
    5986                      .dwattr $C$DW$335, DW_AT_bit_offset(0x0d)
    5987                      .dwattr $C$DW$335, DW_AT_bit_size(0x01)
    5988                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5989                      .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5990                      .dwattr $C$DW$335, DW_AT_decl_line(0x62)
    5991                      .dwattr $C$DW$335, DW_AT_decl_column(0x0c)
    5992              
    5993              $C$DW$336       .dwtag  DW_TAG_member
    5994                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    5995                      .dwattr $C$DW$336, DW_AT_name("ADCINT4")
    5996                      .dwattr $C$DW$336, DW_AT_bit_offset(0x0c)
    5997                      .dwattr $C$DW$336, DW_AT_bit_size(0x01)
    5998                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5999                      .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6000                      .dwattr $C$DW$336, DW_AT_decl_line(0x63)
    6001                      .dwattr $C$DW$336, DW_AT_decl_column(0x0c)
    6002              
    6003              $C$DW$337       .dwtag  DW_TAG_member
    6004                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$43)
    6005                      .dwattr $C$DW$337, DW_AT_name("rsvd1")
    6006                      .dwattr $C$DW$337, DW_AT_bit_offset(0x00)
    6007                      .dwattr $C$DW$337, DW_AT_bit_size(0x0c)
    6008                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6009                      .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6010                      .dwattr $C$DW$337, DW_AT_decl_line(0x64)
    6011                      .dwattr $C$DW$337, DW_AT_decl_column(0x0c)
    6012              
    6013                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6014                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x5f)
    6015                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    6016                      .dwendtag $C$DW$T$44
    6017              
    6018                      .dwendtag $C$DW$TU$44
    6019              
    6020              
    6021              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    6022                      .dwmtype  $C$DW$T$45
    6023              
    6024              $C$DW$T$45      .dwtag  DW_TAG_union_type
    6025                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTFLG_REG")
    6026                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    6027              $C$DW$338       .dwtag  DW_TAG_member
    6028                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v22.6.2 Tue Dec 23 16:22:00 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  122

    6029                      .dwattr $C$DW$338, DW_AT_name("all")
    6030                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6031                      .dwattr $C$DW$338, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6032                      .dwattr $C$DW$338, DW_AT_decl_line(0x68)
    6033                      .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
    6034              
    6035              $C$DW$339       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$44)
    6037                      .dwattr $C$DW$339, DW_AT_name("bit")
    6038                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6039                      .dwattr $C$DW$339, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6040                      .dwattr $C$DW$339, DW_AT_decl_line(0x69)
    6041                      .dwattr $C$DW$339, DW_AT_decl_column(0x1d)
    6042              
    6043                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6044                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x67)
    6045                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x07)
    6046                      .dwendtag $C$DW$T$45
    6047              
    6048                      .dwendtag $C$DW$TU$45
    6049              
    6050              
    6051              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6052                      .dwmtype  $C$DW$T$102
    6053              $C$DW$340       .dwtag  DW_TAG_TI_far_type
    6054                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$45)
    6055              
    6056              $C$DW$T$102     .dwtag  DW_TAG_volatile_type
    6057                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$340)
    6058              
    6059                      .dwendtag $C$DW$TU$102
    6060              
    6061              
    6062              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    6063                      .dwmtype  $C$DW$T$103
    6064              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    6065                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6066                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    6067              
    6068                      .dwendtag $C$DW$TU$103
    6069              
    6070              
    6071              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    6072                      .dwmtype  $C$DW$T$48
    6073              
    6074              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6075                      .dwattr $C$DW$T$48, DW_AT_name("EQEP_REGS")
