TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:16:25 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_user_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_LAUNCHXL-F280025C\251210_LAUNC
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FCL_initADC_2In")

    5033                      .dwattr $C$DW$236, DW_AT_name("ADC_SOC_NUMBER9")
    5034                      .dwattr $C$DW$236, DW_AT_const_value(0x09)
    5035                      .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5036                      .dwattr $C$DW$236, DW_AT_decl_line(0x111)
    5037                      .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    5038              
    5039              $C$DW$237       .dwtag  DW_TAG_enumerator
    5040                      .dwattr $C$DW$237, DW_AT_name("ADC_SOC_NUMBER10")
    5041                      .dwattr $C$DW$237, DW_AT_const_value(0x0a)
    5042                      .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5043                      .dwattr $C$DW$237, DW_AT_decl_line(0x112)
    5044                      .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    5045              
    5046              $C$DW$238       .dwtag  DW_TAG_enumerator
    5047                      .dwattr $C$DW$238, DW_AT_name("ADC_SOC_NUMBER11")
    5048                      .dwattr $C$DW$238, DW_AT_const_value(0x0b)
    5049                      .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5050                      .dwattr $C$DW$238, DW_AT_decl_line(0x113)
    5051                      .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    5052              
    5053              $C$DW$239       .dwtag  DW_TAG_enumerator
    5054                      .dwattr $C$DW$239, DW_AT_name("ADC_SOC_NUMBER12")
    5055                      .dwattr $C$DW$239, DW_AT_const_value(0x0c)
    5056                      .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5057                      .dwattr $C$DW$239, DW_AT_decl_line(0x114)
    5058                      .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    5059              
    5060              $C$DW$240       .dwtag  DW_TAG_enumerator
    5061                      .dwattr $C$DW$240, DW_AT_name("ADC_SOC_NUMBER13")
    5062                      .dwattr $C$DW$240, DW_AT_const_value(0x0d)
    5063                      .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5064                      .dwattr $C$DW$240, DW_AT_decl_line(0x115)
    5065                      .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    5066              
    5067              $C$DW$241       .dwtag  DW_TAG_enumerator
    5068                      .dwattr $C$DW$241, DW_AT_name("ADC_SOC_NUMBER14")
    5069                      .dwattr $C$DW$241, DW_AT_const_value(0x0e)
    5070                      .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5071                      .dwattr $C$DW$241, DW_AT_decl_line(0x116)
    5072                      .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    5073              
    5074              $C$DW$242       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  107

    5075                      .dwattr $C$DW$242, DW_AT_name("ADC_SOC_NUMBER15")
    5076                      .dwattr $C$DW$242, DW_AT_const_value(0x0f)
    5077                      .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5078                      .dwattr $C$DW$242, DW_AT_decl_line(0x117)
    5079                      .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    5080              
    5081                      .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    5082                      .dwattr $C$DW$T$120, DW_AT_decl_line(0x107)
    5083                      .dwattr $C$DW$T$120, DW_AT_decl_column(0x01)
    5084                      .dwendtag $C$DW$T$120
    5085              
    5086                      .dwendtag $C$DW$TU$120
    5087              
    5088              
    5089              $C$DW$TU$121    .dwtag  DW_TAG_type_unit
    5090                      .dwmtype  $C$DW$T$121
    5091              $C$DW$T$121     .dwtag  DW_TAG_typedef
    5092                      .dwattr $C$DW$T$121, DW_AT_name("ADC_SOCNumber")
    5093                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5094                      .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    5095                      .dwattr $C$DW$T$121, DW_AT_decl_line(0x118)
    5096                      .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    5097              
    5098                      .dwendtag $C$DW$TU$121
    5099              
    5100              
    5101              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    5102                      .dwmtype  $C$DW$T$19
    5103              
    5104              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5105                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    5106              $C$DW$243       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$12)
    5108                      .dwattr $C$DW$243, DW_AT_name("quot")
    5109                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5110                      .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5111                      .dwattr $C$DW$243, DW_AT_decl_line(0x59)
    5112                      .dwattr $C$DW$243, DW_AT_decl_column(0x17)
    5113              
    5114              $C$DW$244       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$12)
    5116                      .dwattr $C$DW$244, DW_AT_name("rem")
    5117                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5118                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5119                      .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5120                      .dwattr $C$DW$244, DW_AT_decl_line(0x59)
    5121                      .dwattr $C$DW$244, DW_AT_decl_column(0x1d)
    5122              
    5123                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5124                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    5125                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    5126                      .dwendtag $C$DW$T$19
    5127              
    5128                      .dwendtag $C$DW$TU$19
    5129              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  108

    5130              
    5131              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    5132                      .dwmtype  $C$DW$T$123
    5133              $C$DW$T$123     .dwtag  DW_TAG_typedef
    5134                      .dwattr $C$DW$T$123, DW_AT_name("ldiv_t")
    5135                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
    5136                      .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5137                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x59)
    5138                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x24)
    5139              
    5140                      .dwendtag $C$DW$TU$123
    5141              
    5142              
    5143              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    5144                      .dwmtype  $C$DW$T$20
    5145              
    5146              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5147                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    5148              $C$DW$245       .dwtag  DW_TAG_member
    5149                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$14)
    5150                      .dwattr $C$DW$245, DW_AT_name("quot")
    5151                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5152                      .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5153                      .dwattr $C$DW$245, DW_AT_decl_line(0x63)
    5154                      .dwattr $C$DW$245, DW_AT_decl_column(0x1c)
    5155              
    5156              $C$DW$246       .dwtag  DW_TAG_member
    5157                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$14)
    5158                      .dwattr $C$DW$246, DW_AT_name("rem")
    5159                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5160                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5161                      .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5162                      .dwattr $C$DW$246, DW_AT_decl_line(0x63)
    5163                      .dwattr $C$DW$246, DW_AT_decl_column(0x22)
    5164              
    5165                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5166                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    5167                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    5168                      .dwendtag $C$DW$T$20
    5169              
    5170                      .dwendtag $C$DW$TU$20
    5171              
    5172              
    5173              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    5174                      .dwmtype  $C$DW$T$126
    5175              $C$DW$T$126     .dwtag  DW_TAG_typedef
    5176                      .dwattr $C$DW$T$126, DW_AT_name("lldiv_t")
    5177                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$20)
    5178                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5179                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x63)
    5180                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x29)
    5181              
    5182                      .dwendtag $C$DW$TU$126
    5183              
    5184              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  109

    5185              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    5186                      .dwmtype  $C$DW$T$22
    5187              
    5188              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5189                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0c)
    5190              $C$DW$247       .dwtag  DW_TAG_member
    5191                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    5192                      .dwattr $C$DW$247, DW_AT_name("Freq")
    5193                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5194                      .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5195                      .dwattr $C$DW$247, DW_AT_decl_line(0x29)
    5196                      .dwattr $C$DW$247, DW_AT_decl_column(0x1d)
    5197              
    5198              $C$DW$248       .dwtag  DW_TAG_member
    5199                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    5200                      .dwattr $C$DW$248, DW_AT_name("StepAngleMax")
    5201                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5202                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5203                      .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5204                      .dwattr $C$DW$248, DW_AT_decl_line(0x2a)
    5205                      .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    5206              
    5207              $C$DW$249       .dwtag  DW_TAG_member
    5208                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$21)
    5209                      .dwattr $C$DW$249, DW_AT_name("Angle")
    5210                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5211                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5212                      .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5213                      .dwattr $C$DW$249, DW_AT_decl_line(0x2b)
    5214                      .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    5215              
    5216              $C$DW$250       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
    5218                      .dwattr $C$DW$250, DW_AT_name("Gain")
    5219                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5220                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5221                      .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5222                      .dwattr $C$DW$250, DW_AT_decl_line(0x2c)
    5223                      .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    5224              
    5225              $C$DW$251       .dwtag  DW_TAG_member
    5226                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    5227                      .dwattr $C$DW$251, DW_AT_name("Out")
    5228                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5229                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5230                      .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5231                      .dwattr $C$DW$251, DW_AT_decl_line(0x2d)
    5232                      .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    5233              
    5234              $C$DW$252       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
    5236                      .dwattr $C$DW$252, DW_AT_name("Offset")
    5237                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5238                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5239                      .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  110

    5240                      .dwattr $C$DW$252, DW_AT_decl_line(0x2e)
    5241                      .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    5242              
    5243                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5244                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x29)
    5245                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5246                      .dwendtag $C$DW$T$22
    5247              
    5248                      .dwendtag $C$DW$TU$22
    5249              
    5250              
    5251              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    5252                      .dwmtype  $C$DW$T$88
    5253              $C$DW$T$88      .dwtag  DW_TAG_typedef
    5254                      .dwattr $C$DW$T$88, DW_AT_name("RAMPGEN")
    5255                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$22)
    5256                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5257                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x2f)
    5258                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x0d)
    5259              
    5260                      .dwendtag $C$DW$TU$88
    5261              
    5262              
    5263              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5264                      .dwmtype  $C$DW$T$25
    5265              
    5266              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5267                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    5268              $C$DW$253       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$21)
    5270                      .dwattr $C$DW$253, DW_AT_name("TargetValue")
    5271                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5272                      .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5273                      .dwattr $C$DW$253, DW_AT_decl_line(0x2b)
    5274                      .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    5275              
    5276              $C$DW$254       .dwtag  DW_TAG_member
    5277                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$24)
    5278                      .dwattr $C$DW$254, DW_AT_name("RampDelayMax")
    5279                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5280                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5281                      .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5282                      .dwattr $C$DW$254, DW_AT_decl_line(0x2c)
    5283                      .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
    5284              
    5285              $C$DW$255       .dwtag  DW_TAG_member
    5286                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
    5287                      .dwattr $C$DW$255, DW_AT_name("RampLowLimit")
    5288                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5289                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5290                      .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5291                      .dwattr $C$DW$255, DW_AT_decl_line(0x2d)
    5292                      .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    5293              
    5294              $C$DW$256       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  111

    5295                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$21)
    5296                      .dwattr $C$DW$256, DW_AT_name("RampHighLimit")
    5297                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5298                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5299                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5300                      .dwattr $C$DW$256, DW_AT_decl_line(0x2e)
    5301                      .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    5302              
    5303              $C$DW$257       .dwtag  DW_TAG_member
    5304                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$24)
    5305                      .dwattr $C$DW$257, DW_AT_name("RampDelayCount")
    5306                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5307                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5308                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5309                      .dwattr $C$DW$257, DW_AT_decl_line(0x2f)
    5310                      .dwattr $C$DW$257, DW_AT_decl_column(0x0c)
    5311              
    5312              $C$DW$258       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$21)
    5314                      .dwattr $C$DW$258, DW_AT_name("SetpointValue")
    5315                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5316                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5317                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5318                      .dwattr $C$DW$258, DW_AT_decl_line(0x30)
    5319                      .dwattr $C$DW$258, DW_AT_decl_column(0x0c)
    5320              
    5321              $C$DW$259       .dwtag  DW_TAG_member
    5322                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$24)
    5323                      .dwattr $C$DW$259, DW_AT_name("EqualFlag")
    5324                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5325                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5326                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5327                      .dwattr $C$DW$259, DW_AT_decl_line(0x31)
    5328                      .dwattr $C$DW$259, DW_AT_decl_column(0x0c)
    5329              
    5330              $C$DW$260       .dwtag  DW_TAG_member
    5331                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    5332                      .dwattr $C$DW$260, DW_AT_name("Tmp")
    5333                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5334                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5335                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5336                      .dwattr $C$DW$260, DW_AT_decl_line(0x32)
    5337                      .dwattr $C$DW$260, DW_AT_decl_column(0x0c)
    5338              
    5339                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5340                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x2a)
    5341                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5342                      .dwendtag $C$DW$T$25
    5343              
    5344                      .dwendtag $C$DW$TU$25
    5345              
    5346              
    5347              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    5348                      .dwmtype  $C$DW$T$89
    5349              $C$DW$T$89      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  112

    5350                      .dwattr $C$DW$T$89, DW_AT_name("RMPCNTL")
    5351                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$25)
    5352                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5353                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x33)
    5354                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    5355              
    5356                      .dwendtag $C$DW$TU$89
    5357              
    5358              
    5359              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5360                      .dwmtype  $C$DW$T$26
    5361              
    5362              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5363                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    5364              $C$DW$261       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    5366                      .dwattr $C$DW$261, DW_AT_name("As")
    5367                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5368                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5369                      .dwattr $C$DW$261, DW_AT_decl_line(0x2a)
    5370                      .dwattr $C$DW$261, DW_AT_decl_column(0x1e)
    5371              
    5372              $C$DW$262       .dwtag  DW_TAG_member
    5373                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    5374                      .dwattr $C$DW$262, DW_AT_name("Bs")
    5375                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5376                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5377                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5378                      .dwattr $C$DW$262, DW_AT_decl_line(0x2b)
    5379                      .dwattr $C$DW$262, DW_AT_decl_column(0x12)
    5380              
    5381              $C$DW$263       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    5383                      .dwattr $C$DW$263, DW_AT_name("Cs")
    5384                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5385                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5386                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5387                      .dwattr $C$DW$263, DW_AT_decl_line(0x2c)
    5388                      .dwattr $C$DW$263, DW_AT_decl_column(0x12)
    5389              
    5390              $C$DW$264       .dwtag  DW_TAG_member
    5391                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    5392                      .dwattr $C$DW$264, DW_AT_name("Alpha")
    5393                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5394                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5395                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5396                      .dwattr $C$DW$264, DW_AT_decl_line(0x2d)
    5397                      .dwattr $C$DW$264, DW_AT_decl_column(0x12)
    5398              
    5399              $C$DW$265       .dwtag  DW_TAG_member
    5400                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    5401                      .dwattr $C$DW$265, DW_AT_name("Beta")
    5402                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5403                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5404                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  113

    5405                      .dwattr $C$DW$265, DW_AT_decl_line(0x2e)
    5406                      .dwattr $C$DW$265, DW_AT_decl_column(0x12)
    5407              
    5408                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5409                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    5410                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5411                      .dwendtag $C$DW$T$26
    5412              
    5413                      .dwendtag $C$DW$TU$26
    5414              
    5415              
    5416              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    5417                      .dwmtype  $C$DW$T$90
    5418              $C$DW$T$90      .dwtag  DW_TAG_typedef
    5419                      .dwattr $C$DW$T$90, DW_AT_name("CLARKE")
    5420                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    5421                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5422                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x2f)
    5423                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x09)
    5424              
    5425                      .dwendtag $C$DW$TU$90
    5426              
    5427              
    5428              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5429                      .dwmtype  $C$DW$T$27
    5430              
    5431              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5432                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    5433              $C$DW$266       .dwtag  DW_TAG_member
    5434                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$21)
    5435                      .dwattr $C$DW$266, DW_AT_name("Alpha")
    5436                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5437                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5438                      .dwattr $C$DW$266, DW_AT_decl_line(0x29)
    5439                      .dwattr $C$DW$266, DW_AT_decl_column(0x1e)
    5440              
    5441              $C$DW$267       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    5443                      .dwattr $C$DW$267, DW_AT_name("Beta")
    5444                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5445                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5446                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5447                      .dwattr $C$DW$267, DW_AT_decl_line(0x2a)
    5448                      .dwattr $C$DW$267, DW_AT_decl_column(0x12)
    5449              
    5450              $C$DW$268       .dwtag  DW_TAG_member
    5451                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    5452                      .dwattr $C$DW$268, DW_AT_name("Angle")
    5453                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5454                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5455                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5456                      .dwattr $C$DW$268, DW_AT_decl_line(0x2b)
    5457                      .dwattr $C$DW$268, DW_AT_decl_column(0x12)
    5458              
    5459              $C$DW$269       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  114

    5460                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    5461                      .dwattr $C$DW$269, DW_AT_name("Ds")
    5462                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5463                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5464                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5465                      .dwattr $C$DW$269, DW_AT_decl_line(0x2c)
    5466                      .dwattr $C$DW$269, DW_AT_decl_column(0x12)
    5467              
    5468              $C$DW$270       .dwtag  DW_TAG_member
    5469                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    5470                      .dwattr $C$DW$270, DW_AT_name("Qs")
    5471                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5472                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5473                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5474                      .dwattr $C$DW$270, DW_AT_decl_line(0x2d)
    5475                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    5476              
    5477              $C$DW$271       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    5479                      .dwattr $C$DW$271, DW_AT_name("Sine")
    5480                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5481                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5482                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5483                      .dwattr $C$DW$271, DW_AT_decl_line(0x2e)
    5484                      .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    5485              
    5486              $C$DW$272       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    5488                      .dwattr $C$DW$272, DW_AT_name("Cosine")
    5489                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5490                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5491                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5492                      .dwattr $C$DW$272, DW_AT_decl_line(0x2f)
    5493                      .dwattr $C$DW$272, DW_AT_decl_column(0x12)
    5494              
    5495                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5496                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    5497                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    5498                      .dwendtag $C$DW$T$27
    5499              
    5500                      .dwendtag $C$DW$TU$27
    5501              
    5502              
    5503              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    5504                      .dwmtype  $C$DW$T$91
    5505              $C$DW$T$91      .dwtag  DW_TAG_typedef
    5506                      .dwattr $C$DW$T$91, DW_AT_name("PARK")
    5507                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$27)
    5508                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5509                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x30)
    5510                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x09)
    5511              
    5512                      .dwendtag $C$DW$TU$91
    5513              
    5514              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  115

    5515              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5516                      .dwmtype  $C$DW$T$28
    5517              
    5518              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5519                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    5520              $C$DW$273       .dwtag  DW_TAG_member
    5521                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    5522                      .dwattr $C$DW$273, DW_AT_name("Alpha")
    5523                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5524                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5525                      .dwattr $C$DW$273, DW_AT_decl_line(0x29)
    5526                      .dwattr $C$DW$273, DW_AT_decl_column(0x1e)
    5527              
    5528              $C$DW$274       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    5530                      .dwattr $C$DW$274, DW_AT_name("Beta")
    5531                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5532                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5533                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5534                      .dwattr $C$DW$274, DW_AT_decl_line(0x2a)
    5535                      .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    5536              
    5537              $C$DW$275       .dwtag  DW_TAG_member
    5538                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    5539                      .dwattr $C$DW$275, DW_AT_name("Angle")
    5540                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5541                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5542                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5543                      .dwattr $C$DW$275, DW_AT_decl_line(0x2b)
    5544                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    5545              
    5546              $C$DW$276       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    5548                      .dwattr $C$DW$276, DW_AT_name("Ds")
    5549                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5550                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5551                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5552                      .dwattr $C$DW$276, DW_AT_decl_line(0x2c)
    5553                      .dwattr $C$DW$276, DW_AT_decl_column(0x12)
    5554              
    5555              $C$DW$277       .dwtag  DW_TAG_member
    5556                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    5557                      .dwattr $C$DW$277, DW_AT_name("Qs")
    5558                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5559                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5560                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5561                      .dwattr $C$DW$277, DW_AT_decl_line(0x2d)
    5562                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    5563              
    5564              $C$DW$278       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    5566                      .dwattr $C$DW$278, DW_AT_name("Sine")
    5567                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5568                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5569                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  116

    5570                      .dwattr $C$DW$278, DW_AT_decl_line(0x2e)
    5571                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    5572              
    5573              $C$DW$279       .dwtag  DW_TAG_member
    5574                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    5575                      .dwattr $C$DW$279, DW_AT_name("Cosine")
    5576                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5577                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5578                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5579                      .dwattr $C$DW$279, DW_AT_decl_line(0x2f)
    5580                      .dwattr $C$DW$279, DW_AT_decl_column(0x12)
    5581              
    5582                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5583                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x29)
    5584                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    5585                      .dwendtag $C$DW$T$28
    5586              
    5587                      .dwendtag $C$DW$TU$28
    5588              
    5589              
    5590              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    5591                      .dwmtype  $C$DW$T$92
    5592              $C$DW$T$92      .dwtag  DW_TAG_typedef
    5593                      .dwattr $C$DW$T$92, DW_AT_name("IPARK")
    5594                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$28)
    5595                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5596                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x30)
    5597                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x0b)
    5598              
    5599                      .dwendtag $C$DW$TU$92
    5600              
    5601              
    5602              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5603                      .dwmtype  $C$DW$T$31
    5604              
    5605              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5606                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x12)
    5607              $C$DW$280       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    5609                      .dwattr $C$DW$280, DW_AT_name("Ualpha")
    5610                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5611                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5612                      .dwattr $C$DW$280, DW_AT_decl_line(0x2b)
    5613                      .dwattr $C$DW$280, DW_AT_decl_column(0x10)
    5614              
    5615              $C$DW$281       .dwtag  DW_TAG_member
    5616                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    5617                      .dwattr $C$DW$281, DW_AT_name("Ubeta")
    5618                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5619                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5620                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5621                      .dwattr $C$DW$281, DW_AT_decl_line(0x2c)
    5622                      .dwattr $C$DW$281, DW_AT_decl_column(0x10)
    5623              
    5624              $C$DW$282       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  117

    5625                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    5626                      .dwattr $C$DW$282, DW_AT_name("Ta")
    5627                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5628                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5629                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5630                      .dwattr $C$DW$282, DW_AT_decl_line(0x2d)
    5631                      .dwattr $C$DW$282, DW_AT_decl_column(0x10)
    5632              
    5633              $C$DW$283       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    5635                      .dwattr $C$DW$283, DW_AT_name("Tb")
    5636                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5637                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5638                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5639                      .dwattr $C$DW$283, DW_AT_decl_line(0x2e)
    5640                      .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    5641              
    5642              $C$DW$284       .dwtag  DW_TAG_member
    5643                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    5644                      .dwattr $C$DW$284, DW_AT_name("Tc")
    5645                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5646                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5647                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5648                      .dwattr $C$DW$284, DW_AT_decl_line(0x2f)
    5649                      .dwattr $C$DW$284, DW_AT_decl_column(0x10)
    5650              
    5651              $C$DW$285       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    5653                      .dwattr $C$DW$285, DW_AT_name("tmp1")
    5654                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5655                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5656                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5657                      .dwattr $C$DW$285, DW_AT_decl_line(0x30)
    5658                      .dwattr $C$DW$285, DW_AT_decl_column(0x10)
    5659              
    5660              $C$DW$286       .dwtag  DW_TAG_member
    5661                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    5662                      .dwattr $C$DW$286, DW_AT_name("tmp2")
    5663                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5664                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5665                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5666                      .dwattr $C$DW$286, DW_AT_decl_line(0x31)
    5667                      .dwattr $C$DW$286, DW_AT_decl_column(0x10)
    5668              
    5669              $C$DW$287       .dwtag  DW_TAG_member
    5670                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
    5671                      .dwattr $C$DW$287, DW_AT_name("tmp3")
    5672                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5673                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5674                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5675                      .dwattr $C$DW$287, DW_AT_decl_line(0x32)
    5676                      .dwattr $C$DW$287, DW_AT_decl_column(0x10)
    5677              
    5678              $C$DW$288       .dwtag  DW_TAG_member
    5679                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  118

    5680                      .dwattr $C$DW$288, DW_AT_name("VecSector")
    5681                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5682                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5683                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5684                      .dwattr $C$DW$288, DW_AT_decl_line(0x33)
    5685                      .dwattr $C$DW$288, DW_AT_decl_column(0x0b)
    5686              
    5687                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5688                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    5689                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
    5690                      .dwendtag $C$DW$T$31
    5691              
    5692                      .dwendtag $C$DW$TU$31
    5693              
    5694              
    5695              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    5696                      .dwmtype  $C$DW$T$93
    5697              $C$DW$T$93      .dwtag  DW_TAG_typedef
    5698                      .dwattr $C$DW$T$93, DW_AT_name("SVGEN")
    5699                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$31)
    5700                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5701                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x34)
    5702                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x04)
    5703              
    5704                      .dwendtag $C$DW$TU$93
    5705              
    5706              
    5707              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    5708                      .dwmtype  $C$DW$T$34
    5709              
    5710              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5711                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    5712              $C$DW$289       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$21)
    5714                      .dwattr $C$DW$289, DW_AT_name("ElecTheta")
    5715                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5716                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5717                      .dwattr $C$DW$289, DW_AT_decl_line(0x2b)
    5718                      .dwattr $C$DW$289, DW_AT_decl_column(0x12)
    5719              
    5720              $C$DW$290       .dwtag  DW_TAG_member
    5721                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$24)
    5722                      .dwattr $C$DW$290, DW_AT_name("DirectionQep")
    5723                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5724                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5725                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5726                      .dwattr $C$DW$290, DW_AT_decl_line(0x2c)
    5727                      .dwattr $C$DW$290, DW_AT_decl_column(0x11)
    5728              
    5729              $C$DW$291       .dwtag  DW_TAG_member
    5730                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    5731                      .dwattr $C$DW$291, DW_AT_name("OldElecTheta")
    5732                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5733                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5734                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  119

    5735                      .dwattr $C$DW$291, DW_AT_decl_line(0x2d)
    5736                      .dwattr $C$DW$291, DW_AT_decl_column(0x12)
    5737              
    5738              $C$DW$292       .dwtag  DW_TAG_member
    5739                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    5740                      .dwattr $C$DW$292, DW_AT_name("Speed")
    5741                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5742                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5743                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5744                      .dwattr $C$DW$292, DW_AT_decl_line(0x2e)
    5745                      .dwattr $C$DW$292, DW_AT_decl_column(0x12)
    5746              
    5747              $C$DW$293       .dwtag  DW_TAG_member
    5748                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$24)
    5749                      .dwattr $C$DW$293, DW_AT_name("BaseRpm")
    5750                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5751                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5752                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5753                      .dwattr $C$DW$293, DW_AT_decl_line(0x2f)
    5754                      .dwattr $C$DW$293, DW_AT_decl_column(0x11)
    5755              
    5756              $C$DW$294       .dwtag  DW_TAG_member
    5757                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    5758                      .dwattr $C$DW$294, DW_AT_name("K1")
    5759                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5760                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5761                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5762                      .dwattr $C$DW$294, DW_AT_decl_line(0x30)
    5763                      .dwattr $C$DW$294, DW_AT_decl_column(0x12)
    5764              
    5765              $C$DW$295       .dwtag  DW_TAG_member
    5766                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    5767                      .dwattr $C$DW$295, DW_AT_name("K2")
    5768                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5769                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5770                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5771                      .dwattr $C$DW$295, DW_AT_decl_line(0x31)
    5772                      .dwattr $C$DW$295, DW_AT_decl_column(0x12)
    5773              
    5774              $C$DW$296       .dwtag  DW_TAG_member
    5775                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
    5776                      .dwattr $C$DW$296, DW_AT_name("K3")
    5777                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5778                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5779                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5780                      .dwattr $C$DW$296, DW_AT_decl_line(0x32)
    5781                      .dwattr $C$DW$296, DW_AT_decl_column(0x12)
    5782              
    5783              $C$DW$297       .dwtag  DW_TAG_member
    5784                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$33)
    5785                      .dwattr $C$DW$297, DW_AT_name("SpeedRpm")
    5786                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5787                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5788                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5789                      .dwattr $C$DW$297, DW_AT_decl_line(0x33)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  120

    5790                      .dwattr $C$DW$297, DW_AT_decl_column(0x10)
    5791              
    5792              $C$DW$298       .dwtag  DW_TAG_member
    5793                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    5794                      .dwattr $C$DW$298, DW_AT_name("Tmp")
    5795                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5796                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5797                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5798                      .dwattr $C$DW$298, DW_AT_decl_line(0x34)
    5799                      .dwattr $C$DW$298, DW_AT_decl_column(0x12)
    5800              
    5801                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5802                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a)
    5803                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    5804                      .dwendtag $C$DW$T$34
    5805              
    5806                      .dwendtag $C$DW$TU$34
    5807              
    5808              
    5809              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5810                      .dwmtype  $C$DW$T$94
    5811              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5812                      .dwattr $C$DW$T$94, DW_AT_name("SPEED_MEAS_QEP")
    5813                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$34)
    5814                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5815                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x35)
    5816                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0a)
    5817              
    5818                      .dwendtag $C$DW$TU$94
    5819              
    5820              
    5821              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5822                      .dwmtype  $C$DW$T$35
    5823              
    5824              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5825                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    5826              $C$DW$299       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    5828                      .dwattr $C$DW$299, DW_AT_name("Ref")
    5829                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5830                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5831                      .dwattr $C$DW$299, DW_AT_decl_line(0x2a)
    5832                      .dwattr $C$DW$299, DW_AT_decl_column(0x1e)
    5833              
    5834              $C$DW$300       .dwtag  DW_TAG_member
    5835                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    5836                      .dwattr $C$DW$300, DW_AT_name("Fbk")
    5837                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5838                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5839                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5840                      .dwattr $C$DW$300, DW_AT_decl_line(0x2b)
    5841                      .dwattr $C$DW$300, DW_AT_decl_column(0x12)
    5842              
    5843              $C$DW$301       .dwtag  DW_TAG_member
    5844                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  121

    5845                      .dwattr $C$DW$301, DW_AT_name("Out")
    5846                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5847                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5848                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5849                      .dwattr $C$DW$301, DW_AT_decl_line(0x2c)
    5850                      .dwattr $C$DW$301, DW_AT_decl_column(0x12)
    5851              
    5852              $C$DW$302       .dwtag  DW_TAG_member
    5853                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    5854                      .dwattr $C$DW$302, DW_AT_name("c1")
    5855                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5856                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5857                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5858                      .dwattr $C$DW$302, DW_AT_decl_line(0x2d)
    5859                      .dwattr $C$DW$302, DW_AT_decl_column(0x12)
    5860              
    5861              $C$DW$303       .dwtag  DW_TAG_member
    5862                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    5863                      .dwattr $C$DW$303, DW_AT_name("c2")
    5864                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5865                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5866                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5867                      .dwattr $C$DW$303, DW_AT_decl_line(0x2e)
    5868                      .dwattr $C$DW$303, DW_AT_decl_column(0x12)
    5869              
    5870                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5871                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    5872                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    5873                      .dwendtag $C$DW$T$35
    5874              
    5875                      .dwendtag $C$DW$TU$35
    5876              
    5877              
    5878              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5879                      .dwmtype  $C$DW$T$38
    5880              $C$DW$T$38      .dwtag  DW_TAG_typedef
    5881                      .dwattr $C$DW$T$38, DW_AT_name("PID_TERMINALS")
    5882                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    5883                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5884                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    5885                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x07)
    5886              
    5887                      .dwendtag $C$DW$TU$38
    5888              
    5889              
    5890              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    5891                      .dwmtype  $C$DW$T$36
    5892              
    5893              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5894                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    5895              $C$DW$304       .dwtag  DW_TAG_member
    5896                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    5897                      .dwattr $C$DW$304, DW_AT_name("Kr")
    5898                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5899                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  122

    5900                      .dwattr $C$DW$304, DW_AT_decl_line(0x32)
    5901                      .dwattr $C$DW$304, DW_AT_decl_column(0x1e)
    5902              
    5903              $C$DW$305       .dwtag  DW_TAG_member
    5904                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    5905                      .dwattr $C$DW$305, DW_AT_name("Kp")
    5906                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5907                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5908                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5909                      .dwattr $C$DW$305, DW_AT_decl_line(0x33)
    5910                      .dwattr $C$DW$305, DW_AT_decl_column(0x12)
    5911              
    5912              $C$DW$306       .dwtag  DW_TAG_member
    5913                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    5914                      .dwattr $C$DW$306, DW_AT_name("Ki")
    5915                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5916                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5917                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5918                      .dwattr $C$DW$306, DW_AT_decl_line(0x34)
    5919                      .dwattr $C$DW$306, DW_AT_decl_column(0x12)
    5920              
    5921              $C$DW$307       .dwtag  DW_TAG_member
    5922                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    5923                      .dwattr $C$DW$307, DW_AT_name("Kd")
    5924                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5925                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5926                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5927                      .dwattr $C$DW$307, DW_AT_decl_line(0x35)
    5928                      .dwattr $C$DW$307, DW_AT_decl_column(0x12)
    5929              
    5930              $C$DW$308       .dwtag  DW_TAG_member
    5931                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    5932                      .dwattr $C$DW$308, DW_AT_name("Km")
    5933                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5934                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5935                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5936                      .dwattr $C$DW$308, DW_AT_decl_line(0x36)
    5937                      .dwattr $C$DW$308, DW_AT_decl_column(0x12)
    5938              
    5939              $C$DW$309       .dwtag  DW_TAG_member
    5940                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    5941                      .dwattr $C$DW$309, DW_AT_name("Umax")
    5942                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5943                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5944                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5945                      .dwattr $C$DW$309, DW_AT_decl_line(0x37)
    5946                      .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    5947              
    5948              $C$DW$310       .dwtag  DW_TAG_member
    5949                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    5950                      .dwattr $C$DW$310, DW_AT_name("Umin")
    5951                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5952                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5953                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5954                      .dwattr $C$DW$310, DW_AT_decl_line(0x38)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  123

    5955                      .dwattr $C$DW$310, DW_AT_decl_column(0x12)
    5956              
    5957                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5958                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x32)
    5959                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    5960                      .dwendtag $C$DW$T$36
    5961              
    5962                      .dwendtag $C$DW$TU$36
    5963              
    5964              
    5965              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5966                      .dwmtype  $C$DW$T$39
    5967              $C$DW$T$39      .dwtag  DW_TAG_typedef
    5968                      .dwattr $C$DW$T$39, DW_AT_name("PID_PARAMETERS")
    5969                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    5970                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5971                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x39)
    5972                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x07)
    5973              
    5974                      .dwendtag $C$DW$TU$39
    5975              
    5976              
    5977              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    5978                      .dwmtype  $C$DW$T$37
    5979              
    5980              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5981                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    5982              $C$DW$311       .dwtag  DW_TAG_member
    5983                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    5984                      .dwattr $C$DW$311, DW_AT_name("up")
    5985                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5986                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5987                      .dwattr $C$DW$311, DW_AT_decl_line(0x3b)
    5988                      .dwattr $C$DW$311, DW_AT_decl_column(0x1e)
    5989              
    5990              $C$DW$312       .dwtag  DW_TAG_member
    5991                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    5992                      .dwattr $C$DW$312, DW_AT_name("ui")
    5993                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5994                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5995                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5996                      .dwattr $C$DW$312, DW_AT_decl_line(0x3c)
    5997                      .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    5998              
    5999              $C$DW$313       .dwtag  DW_TAG_member
    6000                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    6001                      .dwattr $C$DW$313, DW_AT_name("ud")
    6002                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6003                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6004                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6005                      .dwattr $C$DW$313, DW_AT_decl_line(0x3d)
    6006                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    6007              
    6008              $C$DW$314       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  124

    6010                      .dwattr $C$DW$314, DW_AT_name("v1")
    6011                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6012                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6013                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6014                      .dwattr $C$DW$314, DW_AT_decl_line(0x3e)
    6015                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    6016              
    6017              $C$DW$315       .dwtag  DW_TAG_member
    6018                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    6019                      .dwattr $C$DW$315, DW_AT_name("i1")
    6020                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6021                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6022                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6023                      .dwattr $C$DW$315, DW_AT_decl_line(0x3f)
    6024                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    6025              
    6026              $C$DW$316       .dwtag  DW_TAG_member
    6027                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    6028                      .dwattr $C$DW$316, DW_AT_name("d1")
    6029                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6030                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6031                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6032                      .dwattr $C$DW$316, DW_AT_decl_line(0x40)
    6033                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    6034              
    6035              $C$DW$317       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    6037                      .dwattr $C$DW$317, DW_AT_name("d2")
    6038                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6039                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6040                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6041                      .dwattr $C$DW$317, DW_AT_decl_line(0x41)
    6042                      .dwattr $C$DW$317, DW_AT_decl_column(0x12)
    6043              
    6044              $C$DW$318       .dwtag  DW_TAG_member
    6045                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    6046                      .dwattr $C$DW$318, DW_AT_name("w1")
    6047                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6048                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6049                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6050                      .dwattr $C$DW$318, DW_AT_decl_line(0x42)
    6051                      .dwattr $C$DW$318, DW_AT_decl_column(0x12)
    6052              
    6053                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6054                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    6055                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    6056                      .dwendtag $C$DW$T$37
    6057              
    6058                      .dwendtag $C$DW$TU$37
    6059              
    6060              
    6061              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    6062                      .dwmtype  $C$DW$T$40
    6063              $C$DW$T$40      .dwtag  DW_TAG_typedef
    6064                      .dwattr $C$DW$T$40, DW_AT_name("PID_DATA")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  125

    6065                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    6066                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6067                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    6068                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x07)
    6069              
    6070                      .dwendtag $C$DW$TU$40
    6071              
    6072              
    6073              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6074                      .dwmtype  $C$DW$T$41
    6075              
    6076              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6077                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    6078              $C$DW$319       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$38)
    6080                      .dwattr $C$DW$319, DW_AT_name("term")
    6081                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6082                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6083                      .dwattr $C$DW$319, DW_AT_decl_line(0x46)
    6084                      .dwattr $C$DW$319, DW_AT_decl_column(0x21)
    6085              
    6086              $C$DW$320       .dwtag  DW_TAG_member
    6087                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$39)
    6088                      .dwattr $C$DW$320, DW_AT_name("param")
    6089                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6090                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6091                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6092                      .dwattr $C$DW$320, DW_AT_decl_line(0x47)
    6093                      .dwattr $C$DW$320, DW_AT_decl_column(0x16)
    6094              
    6095              $C$DW$321       .dwtag  DW_TAG_member
    6096                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$40)
    6097                      .dwattr $C$DW$321, DW_AT_name("data")
    6098                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6099                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6100                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6101                      .dwattr $C$DW$321, DW_AT_decl_line(0x48)
    6102                      .dwattr $C$DW$321, DW_AT_decl_column(0x11)
    6103              
    6104                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6105                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    6106                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6107                      .dwendtag $C$DW$T$41
    6108              
    6109                      .dwendtag $C$DW$TU$41
    6110              
    6111              
    6112              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    6113                      .dwmtype  $C$DW$T$96
    6114              $C$DW$T$96      .dwtag  DW_TAG_typedef
    6115                      .dwattr $C$DW$T$96, DW_AT_name("PID_CONTROLLER")
    6116                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$41)
    6117                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6118                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x49)
    6119                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x07)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  126

    6120              
    6121                      .dwendtag $C$DW$TU$96
    6122              
    6123              
    6124              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    6125                      .dwmtype  $C$DW$T$42
    6126              
    6127              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6128                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    6129              $C$DW$322       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    6131                      .dwattr $C$DW$322, DW_AT_name("Ref")
    6132                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6133                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6134                      .dwattr $C$DW$322, DW_AT_decl_line(0x2a)
    6135                      .dwattr $C$DW$322, DW_AT_decl_column(0x1e)
    6136              
    6137              $C$DW$323       .dwtag  DW_TAG_member
    6138                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    6139                      .dwattr $C$DW$323, DW_AT_name("Fbk")
    6140                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6141                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6142                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6143                      .dwattr $C$DW$323, DW_AT_decl_line(0x2b)
    6144                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    6145              
    6146              $C$DW$324       .dwtag  DW_TAG_member
    6147                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    6148                      .dwattr $C$DW$324, DW_AT_name("Out")
    6149                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6150                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6151                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6152                      .dwattr $C$DW$324, DW_AT_decl_line(0x2c)
    6153                      .dwattr $C$DW$324, DW_AT_decl_column(0x12)
    6154              
    6155              $C$DW$325       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    6157                      .dwattr $C$DW$325, DW_AT_name("Kp")
    6158                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6159                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6160                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6161                      .dwattr $C$DW$325, DW_AT_decl_line(0x2d)
    6162                      .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    6163              
    6164              $C$DW$326       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    6166                      .dwattr $C$DW$326, DW_AT_name("Ki")
    6167                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6168                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6169                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6170                      .dwattr $C$DW$326, DW_AT_decl_line(0x2e)
    6171                      .dwattr $C$DW$326, DW_AT_decl_column(0x12)
    6172              
    6173              $C$DW$327       .dwtag  DW_TAG_member
    6174                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  127

    6175                      .dwattr $C$DW$327, DW_AT_name("Umax")
    6176                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6177                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6178                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6179                      .dwattr $C$DW$327, DW_AT_decl_line(0x2f)
    6180                      .dwattr $C$DW$327, DW_AT_decl_column(0x12)
    6181              
    6182              $C$DW$328       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    6184                      .dwattr $C$DW$328, DW_AT_name("Umin")
    6185                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6186                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6187                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6188                      .dwattr $C$DW$328, DW_AT_decl_line(0x30)
    6189                      .dwattr $C$DW$328, DW_AT_decl_column(0x12)
    6190              
    6191              $C$DW$329       .dwtag  DW_TAG_member
    6192                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    6193                      .dwattr $C$DW$329, DW_AT_name("up")
    6194                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6195                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6196                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6197                      .dwattr $C$DW$329, DW_AT_decl_line(0x31)
    6198                      .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    6199              
    6200              $C$DW$330       .dwtag  DW_TAG_member
    6201                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    6202                      .dwattr $C$DW$330, DW_AT_name("ui")
    6203                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6204                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6205                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6206                      .dwattr $C$DW$330, DW_AT_decl_line(0x32)
    6207                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    6208              
    6209              $C$DW$331       .dwtag  DW_TAG_member
    6210                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    6211                      .dwattr $C$DW$331, DW_AT_name("v1")
    6212                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6213                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6214                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6215                      .dwattr $C$DW$331, DW_AT_decl_line(0x33)
    6216                      .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    6217              
    6218              $C$DW$332       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    6220                      .dwattr $C$DW$332, DW_AT_name("i1")
    6221                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6222                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6223                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6224                      .dwattr $C$DW$332, DW_AT_decl_line(0x34)
    6225                      .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    6226              
    6227              $C$DW$333       .dwtag  DW_TAG_member
    6228                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    6229                      .dwattr $C$DW$333, DW_AT_name("w1")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  128

    6230                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6231                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6232                      .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6233                      .dwattr $C$DW$333, DW_AT_decl_line(0x35)
    6234                      .dwattr $C$DW$333, DW_AT_decl_column(0x12)
    6235              
    6236                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6237                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    6238                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    6239                      .dwendtag $C$DW$T$42
    6240              
    6241                      .dwendtag $C$DW$TU$42
    6242              
    6243              
    6244              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    6245                      .dwmtype  $C$DW$T$97
    6246              $C$DW$T$97      .dwtag  DW_TAG_typedef
    6247                      .dwattr $C$DW$T$97, DW_AT_name("PI_CONTROLLER")
    6248                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$42)
    6249                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6250                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x36)
    6251                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x07)
    6252              
    6253                      .dwendtag $C$DW$TU$97
    6254              
    6255              
    6256              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    6257                      .dwmtype  $C$DW$T$44
    6258              
    6259              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6260                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTFLG_BITS")
    6261                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    6262              $C$DW$334       .dwtag  DW_TAG_member
    6263                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$43)
    6264                      .dwattr $C$DW$334, DW_AT_name("ADCINT1")
    6265                      .dwattr $C$DW$334, DW_AT_bit_offset(0x0f)
    6266                      .dwattr $C$DW$334, DW_AT_bit_size(0x01)
    6267                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6268                      .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6269                      .dwattr $C$DW$334, DW_AT_decl_line(0x60)
    6270                      .dwattr $C$DW$334, DW_AT_decl_column(0x0c)
    6271              
    6272              $C$DW$335       .dwtag  DW_TAG_member
    6273                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$43)
    6274                      .dwattr $C$DW$335, DW_AT_name("ADCINT2")
    6275                      .dwattr $C$DW$335, DW_AT_bit_offset(0x0e)
    6276                      .dwattr $C$DW$335, DW_AT_bit_size(0x01)
    6277                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6278                      .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6279                      .dwattr $C$DW$335, DW_AT_decl_line(0x61)
    6280                      .dwattr $C$DW$335, DW_AT_decl_column(0x0c)
    6281              
    6282              $C$DW$336       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$43)
    6284                      .dwattr $C$DW$336, DW_AT_name("ADCINT3")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  129

    6285                      .dwattr $C$DW$336, DW_AT_bit_offset(0x0d)
    6286                      .dwattr $C$DW$336, DW_AT_bit_size(0x01)
    6287                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6288                      .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6289                      .dwattr $C$DW$336, DW_AT_decl_line(0x62)
    6290                      .dwattr $C$DW$336, DW_AT_decl_column(0x0c)
    6291              
    6292              $C$DW$337       .dwtag  DW_TAG_member
    6293                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$43)
    6294                      .dwattr $C$DW$337, DW_AT_name("ADCINT4")
    6295                      .dwattr $C$DW$337, DW_AT_bit_offset(0x0c)
    6296                      .dwattr $C$DW$337, DW_AT_bit_size(0x01)
    6297                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6298                      .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6299                      .dwattr $C$DW$337, DW_AT_decl_line(0x63)
    6300                      .dwattr $C$DW$337, DW_AT_decl_column(0x0c)
    6301              
    6302              $C$DW$338       .dwtag  DW_TAG_member
    6303                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$43)
    6304                      .dwattr $C$DW$338, DW_AT_name("rsvd1")
    6305                      .dwattr $C$DW$338, DW_AT_bit_offset(0x00)
    6306                      .dwattr $C$DW$338, DW_AT_bit_size(0x0c)
    6307                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6308                      .dwattr $C$DW$338, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6309                      .dwattr $C$DW$338, DW_AT_decl_line(0x64)
    6310                      .dwattr $C$DW$338, DW_AT_decl_column(0x0c)
    6311              
    6312                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6313                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x5f)
    6314                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    6315                      .dwendtag $C$DW$T$44
    6316              
    6317                      .dwendtag $C$DW$TU$44
    6318              
    6319              
    6320              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    6321                      .dwmtype  $C$DW$T$45
    6322              
    6323              $C$DW$T$45      .dwtag  DW_TAG_union_type
    6324                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTFLG_REG")
    6325                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    6326              $C$DW$339       .dwtag  DW_TAG_member
    6327                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$43)
    6328                      .dwattr $C$DW$339, DW_AT_name("all")
    6329                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6330                      .dwattr $C$DW$339, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6331                      .dwattr $C$DW$339, DW_AT_decl_line(0x68)
    6332                      .dwattr $C$DW$339, DW_AT_decl_column(0x0d)
    6333              
    6334              $C$DW$340       .dwtag  DW_TAG_member
    6335                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$44)
    6336                      .dwattr $C$DW$340, DW_AT_name("bit")
    6337                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6338                      .dwattr $C$DW$340, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    6339                      .dwattr $C$DW$340, DW_AT_decl_line(0x69)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:16:25 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user_cpu.asm                                   PAGE  130

    6340                      .dwattr $C$DW$340, DW_AT_decl_column(0x1d)
    6341              
    6342                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    6343                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x67)
    6344                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x07)
    6345                      .dwendtag $C$DW$T$45
    6346              
    6347                      .dwendtag $C$DW$TU$45
    6348              
    6349              
    6350              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6351                      .dwmtype  $C$DW$T$102
    6352              $C$DW$341       .dwtag  DW_TAG_TI_far_type
    6353                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$45)
    6354              
    6355              $C$DW$T$102     .dwtag  DW_TAG_volatile_type
    6356                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$341)
    6357              
    6358                      .dwendtag $C$DW$TU$102
    6359              
    6360              
    6361              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    6362                      .dwmtype  $C$DW$T$103
    6363              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    6364                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    6365                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    6366              
    6367                      .dwendtag $C$DW$TU$103
    6368              
    6369              
    6370              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    6371                      .dwmtype  $C$DW$T$48
    6372              
    6373              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6374                      .dwattr $C$DW$T$48, DW_AT_name("EQEP_REGS")
