TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:23:13 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_main_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_LAUNCHXL-F280025C\251210_LAUNC
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    4941                      .dwattr $C$DW$330, DW_AT_const_value(0x13)
    4942                      .dwattr $C$DW$330, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4943                      .dwattr $C$DW$330, DW_AT_decl_line(0x176)
    4944                      .dwattr $C$DW$330, DW_AT_decl_column(0x05)
    4945              
    4946              $C$DW$331       .dwtag  DW_TAG_enumerator
    4947                      .dwattr $C$DW$331, DW_AT_name("SYSCTL_PERIPH_CLK_LINB")
    4948                      .dwattr $C$DW$331, DW_AT_const_value(0x113)
    4949                      .dwattr $C$DW$331, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4950                      .dwattr $C$DW$331, DW_AT_decl_line(0x177)
    4951                      .dwattr $C$DW$331, DW_AT_decl_column(0x05)
    4952              
    4953              $C$DW$332       .dwtag  DW_TAG_enumerator
    4954                      .dwattr $C$DW$332, DW_AT_name("SYSCTL_PERIPH_CLK_PMBUSA")
    4955                      .dwattr $C$DW$332, DW_AT_const_value(0x14)
    4956                      .dwattr $C$DW$332, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4957                      .dwattr $C$DW$332, DW_AT_decl_line(0x178)
    4958                      .dwattr $C$DW$332, DW_AT_decl_column(0x05)
    4959              
    4960              $C$DW$333       .dwtag  DW_TAG_enumerator
    4961                      .dwattr $C$DW$333, DW_AT_name("SYSCTL_PERIPH_CLK_DCC0")
    4962                      .dwattr $C$DW$333, DW_AT_const_value(0x15)
    4963                      .dwattr $C$DW$333, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4964                      .dwattr $C$DW$333, DW_AT_decl_line(0x179)
    4965                      .dwattr $C$DW$333, DW_AT_decl_column(0x05)
    4966              
    4967              $C$DW$334       .dwtag  DW_TAG_enumerator
    4968                      .dwattr $C$DW$334, DW_AT_name("SYSCTL_PERIPH_CLK_DCC1")
    4969                      .dwattr $C$DW$334, DW_AT_const_value(0x115)
    4970                      .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4971                      .dwattr $C$DW$334, DW_AT_decl_line(0x17a)
    4972                      .dwattr $C$DW$334, DW_AT_decl_column(0x05)
    4973              
    4974              $C$DW$335       .dwtag  DW_TAG_enumerator
    4975                      .dwattr $C$DW$335, DW_AT_name("SYSCTL_PERIPH_CLK_MPOST0")
    4976                      .dwattr $C$DW$335, DW_AT_const_value(0x16)
    4977                      .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4978                      .dwattr $C$DW$335, DW_AT_decl_line(0x17b)
    4979                      .dwattr $C$DW$335, DW_AT_decl_column(0x05)
    4980              
    4981              $C$DW$336       .dwtag  DW_TAG_enumerator
    4982                      .dwattr $C$DW$336, DW_AT_name("SYSCTL_PERIPH_CLK_HICA")
    4983                      .dwattr $C$DW$336, DW_AT_const_value(0x19)
    4984                      .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib\f
    4985                      .dwattr $C$DW$336, DW_AT_decl_line(0x17c)
    4986                      .dwattr $C$DW$336, DW_AT_decl_column(0x05)
    4987              
    4988                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib
    4989                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x151)
    4990                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x01)
    4991                      .dwendtag $C$DW$T$126
    4992              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   97

    4993                      .dwendtag $C$DW$TU$126
    4994              
    4995              
    4996              $C$DW$TU$127    .dwtag  DW_TAG_type_unit
    4997                      .dwmtype  $C$DW$T$127
    4998              $C$DW$T$127     .dwtag  DW_TAG_typedef
    4999                      .dwattr $C$DW$T$127, DW_AT_name("SysCtl_PeripheralPCLOCKCR")
    5000                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    5001                      .dwattr $C$DW$T$127, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\driverlib
    5002                      .dwattr $C$DW$T$127, DW_AT_decl_line(0x17d)
    5003                      .dwattr $C$DW$T$127, DW_AT_decl_column(0x03)
    5004              
    5005                      .dwendtag $C$DW$TU$127
    5006              
    5007              
    5008              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    5009                      .dwmtype  $C$DW$T$19
    5010              
    5011              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5012                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    5013              $C$DW$337       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$12)
    5015                      .dwattr $C$DW$337, DW_AT_name("quot")
    5016                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5017                      .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5018                      .dwattr $C$DW$337, DW_AT_decl_line(0x59)
    5019                      .dwattr $C$DW$337, DW_AT_decl_column(0x17)
    5020              
    5021              $C$DW$338       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$12)
    5023                      .dwattr $C$DW$338, DW_AT_name("rem")
    5024                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5025                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5026                      .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5027                      .dwattr $C$DW$338, DW_AT_decl_line(0x59)
    5028                      .dwattr $C$DW$338, DW_AT_decl_column(0x1d)
    5029              
    5030                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5031                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    5032                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    5033                      .dwendtag $C$DW$T$19
    5034              
    5035                      .dwendtag $C$DW$TU$19
    5036              
    5037              
    5038              $C$DW$TU$129    .dwtag  DW_TAG_type_unit
    5039                      .dwmtype  $C$DW$T$129
    5040              $C$DW$T$129     .dwtag  DW_TAG_typedef
    5041                      .dwattr $C$DW$T$129, DW_AT_name("ldiv_t")
    5042                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$19)
    5043                      .dwattr $C$DW$T$129, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5044                      .dwattr $C$DW$T$129, DW_AT_decl_line(0x59)
    5045                      .dwattr $C$DW$T$129, DW_AT_decl_column(0x24)
    5046              
    5047                      .dwendtag $C$DW$TU$129
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   98

    5048              
    5049              
    5050              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    5051                      .dwmtype  $C$DW$T$20
    5052              
    5053              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5054                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    5055              $C$DW$339       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$14)
    5057                      .dwattr $C$DW$339, DW_AT_name("quot")
    5058                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5059                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5060                      .dwattr $C$DW$339, DW_AT_decl_line(0x63)
    5061                      .dwattr $C$DW$339, DW_AT_decl_column(0x1c)
    5062              
    5063              $C$DW$340       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$14)
    5065                      .dwattr $C$DW$340, DW_AT_name("rem")
    5066                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5067                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5068                      .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    5069                      .dwattr $C$DW$340, DW_AT_decl_line(0x63)
    5070                      .dwattr $C$DW$340, DW_AT_decl_column(0x22)
    5071              
    5072                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    5073                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    5074                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    5075                      .dwendtag $C$DW$T$20
    5076              
    5077                      .dwendtag $C$DW$TU$20
    5078              
    5079              
    5080              $C$DW$TU$132    .dwtag  DW_TAG_type_unit
    5081                      .dwmtype  $C$DW$T$132
    5082              $C$DW$T$132     .dwtag  DW_TAG_typedef
    5083                      .dwattr $C$DW$T$132, DW_AT_name("lldiv_t")
    5084                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$20)
    5085                      .dwattr $C$DW$T$132, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    5086                      .dwattr $C$DW$T$132, DW_AT_decl_line(0x63)
    5087                      .dwattr $C$DW$T$132, DW_AT_decl_column(0x29)
    5088              
    5089                      .dwendtag $C$DW$TU$132
    5090              
    5091              
    5092              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5093                      .dwmtype  $C$DW$T$25
    5094              
    5095              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5096                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    5097              $C$DW$341       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    5099                      .dwattr $C$DW$341, DW_AT_name("input_ptr1")
    5100                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5101                      .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5102                      .dwattr $C$DW$341, DW_AT_decl_line(0x32)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE   99

    5103                      .dwattr $C$DW$341, DW_AT_decl_column(0x0d)
    5104              
    5105              $C$DW$342       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
    5107                      .dwattr $C$DW$342, DW_AT_name("input_ptr2")
    5108                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5109                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5110                      .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5111                      .dwattr $C$DW$342, DW_AT_decl_line(0x33)
    5112                      .dwattr $C$DW$342, DW_AT_decl_column(0x0d)
    5113              
    5114              $C$DW$343       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    5116                      .dwattr $C$DW$343, DW_AT_name("output_ptr1")
    5117                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5118                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5119                      .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5120                      .dwattr $C$DW$343, DW_AT_decl_line(0x34)
    5121                      .dwattr $C$DW$343, DW_AT_decl_column(0x0d)
    5122              
    5123              $C$DW$344       .dwtag  DW_TAG_member
    5124                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    5125                      .dwattr $C$DW$344, DW_AT_name("output_ptr2")
    5126                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5127                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5128                      .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5129                      .dwattr $C$DW$344, DW_AT_decl_line(0x35)
    5130                      .dwattr $C$DW$344, DW_AT_decl_column(0x0d)
    5131              
    5132              $C$DW$345       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$21)
    5134                      .dwattr $C$DW$345, DW_AT_name("prev_value")
    5135                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5136                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5137                      .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5138                      .dwattr $C$DW$345, DW_AT_decl_line(0x36)
    5139                      .dwattr $C$DW$345, DW_AT_decl_column(0x0c)
    5140              
    5141              $C$DW$346       .dwtag  DW_TAG_member
    5142                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    5143                      .dwattr $C$DW$346, DW_AT_name("trig_value")
    5144                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5145                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5146                      .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5147                      .dwattr $C$DW$346, DW_AT_decl_line(0x37)
    5148                      .dwattr $C$DW$346, DW_AT_decl_column(0x0c)
    5149              
    5150              $C$DW$347       .dwtag  DW_TAG_member
    5151                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$24)
    5152                      .dwattr $C$DW$347, DW_AT_name("status")
    5153                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5154                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5155                      .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5156                      .dwattr $C$DW$347, DW_AT_decl_line(0x38)
    5157                      .dwattr $C$DW$347, DW_AT_decl_column(0x0a)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  100

    5158              
    5159              $C$DW$348       .dwtag  DW_TAG_member
    5160                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$24)
    5161                      .dwattr $C$DW$348, DW_AT_name("pre_scalar")
    5162                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5163                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5164                      .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5165                      .dwattr $C$DW$348, DW_AT_decl_line(0x39)
    5166                      .dwattr $C$DW$348, DW_AT_decl_column(0x0a)
    5167              
    5168              $C$DW$349       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$24)
    5170                      .dwattr $C$DW$349, DW_AT_name("skip_count")
    5171                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5172                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5173                      .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5174                      .dwattr $C$DW$349, DW_AT_decl_line(0x3a)
    5175                      .dwattr $C$DW$349, DW_AT_decl_column(0x0a)
    5176              
    5177              $C$DW$350       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$24)
    5179                      .dwattr $C$DW$350, DW_AT_name("size")
    5180                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5181                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5182                      .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5183                      .dwattr $C$DW$350, DW_AT_decl_line(0x3b)
    5184                      .dwattr $C$DW$350, DW_AT_decl_column(0x0a)
    5185              
    5186              $C$DW$351       .dwtag  DW_TAG_member
    5187                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    5188                      .dwattr $C$DW$351, DW_AT_name("count")
    5189                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5190                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5191                      .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    5192                      .dwattr $C$DW$351, DW_AT_decl_line(0x3c)
    5193                      .dwattr $C$DW$351, DW_AT_decl_column(0x0a)
    5194              
    5195                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5196                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x31)
    5197                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
    5198                      .dwendtag $C$DW$T$25
    5199              
    5200                      .dwendtag $C$DW$TU$25
    5201              
    5202              
    5203              $C$DW$TU$134    .dwtag  DW_TAG_type_unit
    5204                      .dwmtype  $C$DW$T$134
    5205              $C$DW$T$134     .dwtag  DW_TAG_typedef
    5206                      .dwattr $C$DW$T$134, DW_AT_name("DLOG_2CH_F")
    5207                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$25)
    5208                      .dwattr $C$DW$T$134, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    5209                      .dwattr $C$DW$T$134, DW_AT_decl_line(0x3d)
    5210                      .dwattr $C$DW$T$134, DW_AT_decl_column(0x02)
    5211              
    5212                      .dwendtag $C$DW$TU$134
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  101

    5213              
    5214              
    5215              $C$DW$TU$135    .dwtag  DW_TAG_type_unit
    5216                      .dwmtype  $C$DW$T$135
    5217              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    5218                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    5219                      .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    5220              
    5221                      .dwendtag $C$DW$TU$135
    5222              
    5223              
    5224              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5225                      .dwmtype  $C$DW$T$26
    5226              
    5227              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5228                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    5229              $C$DW$352       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    5231                      .dwattr $C$DW$352, DW_AT_name("Freq")
    5232                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5233                      .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5234                      .dwattr $C$DW$352, DW_AT_decl_line(0x29)
    5235                      .dwattr $C$DW$352, DW_AT_decl_column(0x1d)
    5236              
    5237              $C$DW$353       .dwtag  DW_TAG_member
    5238                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    5239                      .dwattr $C$DW$353, DW_AT_name("StepAngleMax")
    5240                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5241                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5242                      .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5243                      .dwattr $C$DW$353, DW_AT_decl_line(0x2a)
    5244                      .dwattr $C$DW$353, DW_AT_decl_column(0x11)
    5245              
    5246              $C$DW$354       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    5248                      .dwattr $C$DW$354, DW_AT_name("Angle")
    5249                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5250                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5251                      .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5252                      .dwattr $C$DW$354, DW_AT_decl_line(0x2b)
    5253                      .dwattr $C$DW$354, DW_AT_decl_column(0x11)
    5254              
    5255              $C$DW$355       .dwtag  DW_TAG_member
    5256                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    5257                      .dwattr $C$DW$355, DW_AT_name("Gain")
    5258                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5259                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5260                      .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5261                      .dwattr $C$DW$355, DW_AT_decl_line(0x2c)
    5262                      .dwattr $C$DW$355, DW_AT_decl_column(0x11)
    5263              
    5264              $C$DW$356       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
    5266                      .dwattr $C$DW$356, DW_AT_name("Out")
    5267                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  102

    5268                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5269                      .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5270                      .dwattr $C$DW$356, DW_AT_decl_line(0x2d)
    5271                      .dwattr $C$DW$356, DW_AT_decl_column(0x11)
    5272              
    5273              $C$DW$357       .dwtag  DW_TAG_member
    5274                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    5275                      .dwattr $C$DW$357, DW_AT_name("Offset")
    5276                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5277                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5278                      .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5279                      .dwattr $C$DW$357, DW_AT_decl_line(0x2e)
    5280                      .dwattr $C$DW$357, DW_AT_decl_column(0x11)
    5281              
    5282                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5283                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x29)
    5284                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    5285                      .dwendtag $C$DW$T$26
    5286              
    5287                      .dwendtag $C$DW$TU$26
    5288              
    5289              
    5290              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    5291                      .dwmtype  $C$DW$T$94
    5292              $C$DW$T$94      .dwtag  DW_TAG_typedef
    5293                      .dwattr $C$DW$T$94, DW_AT_name("RAMPGEN")
    5294                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$26)
    5295                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5296                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x2f)
    5297                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0d)
    5298              
    5299                      .dwendtag $C$DW$TU$94
    5300              
    5301              
    5302              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5303                      .dwmtype  $C$DW$T$29
    5304              
    5305              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5306                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    5307              $C$DW$358       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
    5309                      .dwattr $C$DW$358, DW_AT_name("TargetValue")
    5310                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5311                      .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5312                      .dwattr $C$DW$358, DW_AT_decl_line(0x2b)
    5313                      .dwattr $C$DW$358, DW_AT_decl_column(0x0f)
    5314              
    5315              $C$DW$359       .dwtag  DW_TAG_member
    5316                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$28)
    5317                      .dwattr $C$DW$359, DW_AT_name("RampDelayMax")
    5318                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5319                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5320                      .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5321                      .dwattr $C$DW$359, DW_AT_decl_line(0x2c)
    5322                      .dwattr $C$DW$359, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  103

    5323              
    5324              $C$DW$360       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
    5326                      .dwattr $C$DW$360, DW_AT_name("RampLowLimit")
    5327                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5328                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5329                      .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5330                      .dwattr $C$DW$360, DW_AT_decl_line(0x2d)
    5331                      .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    5332              
    5333              $C$DW$361       .dwtag  DW_TAG_member
    5334                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
    5335                      .dwattr $C$DW$361, DW_AT_name("RampHighLimit")
    5336                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5337                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5338                      .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5339                      .dwattr $C$DW$361, DW_AT_decl_line(0x2e)
    5340                      .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    5341              
    5342              $C$DW$362       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$28)
    5344                      .dwattr $C$DW$362, DW_AT_name("RampDelayCount")
    5345                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5346                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5347                      .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5348                      .dwattr $C$DW$362, DW_AT_decl_line(0x2f)
    5349                      .dwattr $C$DW$362, DW_AT_decl_column(0x0c)
    5350              
    5351              $C$DW$363       .dwtag  DW_TAG_member
    5352                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
    5353                      .dwattr $C$DW$363, DW_AT_name("SetpointValue")
    5354                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5355                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5356                      .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5357                      .dwattr $C$DW$363, DW_AT_decl_line(0x30)
    5358                      .dwattr $C$DW$363, DW_AT_decl_column(0x0c)
    5359              
    5360              $C$DW$364       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$28)
    5362                      .dwattr $C$DW$364, DW_AT_name("EqualFlag")
    5363                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5364                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5365                      .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5366                      .dwattr $C$DW$364, DW_AT_decl_line(0x31)
    5367                      .dwattr $C$DW$364, DW_AT_decl_column(0x0c)
    5368              
    5369              $C$DW$365       .dwtag  DW_TAG_member
    5370                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$21)
    5371                      .dwattr $C$DW$365, DW_AT_name("Tmp")
    5372                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5373                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5374                      .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5375                      .dwattr $C$DW$365, DW_AT_decl_line(0x32)
    5376                      .dwattr $C$DW$365, DW_AT_decl_column(0x0c)
    5377              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  104

    5378                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5379                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x2a)
    5380                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5381                      .dwendtag $C$DW$T$29
    5382              
    5383                      .dwendtag $C$DW$TU$29
    5384              
    5385              
    5386              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    5387                      .dwmtype  $C$DW$T$95
    5388              $C$DW$T$95      .dwtag  DW_TAG_typedef
    5389                      .dwattr $C$DW$T$95, DW_AT_name("RMPCNTL")
    5390                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$29)
    5391                      .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5392                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x33)
    5393                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    5394              
    5395                      .dwendtag $C$DW$TU$95
    5396              
    5397              
    5398              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5399                      .dwmtype  $C$DW$T$30
    5400              
    5401              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5402                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    5403              $C$DW$366       .dwtag  DW_TAG_member
    5404                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$21)
    5405                      .dwattr $C$DW$366, DW_AT_name("As")
    5406                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5407                      .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5408                      .dwattr $C$DW$366, DW_AT_decl_line(0x2a)
    5409                      .dwattr $C$DW$366, DW_AT_decl_column(0x1e)
    5410              
    5411              $C$DW$367       .dwtag  DW_TAG_member
    5412                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    5413                      .dwattr $C$DW$367, DW_AT_name("Bs")
    5414                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5415                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5416                      .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5417                      .dwattr $C$DW$367, DW_AT_decl_line(0x2b)
    5418                      .dwattr $C$DW$367, DW_AT_decl_column(0x12)
    5419              
    5420              $C$DW$368       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$21)
    5422                      .dwattr $C$DW$368, DW_AT_name("Cs")
    5423                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5424                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5425                      .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5426                      .dwattr $C$DW$368, DW_AT_decl_line(0x2c)
    5427                      .dwattr $C$DW$368, DW_AT_decl_column(0x12)
    5428              
    5429              $C$DW$369       .dwtag  DW_TAG_member
    5430                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    5431                      .dwattr $C$DW$369, DW_AT_name("Alpha")
    5432                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  105

    5433                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5434                      .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5435                      .dwattr $C$DW$369, DW_AT_decl_line(0x2d)
    5436                      .dwattr $C$DW$369, DW_AT_decl_column(0x12)
    5437              
    5438              $C$DW$370       .dwtag  DW_TAG_member
    5439                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    5440                      .dwattr $C$DW$370, DW_AT_name("Beta")
    5441                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5442                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5443                      .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5444                      .dwattr $C$DW$370, DW_AT_decl_line(0x2e)
    5445                      .dwattr $C$DW$370, DW_AT_decl_column(0x12)
    5446              
    5447                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5448                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2a)
    5449                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    5450                      .dwendtag $C$DW$T$30
    5451              
    5452                      .dwendtag $C$DW$TU$30
    5453              
    5454              
    5455              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    5456                      .dwmtype  $C$DW$T$96
    5457              $C$DW$T$96      .dwtag  DW_TAG_typedef
    5458                      .dwattr $C$DW$T$96, DW_AT_name("CLARKE")
    5459                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$30)
    5460                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5461                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x2f)
    5462                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x09)
    5463              
    5464                      .dwendtag $C$DW$TU$96
    5465              
    5466              
    5467              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5468                      .dwmtype  $C$DW$T$31
    5469              
    5470              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5471                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    5472              $C$DW$371       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    5474                      .dwattr $C$DW$371, DW_AT_name("Alpha")
    5475                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5476                      .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5477                      .dwattr $C$DW$371, DW_AT_decl_line(0x29)
    5478                      .dwattr $C$DW$371, DW_AT_decl_column(0x1e)
    5479              
    5480              $C$DW$372       .dwtag  DW_TAG_member
    5481                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
    5482                      .dwattr $C$DW$372, DW_AT_name("Beta")
    5483                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5484                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5485                      .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5486                      .dwattr $C$DW$372, DW_AT_decl_line(0x2a)
    5487                      .dwattr $C$DW$372, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  106

    5488              
    5489              $C$DW$373       .dwtag  DW_TAG_member
    5490                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
    5491                      .dwattr $C$DW$373, DW_AT_name("Angle")
    5492                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5493                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5494                      .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5495                      .dwattr $C$DW$373, DW_AT_decl_line(0x2b)
    5496                      .dwattr $C$DW$373, DW_AT_decl_column(0x12)
    5497              
    5498              $C$DW$374       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    5500                      .dwattr $C$DW$374, DW_AT_name("Ds")
    5501                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5502                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5503                      .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5504                      .dwattr $C$DW$374, DW_AT_decl_line(0x2c)
    5505                      .dwattr $C$DW$374, DW_AT_decl_column(0x12)
    5506              
    5507              $C$DW$375       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    5509                      .dwattr $C$DW$375, DW_AT_name("Qs")
    5510                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5511                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5512                      .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5513                      .dwattr $C$DW$375, DW_AT_decl_line(0x2d)
    5514                      .dwattr $C$DW$375, DW_AT_decl_column(0x12)
    5515              
    5516              $C$DW$376       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    5518                      .dwattr $C$DW$376, DW_AT_name("Sine")
    5519                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5520                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5521                      .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5522                      .dwattr $C$DW$376, DW_AT_decl_line(0x2e)
    5523                      .dwattr $C$DW$376, DW_AT_decl_column(0x12)
    5524              
    5525              $C$DW$377       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    5527                      .dwattr $C$DW$377, DW_AT_name("Cosine")
    5528                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5529                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5530                      .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5531                      .dwattr $C$DW$377, DW_AT_decl_line(0x2f)
    5532                      .dwattr $C$DW$377, DW_AT_decl_column(0x12)
    5533              
    5534                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5535                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x29)
    5536                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5537                      .dwendtag $C$DW$T$31
    5538              
    5539                      .dwendtag $C$DW$TU$31
    5540              
    5541              
    5542              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  107

    5543                      .dwmtype  $C$DW$T$97
    5544              $C$DW$T$97      .dwtag  DW_TAG_typedef
    5545                      .dwattr $C$DW$T$97, DW_AT_name("PARK")
    5546                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$31)
    5547                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5548                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x30)
    5549                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x09)
    5550              
    5551                      .dwendtag $C$DW$TU$97
    5552              
    5553              
    5554              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    5555                      .dwmtype  $C$DW$T$32
    5556              
    5557              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5558                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    5559              $C$DW$378       .dwtag  DW_TAG_member
    5560                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    5561                      .dwattr $C$DW$378, DW_AT_name("Alpha")
    5562                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5563                      .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5564                      .dwattr $C$DW$378, DW_AT_decl_line(0x29)
    5565                      .dwattr $C$DW$378, DW_AT_decl_column(0x1e)
    5566              
    5567              $C$DW$379       .dwtag  DW_TAG_member
    5568                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    5569                      .dwattr $C$DW$379, DW_AT_name("Beta")
    5570                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5571                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5572                      .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5573                      .dwattr $C$DW$379, DW_AT_decl_line(0x2a)
    5574                      .dwattr $C$DW$379, DW_AT_decl_column(0x12)
    5575              
    5576              $C$DW$380       .dwtag  DW_TAG_member
    5577                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    5578                      .dwattr $C$DW$380, DW_AT_name("Angle")
    5579                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5580                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5581                      .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5582                      .dwattr $C$DW$380, DW_AT_decl_line(0x2b)
    5583                      .dwattr $C$DW$380, DW_AT_decl_column(0x12)
    5584              
    5585              $C$DW$381       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    5587                      .dwattr $C$DW$381, DW_AT_name("Ds")
    5588                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5589                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5590                      .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5591                      .dwattr $C$DW$381, DW_AT_decl_line(0x2c)
    5592                      .dwattr $C$DW$381, DW_AT_decl_column(0x12)
    5593              
    5594              $C$DW$382       .dwtag  DW_TAG_member
    5595                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    5596                      .dwattr $C$DW$382, DW_AT_name("Qs")
    5597                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  108

    5598                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5599                      .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5600                      .dwattr $C$DW$382, DW_AT_decl_line(0x2d)
    5601                      .dwattr $C$DW$382, DW_AT_decl_column(0x12)
    5602              
    5603              $C$DW$383       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    5605                      .dwattr $C$DW$383, DW_AT_name("Sine")
    5606                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5607                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5608                      .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5609                      .dwattr $C$DW$383, DW_AT_decl_line(0x2e)
    5610                      .dwattr $C$DW$383, DW_AT_decl_column(0x12)
    5611              
    5612              $C$DW$384       .dwtag  DW_TAG_member
    5613                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$21)
    5614                      .dwattr $C$DW$384, DW_AT_name("Cosine")
    5615                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5616                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5617                      .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5618                      .dwattr $C$DW$384, DW_AT_decl_line(0x2f)
    5619                      .dwattr $C$DW$384, DW_AT_decl_column(0x12)
    5620              
    5621                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5622                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x29)
    5623                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5624                      .dwendtag $C$DW$T$32
    5625              
    5626                      .dwendtag $C$DW$TU$32
    5627              
    5628              
    5629              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    5630                      .dwmtype  $C$DW$T$98
    5631              $C$DW$T$98      .dwtag  DW_TAG_typedef
    5632                      .dwattr $C$DW$T$98, DW_AT_name("IPARK")
    5633                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$32)
    5634                      .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5635                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x30)
    5636                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x0b)
    5637              
    5638                      .dwendtag $C$DW$TU$98
    5639              
    5640              
    5641              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5642                      .dwmtype  $C$DW$T$35
    5643              
    5644              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5645                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    5646              $C$DW$385       .dwtag  DW_TAG_member
    5647                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
    5648                      .dwattr $C$DW$385, DW_AT_name("Ualpha")
    5649                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5650                      .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5651                      .dwattr $C$DW$385, DW_AT_decl_line(0x2b)
    5652                      .dwattr $C$DW$385, DW_AT_decl_column(0x10)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  109

    5653              
    5654              $C$DW$386       .dwtag  DW_TAG_member
    5655                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    5656                      .dwattr $C$DW$386, DW_AT_name("Ubeta")
    5657                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5658                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5659                      .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5660                      .dwattr $C$DW$386, DW_AT_decl_line(0x2c)
    5661                      .dwattr $C$DW$386, DW_AT_decl_column(0x10)
    5662              
    5663              $C$DW$387       .dwtag  DW_TAG_member
    5664                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    5665                      .dwattr $C$DW$387, DW_AT_name("Ta")
    5666                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5667                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5668                      .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5669                      .dwattr $C$DW$387, DW_AT_decl_line(0x2d)
    5670                      .dwattr $C$DW$387, DW_AT_decl_column(0x10)
    5671              
    5672              $C$DW$388       .dwtag  DW_TAG_member
    5673                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    5674                      .dwattr $C$DW$388, DW_AT_name("Tb")
    5675                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5676                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5677                      .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5678                      .dwattr $C$DW$388, DW_AT_decl_line(0x2e)
    5679                      .dwattr $C$DW$388, DW_AT_decl_column(0x10)
    5680              
    5681              $C$DW$389       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
    5683                      .dwattr $C$DW$389, DW_AT_name("Tc")
    5684                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5685                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5686                      .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5687                      .dwattr $C$DW$389, DW_AT_decl_line(0x2f)
    5688                      .dwattr $C$DW$389, DW_AT_decl_column(0x10)
    5689              
    5690              $C$DW$390       .dwtag  DW_TAG_member
    5691                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
    5692                      .dwattr $C$DW$390, DW_AT_name("tmp1")
    5693                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5694                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5695                      .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5696                      .dwattr $C$DW$390, DW_AT_decl_line(0x30)
    5697                      .dwattr $C$DW$390, DW_AT_decl_column(0x10)
    5698              
    5699              $C$DW$391       .dwtag  DW_TAG_member
    5700                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$21)
    5701                      .dwattr $C$DW$391, DW_AT_name("tmp2")
    5702                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5703                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5704                      .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5705                      .dwattr $C$DW$391, DW_AT_decl_line(0x31)
    5706                      .dwattr $C$DW$391, DW_AT_decl_column(0x10)
    5707              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  110

    5708              $C$DW$392       .dwtag  DW_TAG_member
    5709                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
    5710                      .dwattr $C$DW$392, DW_AT_name("tmp3")
    5711                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5712                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5713                      .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5714                      .dwattr $C$DW$392, DW_AT_decl_line(0x32)
    5715                      .dwattr $C$DW$392, DW_AT_decl_column(0x10)
    5716              
    5717              $C$DW$393       .dwtag  DW_TAG_member
    5718                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$34)
    5719                      .dwattr $C$DW$393, DW_AT_name("VecSector")
    5720                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5721                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5722                      .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5723                      .dwattr $C$DW$393, DW_AT_decl_line(0x33)
    5724                      .dwattr $C$DW$393, DW_AT_decl_column(0x0b)
    5725              
    5726                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5727                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    5728                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
    5729                      .dwendtag $C$DW$T$35
    5730              
    5731                      .dwendtag $C$DW$TU$35
    5732              
    5733              
    5734              $C$DW$TU$99     .dwtag  DW_TAG_type_unit
    5735                      .dwmtype  $C$DW$T$99
    5736              $C$DW$T$99      .dwtag  DW_TAG_typedef
    5737                      .dwattr $C$DW$T$99, DW_AT_name("SVGEN")
    5738                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$35)
    5739                      .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5740                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x34)
    5741                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x04)
    5742              
    5743                      .dwendtag $C$DW$TU$99
    5744              
    5745              
    5746              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5747                      .dwmtype  $C$DW$T$38
    5748              
    5749              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5750                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    5751              $C$DW$394       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$21)
    5753                      .dwattr $C$DW$394, DW_AT_name("ElecTheta")
    5754                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5755                      .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5756                      .dwattr $C$DW$394, DW_AT_decl_line(0x2b)
    5757                      .dwattr $C$DW$394, DW_AT_decl_column(0x12)
    5758              
    5759              $C$DW$395       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$28)
    5761                      .dwattr $C$DW$395, DW_AT_name("DirectionQep")
    5762                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  111

    5763                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5764                      .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5765                      .dwattr $C$DW$395, DW_AT_decl_line(0x2c)
    5766                      .dwattr $C$DW$395, DW_AT_decl_column(0x11)
    5767              
    5768              $C$DW$396       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    5770                      .dwattr $C$DW$396, DW_AT_name("OldElecTheta")
    5771                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5772                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5773                      .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5774                      .dwattr $C$DW$396, DW_AT_decl_line(0x2d)
    5775                      .dwattr $C$DW$396, DW_AT_decl_column(0x12)
    5776              
    5777              $C$DW$397       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    5779                      .dwattr $C$DW$397, DW_AT_name("Speed")
    5780                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5781                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5782                      .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5783                      .dwattr $C$DW$397, DW_AT_decl_line(0x2e)
    5784                      .dwattr $C$DW$397, DW_AT_decl_column(0x12)
    5785              
    5786              $C$DW$398       .dwtag  DW_TAG_member
    5787                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$28)
    5788                      .dwattr $C$DW$398, DW_AT_name("BaseRpm")
    5789                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5790                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5791                      .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5792                      .dwattr $C$DW$398, DW_AT_decl_line(0x2f)
    5793                      .dwattr $C$DW$398, DW_AT_decl_column(0x11)
    5794              
    5795              $C$DW$399       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    5797                      .dwattr $C$DW$399, DW_AT_name("K1")
    5798                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5799                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5800                      .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5801                      .dwattr $C$DW$399, DW_AT_decl_line(0x30)
    5802                      .dwattr $C$DW$399, DW_AT_decl_column(0x12)
    5803              
    5804              $C$DW$400       .dwtag  DW_TAG_member
    5805                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    5806                      .dwattr $C$DW$400, DW_AT_name("K2")
    5807                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5808                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5809                      .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5810                      .dwattr $C$DW$400, DW_AT_decl_line(0x31)
    5811                      .dwattr $C$DW$400, DW_AT_decl_column(0x12)
    5812              
    5813              $C$DW$401       .dwtag  DW_TAG_member
    5814                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    5815                      .dwattr $C$DW$401, DW_AT_name("K3")
    5816                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5817                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  112

    5818                      .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5819                      .dwattr $C$DW$401, DW_AT_decl_line(0x32)
    5820                      .dwattr $C$DW$401, DW_AT_decl_column(0x12)
    5821              
    5822              $C$DW$402       .dwtag  DW_TAG_member
    5823                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$37)
    5824                      .dwattr $C$DW$402, DW_AT_name("SpeedRpm")
    5825                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5826                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5827                      .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5828                      .dwattr $C$DW$402, DW_AT_decl_line(0x33)
    5829                      .dwattr $C$DW$402, DW_AT_decl_column(0x10)
    5830              
    5831              $C$DW$403       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    5833                      .dwattr $C$DW$403, DW_AT_name("Tmp")
    5834                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5835                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5836                      .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5837                      .dwattr $C$DW$403, DW_AT_decl_line(0x34)
    5838                      .dwattr $C$DW$403, DW_AT_decl_column(0x12)
    5839              
    5840                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5841                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2a)
    5842                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5843                      .dwendtag $C$DW$T$38
    5844              
    5845                      .dwendtag $C$DW$TU$38
    5846              
    5847              
    5848              $C$DW$TU$100    .dwtag  DW_TAG_type_unit
    5849                      .dwmtype  $C$DW$T$100
    5850              $C$DW$T$100     .dwtag  DW_TAG_typedef
    5851                      .dwattr $C$DW$T$100, DW_AT_name("SPEED_MEAS_QEP")
    5852                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$38)
    5853                      .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    5854                      .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
    5855                      .dwattr $C$DW$T$100, DW_AT_decl_column(0x0a)
    5856              
    5857                      .dwendtag $C$DW$TU$100
    5858              
    5859              
    5860              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5861                      .dwmtype  $C$DW$T$39
    5862              
    5863              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5864                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    5865              $C$DW$404       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    5867                      .dwattr $C$DW$404, DW_AT_name("Ref")
    5868                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5869                      .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5870                      .dwattr $C$DW$404, DW_AT_decl_line(0x2a)
    5871                      .dwattr $C$DW$404, DW_AT_decl_column(0x1e)
    5872              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  113

    5873              $C$DW$405       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$21)
    5875                      .dwattr $C$DW$405, DW_AT_name("Fbk")
    5876                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5877                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5878                      .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5879                      .dwattr $C$DW$405, DW_AT_decl_line(0x2b)
    5880                      .dwattr $C$DW$405, DW_AT_decl_column(0x12)
    5881              
    5882              $C$DW$406       .dwtag  DW_TAG_member
    5883                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    5884                      .dwattr $C$DW$406, DW_AT_name("Out")
    5885                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5886                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5887                      .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5888                      .dwattr $C$DW$406, DW_AT_decl_line(0x2c)
    5889                      .dwattr $C$DW$406, DW_AT_decl_column(0x12)
    5890              
    5891              $C$DW$407       .dwtag  DW_TAG_member
    5892                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$21)
    5893                      .dwattr $C$DW$407, DW_AT_name("c1")
    5894                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5895                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5896                      .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5897                      .dwattr $C$DW$407, DW_AT_decl_line(0x2d)
    5898                      .dwattr $C$DW$407, DW_AT_decl_column(0x12)
    5899              
    5900              $C$DW$408       .dwtag  DW_TAG_member
    5901                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$21)
    5902                      .dwattr $C$DW$408, DW_AT_name("c2")
    5903                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5904                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5905                      .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5906                      .dwattr $C$DW$408, DW_AT_decl_line(0x2e)
    5907                      .dwattr $C$DW$408, DW_AT_decl_column(0x12)
    5908              
    5909                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5910                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x2a)
    5911                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    5912                      .dwendtag $C$DW$T$39
    5913              
    5914                      .dwendtag $C$DW$TU$39
    5915              
    5916              
    5917              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5918                      .dwmtype  $C$DW$T$42
    5919              $C$DW$T$42      .dwtag  DW_TAG_typedef
    5920                      .dwattr $C$DW$T$42, DW_AT_name("PID_TERMINALS")
    5921                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    5922                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5923                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2f)
    5924                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x07)
    5925              
    5926                      .dwendtag $C$DW$TU$42
    5927              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  114

    5928              
    5929              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5930                      .dwmtype  $C$DW$T$40
    5931              
    5932              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5933                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    5934              $C$DW$409       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    5936                      .dwattr $C$DW$409, DW_AT_name("Kr")
    5937                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5938                      .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5939                      .dwattr $C$DW$409, DW_AT_decl_line(0x32)
    5940                      .dwattr $C$DW$409, DW_AT_decl_column(0x1e)
    5941              
    5942              $C$DW$410       .dwtag  DW_TAG_member
    5943                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$21)
    5944                      .dwattr $C$DW$410, DW_AT_name("Kp")
    5945                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5946                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5947                      .dwattr $C$DW$410, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5948                      .dwattr $C$DW$410, DW_AT_decl_line(0x33)
    5949                      .dwattr $C$DW$410, DW_AT_decl_column(0x12)
    5950              
    5951              $C$DW$411       .dwtag  DW_TAG_member
    5952                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$21)
    5953                      .dwattr $C$DW$411, DW_AT_name("Ki")
    5954                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5955                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5956                      .dwattr $C$DW$411, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5957                      .dwattr $C$DW$411, DW_AT_decl_line(0x34)
    5958                      .dwattr $C$DW$411, DW_AT_decl_column(0x12)
    5959              
    5960              $C$DW$412       .dwtag  DW_TAG_member
    5961                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$21)
    5962                      .dwattr $C$DW$412, DW_AT_name("Kd")
    5963                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5964                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5965                      .dwattr $C$DW$412, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5966                      .dwattr $C$DW$412, DW_AT_decl_line(0x35)
    5967                      .dwattr $C$DW$412, DW_AT_decl_column(0x12)
    5968              
    5969              $C$DW$413       .dwtag  DW_TAG_member
    5970                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    5971                      .dwattr $C$DW$413, DW_AT_name("Km")
    5972                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5973                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5974                      .dwattr $C$DW$413, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5975                      .dwattr $C$DW$413, DW_AT_decl_line(0x36)
    5976                      .dwattr $C$DW$413, DW_AT_decl_column(0x12)
    5977              
    5978              $C$DW$414       .dwtag  DW_TAG_member
    5979                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$21)
    5980                      .dwattr $C$DW$414, DW_AT_name("Umax")
    5981                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5982                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  115

    5983                      .dwattr $C$DW$414, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5984                      .dwattr $C$DW$414, DW_AT_decl_line(0x37)
    5985                      .dwattr $C$DW$414, DW_AT_decl_column(0x12)
    5986              
    5987              $C$DW$415       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    5989                      .dwattr $C$DW$415, DW_AT_name("Umin")
    5990                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5991                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5992                      .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5993                      .dwattr $C$DW$415, DW_AT_decl_line(0x38)
    5994                      .dwattr $C$DW$415, DW_AT_decl_column(0x12)
    5995              
    5996                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5997                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x32)
    5998                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    5999                      .dwendtag $C$DW$T$40
    6000              
    6001                      .dwendtag $C$DW$TU$40
    6002              
    6003              
    6004              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    6005                      .dwmtype  $C$DW$T$43
    6006              $C$DW$T$43      .dwtag  DW_TAG_typedef
    6007                      .dwattr $C$DW$T$43, DW_AT_name("PID_PARAMETERS")
    6008                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    6009                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6010                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x39)
    6011                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x07)
    6012              
    6013                      .dwendtag $C$DW$TU$43
    6014              
    6015              
    6016              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6017                      .dwmtype  $C$DW$T$41
    6018              
    6019              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6020                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    6021              $C$DW$416       .dwtag  DW_TAG_member
    6022                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    6023                      .dwattr $C$DW$416, DW_AT_name("up")
    6024                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6025                      .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6026                      .dwattr $C$DW$416, DW_AT_decl_line(0x3b)
    6027                      .dwattr $C$DW$416, DW_AT_decl_column(0x1e)
    6028              
    6029              $C$DW$417       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$21)
    6031                      .dwattr $C$DW$417, DW_AT_name("ui")
    6032                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6033                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6034                      .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6035                      .dwattr $C$DW$417, DW_AT_decl_line(0x3c)
    6036                      .dwattr $C$DW$417, DW_AT_decl_column(0x12)
    6037              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  116

    6038              $C$DW$418       .dwtag  DW_TAG_member
    6039                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    6040                      .dwattr $C$DW$418, DW_AT_name("ud")
    6041                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6042                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6043                      .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6044                      .dwattr $C$DW$418, DW_AT_decl_line(0x3d)
    6045                      .dwattr $C$DW$418, DW_AT_decl_column(0x12)
    6046              
    6047              $C$DW$419       .dwtag  DW_TAG_member
    6048                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
    6049                      .dwattr $C$DW$419, DW_AT_name("v1")
    6050                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6051                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6052                      .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6053                      .dwattr $C$DW$419, DW_AT_decl_line(0x3e)
    6054                      .dwattr $C$DW$419, DW_AT_decl_column(0x12)
    6055              
    6056              $C$DW$420       .dwtag  DW_TAG_member
    6057                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    6058                      .dwattr $C$DW$420, DW_AT_name("i1")
    6059                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6060                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6061                      .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6062                      .dwattr $C$DW$420, DW_AT_decl_line(0x3f)
    6063                      .dwattr $C$DW$420, DW_AT_decl_column(0x12)
    6064              
    6065              $C$DW$421       .dwtag  DW_TAG_member
    6066                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    6067                      .dwattr $C$DW$421, DW_AT_name("d1")
    6068                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6069                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6070                      .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6071                      .dwattr $C$DW$421, DW_AT_decl_line(0x40)
    6072                      .dwattr $C$DW$421, DW_AT_decl_column(0x12)
    6073              
    6074              $C$DW$422       .dwtag  DW_TAG_member
    6075                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    6076                      .dwattr $C$DW$422, DW_AT_name("d2")
    6077                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6078                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6079                      .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6080                      .dwattr $C$DW$422, DW_AT_decl_line(0x41)
    6081                      .dwattr $C$DW$422, DW_AT_decl_column(0x12)
    6082              
    6083              $C$DW$423       .dwtag  DW_TAG_member
    6084                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$21)
    6085                      .dwattr $C$DW$423, DW_AT_name("w1")
    6086                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6087                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6088                      .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6089                      .dwattr $C$DW$423, DW_AT_decl_line(0x42)
    6090                      .dwattr $C$DW$423, DW_AT_decl_column(0x12)
    6091              
    6092                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  117

    6093                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x3b)
    6094                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6095                      .dwendtag $C$DW$T$41
    6096              
    6097                      .dwendtag $C$DW$TU$41
    6098              
    6099              
    6100              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    6101                      .dwmtype  $C$DW$T$44
    6102              $C$DW$T$44      .dwtag  DW_TAG_typedef
    6103                      .dwattr $C$DW$T$44, DW_AT_name("PID_DATA")
    6104                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$41)
    6105                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6106                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x43)
    6107                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x07)
    6108              
    6109                      .dwendtag $C$DW$TU$44
    6110              
    6111              
    6112              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    6113                      .dwmtype  $C$DW$T$45
    6114              
    6115              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6116                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x28)
    6117              $C$DW$424       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$42)
    6119                      .dwattr $C$DW$424, DW_AT_name("term")
    6120                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6121                      .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6122                      .dwattr $C$DW$424, DW_AT_decl_line(0x46)
    6123                      .dwattr $C$DW$424, DW_AT_decl_column(0x21)
    6124              
    6125              $C$DW$425       .dwtag  DW_TAG_member
    6126                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$43)
    6127                      .dwattr $C$DW$425, DW_AT_name("param")
    6128                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6129                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6130                      .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6131                      .dwattr $C$DW$425, DW_AT_decl_line(0x47)
    6132                      .dwattr $C$DW$425, DW_AT_decl_column(0x16)
    6133              
    6134              $C$DW$426       .dwtag  DW_TAG_member
    6135                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$44)
    6136                      .dwattr $C$DW$426, DW_AT_name("data")
    6137                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6138                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6139                      .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6140                      .dwattr $C$DW$426, DW_AT_decl_line(0x48)
    6141                      .dwattr $C$DW$426, DW_AT_decl_column(0x11)
    6142              
    6143                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    6144                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x46)
    6145                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    6146                      .dwendtag $C$DW$T$45
    6147              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  118

    6148                      .dwendtag $C$DW$TU$45
    6149              
    6150              
    6151              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6152                      .dwmtype  $C$DW$T$102
    6153              $C$DW$T$102     .dwtag  DW_TAG_typedef
    6154                      .dwattr $C$DW$T$102, DW_AT_name("PID_CONTROLLER")
    6155                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$45)
    6156                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    6157                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x49)
    6158                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x07)
    6159              
    6160                      .dwendtag $C$DW$TU$102
    6161              
    6162              
    6163              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    6164                      .dwmtype  $C$DW$T$46
    6165              
    6166              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6167                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    6168              $C$DW$427       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
    6170                      .dwattr $C$DW$427, DW_AT_name("Ref")
    6171                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6172                      .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6173                      .dwattr $C$DW$427, DW_AT_decl_line(0x2a)
    6174                      .dwattr $C$DW$427, DW_AT_decl_column(0x1e)
    6175              
    6176              $C$DW$428       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$21)
    6178                      .dwattr $C$DW$428, DW_AT_name("Fbk")
    6179                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6180                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6181                      .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6182                      .dwattr $C$DW$428, DW_AT_decl_line(0x2b)
    6183                      .dwattr $C$DW$428, DW_AT_decl_column(0x12)
    6184              
    6185              $C$DW$429       .dwtag  DW_TAG_member
    6186                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$21)
    6187                      .dwattr $C$DW$429, DW_AT_name("Out")
    6188                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6189                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6190                      .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6191                      .dwattr $C$DW$429, DW_AT_decl_line(0x2c)
    6192                      .dwattr $C$DW$429, DW_AT_decl_column(0x12)
    6193              
    6194              $C$DW$430       .dwtag  DW_TAG_member
    6195                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    6196                      .dwattr $C$DW$430, DW_AT_name("Kp")
    6197                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6198                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6199                      .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6200                      .dwattr $C$DW$430, DW_AT_decl_line(0x2d)
    6201                      .dwattr $C$DW$430, DW_AT_decl_column(0x12)
    6202              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  119

    6203              $C$DW$431       .dwtag  DW_TAG_member
    6204                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$21)
    6205                      .dwattr $C$DW$431, DW_AT_name("Ki")
    6206                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6207                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6208                      .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6209                      .dwattr $C$DW$431, DW_AT_decl_line(0x2e)
    6210                      .dwattr $C$DW$431, DW_AT_decl_column(0x12)
    6211              
    6212              $C$DW$432       .dwtag  DW_TAG_member
    6213                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$21)
    6214                      .dwattr $C$DW$432, DW_AT_name("Umax")
    6215                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6216                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6217                      .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6218                      .dwattr $C$DW$432, DW_AT_decl_line(0x2f)
    6219                      .dwattr $C$DW$432, DW_AT_decl_column(0x12)
    6220              
    6221              $C$DW$433       .dwtag  DW_TAG_member
    6222                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$21)
    6223                      .dwattr $C$DW$433, DW_AT_name("Umin")
    6224                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6225                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6226                      .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6227                      .dwattr $C$DW$433, DW_AT_decl_line(0x30)
    6228                      .dwattr $C$DW$433, DW_AT_decl_column(0x12)
    6229              
    6230              $C$DW$434       .dwtag  DW_TAG_member
    6231                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    6232                      .dwattr $C$DW$434, DW_AT_name("up")
    6233                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6234                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6235                      .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6236                      .dwattr $C$DW$434, DW_AT_decl_line(0x31)
    6237                      .dwattr $C$DW$434, DW_AT_decl_column(0x12)
    6238              
    6239              $C$DW$435       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$21)
    6241                      .dwattr $C$DW$435, DW_AT_name("ui")
    6242                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6243                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6244                      .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6245                      .dwattr $C$DW$435, DW_AT_decl_line(0x32)
    6246                      .dwattr $C$DW$435, DW_AT_decl_column(0x12)
    6247              
    6248              $C$DW$436       .dwtag  DW_TAG_member
    6249                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    6250                      .dwattr $C$DW$436, DW_AT_name("v1")
    6251                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6252                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6253                      .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6254                      .dwattr $C$DW$436, DW_AT_decl_line(0x33)
    6255                      .dwattr $C$DW$436, DW_AT_decl_column(0x12)
    6256              
    6257              $C$DW$437       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:23:13 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_main_cpu.asm                                   PAGE  120

    6258                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    6259                      .dwattr $C$DW$437, DW_AT_name("i1")
    6260                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6261                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6262                      .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    6263                      .dwattr $C$DW$437, DW_AT_decl_line(0x34)
    6264                      .dwattr $C$DW$437, DW_AT_decl_column(0x12)
    6265              
    6266              $C$DW$438       .dwtag  DW_TAG_member
    6267                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$21)
