TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:45:01 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_cpu.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DLOG_2CH_F_FUNC")

    7141                      .dwmtype  $C$DW$T$121
    7142              $C$DW$T$121     .dwtag  DW_TAG_typedef
    7143                      .dwattr $C$DW$T$121, DW_AT_name("MotorRunStop_e")
    7144                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7145                      .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    7146                      .dwattr $C$DW$T$121, DW_AT_decl_line(0x4c)
    7147                      .dwattr $C$DW$T$121, DW_AT_decl_column(0x03)
    7148              
    7149                      .dwendtag $C$DW$TU$121
    7150              
    7151              
    7152              $C$DW$TU$122    .dwtag  DW_TAG_type_unit
    7153                      .dwmtype  $C$DW$T$122
    7154              
    7155              $C$DW$T$122     .dwtag  DW_TAG_enumeration_type
    7156                      .dwattr $C$DW$T$122, DW_AT_byte_size(0x01)
    7157              $C$DW$256       .dwtag  DW_TAG_enumerator
    7158                      .dwattr $C$DW$256, DW_AT_name("CTRL_STOP")
    7159                      .dwattr $C$DW$256, DW_AT_const_value(0x00)
    7160                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    7161                      .dwattr $C$DW$256, DW_AT_decl_line(0x64)
    7162                      .dwattr $C$DW$256, DW_AT_decl_column(0x05)
    7163              
    7164              $C$DW$257       .dwtag  DW_TAG_enumerator
    7165                      .dwattr $C$DW$257, DW_AT_name("CTRL_RUN")
    7166                      .dwattr $C$DW$257, DW_AT_const_value(0x01)
    7167                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    7168                      .dwattr $C$DW$257, DW_AT_decl_line(0x65)
    7169                      .dwattr $C$DW$257, DW_AT_decl_column(0x05)
    7170              
    7171              $C$DW$258       .dwtag  DW_TAG_enumerator
    7172                      .dwattr $C$DW$258, DW_AT_name("CTRL_BRAKE")
    7173                      .dwattr $C$DW$258, DW_AT_const_value(0x02)
    7174                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    7175                      .dwattr $C$DW$258, DW_AT_decl_line(0x66)
    7176                      .dwattr $C$DW$258, DW_AT_decl_column(0x05)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  156

    7177              
    7178              $C$DW$259       .dwtag  DW_TAG_enumerator
    7179                      .dwattr $C$DW$259, DW_AT_name("CTRL_RESET")
    7180                      .dwattr $C$DW$259, DW_AT_const_value(0x03)
    7181                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    7182                      .dwattr $C$DW$259, DW_AT_decl_line(0x67)
    7183                      .dwattr $C$DW$259, DW_AT_decl_column(0x05)
    7184              
    7185              $C$DW$260       .dwtag  DW_TAG_enumerator
    7186                      .dwattr $C$DW$260, DW_AT_name("CTRL_FAULT")
    7187                      .dwattr $C$DW$260, DW_AT_const_value(0x04)
    7188                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/sens
    7189                      .dwattr $C$DW$260, DW_AT_decl_line(0x68)
    7190                      .dwattr $C$DW$260, DW_AT_decl_column(0x05)
    7191              
    7192                      .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    7193                      .dwattr $C$DW$T$122, DW_AT_decl_line(0x63)
    7194                      .dwattr $C$DW$T$122, DW_AT_decl_column(0x01)
    7195                      .dwendtag $C$DW$T$122
    7196              
    7197                      .dwendtag $C$DW$TU$122
    7198              
    7199              
    7200              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    7201                      .dwmtype  $C$DW$T$123
    7202              $C$DW$T$123     .dwtag  DW_TAG_typedef
    7203                      .dwattr $C$DW$T$123, DW_AT_name("CtrlState_e")
    7204                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    7205                      .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/common/se
    7206                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x69)
    7207                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x03)
    7208              
    7209                      .dwendtag $C$DW$TU$123
    7210              
    7211              
    7212              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    7213                      .dwmtype  $C$DW$T$20
    7214              
    7215              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7216                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    7217              $C$DW$261       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    7219                      .dwattr $C$DW$261, DW_AT_name("Freq")
    7220                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    7221                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7222                      .dwattr $C$DW$261, DW_AT_decl_line(0x29)
    7223                      .dwattr $C$DW$261, DW_AT_decl_column(0x1d)
    7224              
    7225              $C$DW$262       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    7227                      .dwattr $C$DW$262, DW_AT_name("StepAngleMax")
    7228                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7229                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    7230                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7231                      .dwattr $C$DW$262, DW_AT_decl_line(0x2a)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  157

    7232                      .dwattr $C$DW$262, DW_AT_decl_column(0x11)
    7233              
    7234              $C$DW$263       .dwtag  DW_TAG_member
    7235                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    7236                      .dwattr $C$DW$263, DW_AT_name("Angle")
    7237                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7238                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    7239                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7240                      .dwattr $C$DW$263, DW_AT_decl_line(0x2b)
    7241                      .dwattr $C$DW$263, DW_AT_decl_column(0x11)
    7242              
    7243              $C$DW$264       .dwtag  DW_TAG_member
    7244                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    7245                      .dwattr $C$DW$264, DW_AT_name("Gain")
    7246                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7247                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    7248                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7249                      .dwattr $C$DW$264, DW_AT_decl_line(0x2c)
    7250                      .dwattr $C$DW$264, DW_AT_decl_column(0x11)
    7251              
    7252              $C$DW$265       .dwtag  DW_TAG_member
    7253                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    7254                      .dwattr $C$DW$265, DW_AT_name("Out")
    7255                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7256                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    7257                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7258                      .dwattr $C$DW$265, DW_AT_decl_line(0x2d)
    7259                      .dwattr $C$DW$265, DW_AT_decl_column(0x11)
    7260              
    7261              $C$DW$266       .dwtag  DW_TAG_member
    7262                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    7263                      .dwattr $C$DW$266, DW_AT_name("Offset")
    7264                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7265                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    7266                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7267                      .dwattr $C$DW$266, DW_AT_decl_line(0x2e)
    7268                      .dwattr $C$DW$266, DW_AT_decl_column(0x11)
    7269              
    7270                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7271                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x29)
    7272                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    7273                      .dwendtag $C$DW$T$20
    7274              
    7275                      .dwendtag $C$DW$TU$20
    7276              
    7277              
    7278              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    7279                      .dwmtype  $C$DW$T$94
    7280              $C$DW$T$94      .dwtag  DW_TAG_typedef
    7281                      .dwattr $C$DW$T$94, DW_AT_name("RAMPGEN")
    7282                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$20)
    7283                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7284                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x2f)
    7285                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0d)
    7286              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  158

    7287                      .dwendtag $C$DW$TU$94
    7288              
    7289              
    7290              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    7291                      .dwmtype  $C$DW$T$23
    7292              
    7293              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7294                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    7295              $C$DW$267       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    7297                      .dwattr $C$DW$267, DW_AT_name("TargetValue")
    7298                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    7299                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7300                      .dwattr $C$DW$267, DW_AT_decl_line(0x2b)
    7301                      .dwattr $C$DW$267, DW_AT_decl_column(0x0f)
    7302              
    7303              $C$DW$268       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    7305                      .dwattr $C$DW$268, DW_AT_name("RampDelayMax")
    7306                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7307                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    7308                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7309                      .dwattr $C$DW$268, DW_AT_decl_line(0x2c)
    7310                      .dwattr $C$DW$268, DW_AT_decl_column(0x0f)
    7311              
    7312              $C$DW$269       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    7314                      .dwattr $C$DW$269, DW_AT_name("RampLowLimit")
    7315                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7316                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    7317                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7318                      .dwattr $C$DW$269, DW_AT_decl_line(0x2d)
    7319                      .dwattr $C$DW$269, DW_AT_decl_column(0x0f)
    7320              
    7321              $C$DW$270       .dwtag  DW_TAG_member
    7322                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    7323                      .dwattr $C$DW$270, DW_AT_name("RampHighLimit")
    7324                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7325                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    7326                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7327                      .dwattr $C$DW$270, DW_AT_decl_line(0x2e)
    7328                      .dwattr $C$DW$270, DW_AT_decl_column(0x0f)
    7329              
    7330              $C$DW$271       .dwtag  DW_TAG_member
    7331                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$22)
    7332                      .dwattr $C$DW$271, DW_AT_name("RampDelayCount")
    7333                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7334                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    7335                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7336                      .dwattr $C$DW$271, DW_AT_decl_line(0x2f)
    7337                      .dwattr $C$DW$271, DW_AT_decl_column(0x0c)
    7338              
    7339              $C$DW$272       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    7341                      .dwattr $C$DW$272, DW_AT_name("SetpointValue")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  159

    7342                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7343                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    7344                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7345                      .dwattr $C$DW$272, DW_AT_decl_line(0x30)
    7346                      .dwattr $C$DW$272, DW_AT_decl_column(0x0c)
    7347              
    7348              $C$DW$273       .dwtag  DW_TAG_member
    7349                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$22)
    7350                      .dwattr $C$DW$273, DW_AT_name("EqualFlag")
    7351                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7352                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    7353                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7354                      .dwattr $C$DW$273, DW_AT_decl_line(0x31)
    7355                      .dwattr $C$DW$273, DW_AT_decl_column(0x0c)
    7356              
    7357              $C$DW$274       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    7359                      .dwattr $C$DW$274, DW_AT_name("Tmp")
    7360                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7361                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    7362                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7363                      .dwattr $C$DW$274, DW_AT_decl_line(0x32)
    7364                      .dwattr $C$DW$274, DW_AT_decl_column(0x0c)
    7365              
    7366                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7367                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x2a)
    7368                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    7369                      .dwendtag $C$DW$T$23
    7370              
    7371                      .dwendtag $C$DW$TU$23
    7372              
    7373              
    7374              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    7375                      .dwmtype  $C$DW$T$95
    7376              $C$DW$T$95      .dwtag  DW_TAG_typedef
    7377                      .dwattr $C$DW$T$95, DW_AT_name("RMPCNTL")
    7378                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$23)
    7379                      .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7380                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x33)
    7381                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    7382              
    7383                      .dwendtag $C$DW$TU$95
    7384              
    7385              
    7386              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    7387                      .dwmtype  $C$DW$T$26
    7388              
    7389              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7390                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    7391              $C$DW$275       .dwtag  DW_TAG_member
    7392                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    7393                      .dwattr $C$DW$275, DW_AT_name("ElecTheta")
    7394                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    7395                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7396                      .dwattr $C$DW$275, DW_AT_decl_line(0x2b)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  160

    7397                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    7398              
    7399              $C$DW$276       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$22)
    7401                      .dwattr $C$DW$276, DW_AT_name("DirectionQep")
    7402                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7403                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    7404                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7405                      .dwattr $C$DW$276, DW_AT_decl_line(0x2c)
    7406                      .dwattr $C$DW$276, DW_AT_decl_column(0x11)
    7407              
    7408              $C$DW$277       .dwtag  DW_TAG_member
    7409                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    7410                      .dwattr $C$DW$277, DW_AT_name("OldElecTheta")
    7411                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7412                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    7413                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7414                      .dwattr $C$DW$277, DW_AT_decl_line(0x2d)
    7415                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    7416              
    7417              $C$DW$278       .dwtag  DW_TAG_member
    7418                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    7419                      .dwattr $C$DW$278, DW_AT_name("Speed")
    7420                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7421                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    7422                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7423                      .dwattr $C$DW$278, DW_AT_decl_line(0x2e)
    7424                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    7425              
    7426              $C$DW$279       .dwtag  DW_TAG_member
    7427                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$22)
    7428                      .dwattr $C$DW$279, DW_AT_name("BaseRpm")
    7429                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7430                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    7431                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7432                      .dwattr $C$DW$279, DW_AT_decl_line(0x2f)
    7433                      .dwattr $C$DW$279, DW_AT_decl_column(0x11)
    7434              
    7435              $C$DW$280       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    7437                      .dwattr $C$DW$280, DW_AT_name("K1")
    7438                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7439                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    7440                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7441                      .dwattr $C$DW$280, DW_AT_decl_line(0x30)
    7442                      .dwattr $C$DW$280, DW_AT_decl_column(0x12)
    7443              
    7444              $C$DW$281       .dwtag  DW_TAG_member
    7445                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    7446                      .dwattr $C$DW$281, DW_AT_name("K2")
    7447                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7448                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    7449                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7450                      .dwattr $C$DW$281, DW_AT_decl_line(0x31)
    7451                      .dwattr $C$DW$281, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  161

    7452              
    7453              $C$DW$282       .dwtag  DW_TAG_member
    7454                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    7455                      .dwattr $C$DW$282, DW_AT_name("K3")
    7456                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7457                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    7458                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7459                      .dwattr $C$DW$282, DW_AT_decl_line(0x32)
    7460                      .dwattr $C$DW$282, DW_AT_decl_column(0x12)
    7461              
    7462              $C$DW$283       .dwtag  DW_TAG_member
    7463                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$25)
    7464                      .dwattr $C$DW$283, DW_AT_name("SpeedRpm")
    7465                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7466                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    7467                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7468                      .dwattr $C$DW$283, DW_AT_decl_line(0x33)
    7469                      .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    7470              
    7471              $C$DW$284       .dwtag  DW_TAG_member
    7472                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    7473                      .dwattr $C$DW$284, DW_AT_name("Tmp")
    7474                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7475                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    7476                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7477                      .dwattr $C$DW$284, DW_AT_decl_line(0x34)
    7478                      .dwattr $C$DW$284, DW_AT_decl_column(0x12)
    7479              
    7480                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7481                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    7482                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    7483                      .dwendtag $C$DW$T$26
    7484              
    7485                      .dwendtag $C$DW$TU$26
    7486              
    7487              
    7488              $C$DW$TU$100    .dwtag  DW_TAG_type_unit
    7489                      .dwmtype  $C$DW$T$100
    7490              $C$DW$T$100     .dwtag  DW_TAG_typedef
    7491                      .dwattr $C$DW$T$100, DW_AT_name("SPEED_MEAS_QEP")
    7492                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$26)
    7493                      .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    7494                      .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
    7495                      .dwattr $C$DW$T$100, DW_AT_decl_column(0x0a)
    7496              
    7497                      .dwendtag $C$DW$TU$100
    7498              
    7499              
    7500              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    7501                      .dwmtype  $C$DW$T$27
    7502              
    7503              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7504                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    7505              $C$DW$285       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  162

    7507                      .dwattr $C$DW$285, DW_AT_name("Ref")
    7508                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    7509                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7510                      .dwattr $C$DW$285, DW_AT_decl_line(0x2a)
    7511                      .dwattr $C$DW$285, DW_AT_decl_column(0x1e)
    7512              
    7513              $C$DW$286       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    7515                      .dwattr $C$DW$286, DW_AT_name("Fbk")
    7516                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7517                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    7518                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7519                      .dwattr $C$DW$286, DW_AT_decl_line(0x2b)
    7520                      .dwattr $C$DW$286, DW_AT_decl_column(0x12)
    7521              
    7522              $C$DW$287       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    7524                      .dwattr $C$DW$287, DW_AT_name("Out")
    7525                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7526                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    7527                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7528                      .dwattr $C$DW$287, DW_AT_decl_line(0x2c)
    7529                      .dwattr $C$DW$287, DW_AT_decl_column(0x12)
    7530              
    7531              $C$DW$288       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    7533                      .dwattr $C$DW$288, DW_AT_name("c1")
    7534                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7535                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    7536                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7537                      .dwattr $C$DW$288, DW_AT_decl_line(0x2d)
    7538                      .dwattr $C$DW$288, DW_AT_decl_column(0x12)
    7539              
    7540              $C$DW$289       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    7542                      .dwattr $C$DW$289, DW_AT_name("c2")
    7543                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7544                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    7545                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7546                      .dwattr $C$DW$289, DW_AT_decl_line(0x2e)
    7547                      .dwattr $C$DW$289, DW_AT_decl_column(0x12)
    7548              
    7549                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7550                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a)
    7551                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    7552                      .dwendtag $C$DW$T$27
    7553              
    7554                      .dwendtag $C$DW$TU$27
    7555              
    7556              
    7557              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    7558                      .dwmtype  $C$DW$T$30
    7559              $C$DW$T$30      .dwtag  DW_TAG_typedef
    7560                      .dwattr $C$DW$T$30, DW_AT_name("PID_TERMINALS")
    7561                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  163

    7562                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7563                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2f)
    7564                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x07)
    7565              
    7566                      .dwendtag $C$DW$TU$30
    7567              
    7568              
    7569              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    7570                      .dwmtype  $C$DW$T$28
    7571              
    7572              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7573                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    7574              $C$DW$290       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    7576                      .dwattr $C$DW$290, DW_AT_name("Kr")
    7577                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    7578                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7579                      .dwattr $C$DW$290, DW_AT_decl_line(0x32)
    7580                      .dwattr $C$DW$290, DW_AT_decl_column(0x1e)
    7581              
    7582              $C$DW$291       .dwtag  DW_TAG_member
    7583                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    7584                      .dwattr $C$DW$291, DW_AT_name("Kp")
    7585                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7586                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    7587                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7588                      .dwattr $C$DW$291, DW_AT_decl_line(0x33)
    7589                      .dwattr $C$DW$291, DW_AT_decl_column(0x12)
    7590              
    7591              $C$DW$292       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    7593                      .dwattr $C$DW$292, DW_AT_name("Ki")
    7594                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7595                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    7596                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7597                      .dwattr $C$DW$292, DW_AT_decl_line(0x34)
    7598                      .dwattr $C$DW$292, DW_AT_decl_column(0x12)
    7599              
    7600              $C$DW$293       .dwtag  DW_TAG_member
    7601                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    7602                      .dwattr $C$DW$293, DW_AT_name("Kd")
    7603                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7604                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    7605                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7606                      .dwattr $C$DW$293, DW_AT_decl_line(0x35)
    7607                      .dwattr $C$DW$293, DW_AT_decl_column(0x12)
    7608              
    7609              $C$DW$294       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    7611                      .dwattr $C$DW$294, DW_AT_name("Km")
    7612                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7613                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    7614                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7615                      .dwattr $C$DW$294, DW_AT_decl_line(0x36)
    7616                      .dwattr $C$DW$294, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  164

    7617              
    7618              $C$DW$295       .dwtag  DW_TAG_member
    7619                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    7620                      .dwattr $C$DW$295, DW_AT_name("Umax")
    7621                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7622                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    7623                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7624                      .dwattr $C$DW$295, DW_AT_decl_line(0x37)
    7625                      .dwattr $C$DW$295, DW_AT_decl_column(0x12)
    7626              
    7627              $C$DW$296       .dwtag  DW_TAG_member
    7628                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    7629                      .dwattr $C$DW$296, DW_AT_name("Umin")
    7630                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7631                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    7632                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7633                      .dwattr $C$DW$296, DW_AT_decl_line(0x38)
    7634                      .dwattr $C$DW$296, DW_AT_decl_column(0x12)
    7635              
    7636                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7637                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x32)
    7638                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    7639                      .dwendtag $C$DW$T$28
    7640              
    7641                      .dwendtag $C$DW$TU$28
    7642              
    7643              
    7644              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    7645                      .dwmtype  $C$DW$T$31
    7646              $C$DW$T$31      .dwtag  DW_TAG_typedef
    7647                      .dwattr $C$DW$T$31, DW_AT_name("PID_PARAMETERS")
    7648                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    7649                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7650                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x39)
    7651                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x07)
    7652              
    7653                      .dwendtag $C$DW$TU$31
    7654              
    7655              
    7656              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    7657                      .dwmtype  $C$DW$T$29
    7658              
    7659              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7660                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    7661              $C$DW$297       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    7663                      .dwattr $C$DW$297, DW_AT_name("up")
    7664                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    7665                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7666                      .dwattr $C$DW$297, DW_AT_decl_line(0x3b)
    7667                      .dwattr $C$DW$297, DW_AT_decl_column(0x1e)
    7668              
    7669              $C$DW$298       .dwtag  DW_TAG_member
    7670                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    7671                      .dwattr $C$DW$298, DW_AT_name("ui")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  165

    7672                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7673                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    7674                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7675                      .dwattr $C$DW$298, DW_AT_decl_line(0x3c)
    7676                      .dwattr $C$DW$298, DW_AT_decl_column(0x12)
    7677              
    7678              $C$DW$299       .dwtag  DW_TAG_member
    7679                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    7680                      .dwattr $C$DW$299, DW_AT_name("ud")
    7681                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7682                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    7683                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7684                      .dwattr $C$DW$299, DW_AT_decl_line(0x3d)
    7685                      .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    7686              
    7687              $C$DW$300       .dwtag  DW_TAG_member
    7688                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    7689                      .dwattr $C$DW$300, DW_AT_name("v1")
    7690                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7691                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    7692                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7693                      .dwattr $C$DW$300, DW_AT_decl_line(0x3e)
    7694                      .dwattr $C$DW$300, DW_AT_decl_column(0x12)
    7695              
    7696              $C$DW$301       .dwtag  DW_TAG_member
    7697                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    7698                      .dwattr $C$DW$301, DW_AT_name("i1")
    7699                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7700                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    7701                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7702                      .dwattr $C$DW$301, DW_AT_decl_line(0x3f)
    7703                      .dwattr $C$DW$301, DW_AT_decl_column(0x12)
    7704              
    7705              $C$DW$302       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    7707                      .dwattr $C$DW$302, DW_AT_name("d1")
    7708                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7709                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    7710                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7711                      .dwattr $C$DW$302, DW_AT_decl_line(0x40)
    7712                      .dwattr $C$DW$302, DW_AT_decl_column(0x12)
    7713              
    7714              $C$DW$303       .dwtag  DW_TAG_member
    7715                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    7716                      .dwattr $C$DW$303, DW_AT_name("d2")
    7717                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7718                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    7719                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7720                      .dwattr $C$DW$303, DW_AT_decl_line(0x41)
    7721                      .dwattr $C$DW$303, DW_AT_decl_column(0x12)
    7722              
    7723              $C$DW$304       .dwtag  DW_TAG_member
    7724                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    7725                      .dwattr $C$DW$304, DW_AT_name("w1")
    7726                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  166

    7727                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    7728                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7729                      .dwattr $C$DW$304, DW_AT_decl_line(0x42)
    7730                      .dwattr $C$DW$304, DW_AT_decl_column(0x12)
    7731              
    7732                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7733                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x3b)
    7734                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    7735                      .dwendtag $C$DW$T$29
    7736              
    7737                      .dwendtag $C$DW$TU$29
    7738              
    7739              
    7740              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    7741                      .dwmtype  $C$DW$T$32
    7742              $C$DW$T$32      .dwtag  DW_TAG_typedef
    7743                      .dwattr $C$DW$T$32, DW_AT_name("PID_DATA")
    7744                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
    7745                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7746                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x43)
    7747                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x07)
    7748              
    7749                      .dwendtag $C$DW$TU$32
    7750              
    7751              
    7752              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    7753                      .dwmtype  $C$DW$T$33
    7754              
    7755              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7756                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x28)
    7757              $C$DW$305       .dwtag  DW_TAG_member
    7758                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$30)
    7759                      .dwattr $C$DW$305, DW_AT_name("term")
    7760                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    7761                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7762                      .dwattr $C$DW$305, DW_AT_decl_line(0x46)
    7763                      .dwattr $C$DW$305, DW_AT_decl_column(0x21)
    7764              
    7765              $C$DW$306       .dwtag  DW_TAG_member
    7766                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$31)
    7767                      .dwattr $C$DW$306, DW_AT_name("param")
    7768                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7769                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    7770                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7771                      .dwattr $C$DW$306, DW_AT_decl_line(0x47)
    7772                      .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    7773              
    7774              $C$DW$307       .dwtag  DW_TAG_member
    7775                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$32)
    7776                      .dwattr $C$DW$307, DW_AT_name("data")
    7777                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7778                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    7779                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7780                      .dwattr $C$DW$307, DW_AT_decl_line(0x48)
    7781                      .dwattr $C$DW$307, DW_AT_decl_column(0x11)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  167

    7782              
    7783                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7784                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x46)
    7785                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    7786                      .dwendtag $C$DW$T$33
    7787              
    7788                      .dwendtag $C$DW$TU$33
    7789              
    7790              
    7791              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    7792                      .dwmtype  $C$DW$T$102
    7793              $C$DW$T$102     .dwtag  DW_TAG_typedef
    7794                      .dwattr $C$DW$T$102, DW_AT_name("PID_CONTROLLER")
    7795                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$33)
    7796                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    7797                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x49)
    7798                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x07)
    7799              
    7800                      .dwendtag $C$DW$TU$102
    7801              
    7802              
    7803              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    7804                      .dwmtype  $C$DW$T$34
    7805              
    7806              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7807                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    7808              $C$DW$308       .dwtag  DW_TAG_member
    7809                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$12)
    7810                      .dwattr $C$DW$308, DW_AT_name("quot")
    7811                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    7812                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    7813                      .dwattr $C$DW$308, DW_AT_decl_line(0x59)
    7814                      .dwattr $C$DW$308, DW_AT_decl_column(0x17)
    7815              
    7816              $C$DW$309       .dwtag  DW_TAG_member
    7817                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$12)
    7818                      .dwattr $C$DW$309, DW_AT_name("rem")
    7819                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7820                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    7821                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    7822                      .dwattr $C$DW$309, DW_AT_decl_line(0x59)
    7823                      .dwattr $C$DW$309, DW_AT_decl_column(0x1d)
    7824              
    7825                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    7826                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x59)
    7827                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    7828                      .dwendtag $C$DW$T$34
    7829              
    7830                      .dwendtag $C$DW$TU$34
    7831              
    7832              
    7833              $C$DW$TU$131    .dwtag  DW_TAG_type_unit
    7834                      .dwmtype  $C$DW$T$131
    7835              $C$DW$T$131     .dwtag  DW_TAG_typedef
    7836                      .dwattr $C$DW$T$131, DW_AT_name("ldiv_t")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  168

    7837                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$34)
    7838                      .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    7839                      .dwattr $C$DW$T$131, DW_AT_decl_line(0x59)
    7840                      .dwattr $C$DW$T$131, DW_AT_decl_column(0x24)
    7841              
    7842                      .dwendtag $C$DW$TU$131
    7843              
    7844              
    7845              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    7846                      .dwmtype  $C$DW$T$35
    7847              
    7848              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7849                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    7850              $C$DW$310       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$14)
    7852                      .dwattr $C$DW$310, DW_AT_name("quot")
    7853                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    7854                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    7855                      .dwattr $C$DW$310, DW_AT_decl_line(0x63)
    7856                      .dwattr $C$DW$310, DW_AT_decl_column(0x1c)
    7857              
    7858              $C$DW$311       .dwtag  DW_TAG_member
    7859                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$14)
    7860                      .dwattr $C$DW$311, DW_AT_name("rem")
    7861                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7862                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7863                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    7864                      .dwattr $C$DW$311, DW_AT_decl_line(0x63)
    7865                      .dwattr $C$DW$311, DW_AT_decl_column(0x22)
    7866              
    7867                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    7868                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x63)
    7869                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    7870                      .dwendtag $C$DW$T$35
    7871              
    7872                      .dwendtag $C$DW$TU$35
    7873              
    7874              
    7875              $C$DW$TU$134    .dwtag  DW_TAG_type_unit
    7876                      .dwmtype  $C$DW$T$134
    7877              $C$DW$T$134     .dwtag  DW_TAG_typedef
    7878                      .dwattr $C$DW$T$134, DW_AT_name("lldiv_t")
    7879                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$35)
    7880                      .dwattr $C$DW$T$134, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    7881                      .dwattr $C$DW$T$134, DW_AT_decl_line(0x63)
    7882                      .dwattr $C$DW$T$134, DW_AT_decl_column(0x29)
    7883              
    7884                      .dwendtag $C$DW$TU$134
    7885              
    7886              
    7887              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    7888                      .dwmtype  $C$DW$T$36
    7889              
    7890              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7891                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  169

    7892              $C$DW$312       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    7894                      .dwattr $C$DW$312, DW_AT_name("As")
    7895                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    7896                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7897                      .dwattr $C$DW$312, DW_AT_decl_line(0x2a)
    7898                      .dwattr $C$DW$312, DW_AT_decl_column(0x1e)
    7899              
    7900              $C$DW$313       .dwtag  DW_TAG_member
    7901                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    7902                      .dwattr $C$DW$313, DW_AT_name("Bs")
    7903                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7904                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    7905                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7906                      .dwattr $C$DW$313, DW_AT_decl_line(0x2b)
    7907                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    7908              
    7909              $C$DW$314       .dwtag  DW_TAG_member
    7910                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    7911                      .dwattr $C$DW$314, DW_AT_name("Cs")
    7912                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7913                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    7914                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7915                      .dwattr $C$DW$314, DW_AT_decl_line(0x2c)
    7916                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    7917              
    7918              $C$DW$315       .dwtag  DW_TAG_member
    7919                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    7920                      .dwattr $C$DW$315, DW_AT_name("Alpha")
    7921                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7922                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    7923                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7924                      .dwattr $C$DW$315, DW_AT_decl_line(0x2d)
    7925                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    7926              
    7927              $C$DW$316       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    7929                      .dwattr $C$DW$316, DW_AT_name("Beta")
    7930                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7931                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7932                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7933                      .dwattr $C$DW$316, DW_AT_decl_line(0x2e)
    7934                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    7935              
    7936                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7937                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x2a)
    7938                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    7939                      .dwendtag $C$DW$T$36
    7940              
    7941                      .dwendtag $C$DW$TU$36
    7942              
    7943              
    7944              $C$DW$TU$96     .dwtag  DW_TAG_type_unit
    7945                      .dwmtype  $C$DW$T$96
    7946              $C$DW$T$96      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  170

    7947                      .dwattr $C$DW$T$96, DW_AT_name("CLARKE")
    7948                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$36)
    7949                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    7950                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x2f)
    7951                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x09)
    7952              
    7953                      .dwendtag $C$DW$TU$96
    7954              
    7955              
    7956              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    7957                      .dwmtype  $C$DW$T$37
    7958              
    7959              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7960                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0e)
    7961              $C$DW$317       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    7963                      .dwattr $C$DW$317, DW_AT_name("Alpha")
    7964                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7965                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7966                      .dwattr $C$DW$317, DW_AT_decl_line(0x29)
    7967                      .dwattr $C$DW$317, DW_AT_decl_column(0x1e)
    7968              
    7969              $C$DW$318       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    7971                      .dwattr $C$DW$318, DW_AT_name("Beta")
    7972                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7973                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7974                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7975                      .dwattr $C$DW$318, DW_AT_decl_line(0x2a)
    7976                      .dwattr $C$DW$318, DW_AT_decl_column(0x12)
    7977              
    7978              $C$DW$319       .dwtag  DW_TAG_member
    7979                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    7980                      .dwattr $C$DW$319, DW_AT_name("Angle")
    7981                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7982                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7983                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7984                      .dwattr $C$DW$319, DW_AT_decl_line(0x2b)
    7985                      .dwattr $C$DW$319, DW_AT_decl_column(0x12)
    7986              
    7987              $C$DW$320       .dwtag  DW_TAG_member
    7988                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    7989                      .dwattr $C$DW$320, DW_AT_name("Ds")
    7990                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7991                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7992                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    7993                      .dwattr $C$DW$320, DW_AT_decl_line(0x2c)
    7994                      .dwattr $C$DW$320, DW_AT_decl_column(0x12)
    7995              
    7996              $C$DW$321       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    7998                      .dwattr $C$DW$321, DW_AT_name("Qs")
    7999                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8000                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    8001                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  171

    8002                      .dwattr $C$DW$321, DW_AT_decl_line(0x2d)
    8003                      .dwattr $C$DW$321, DW_AT_decl_column(0x12)
    8004              
    8005              $C$DW$322       .dwtag  DW_TAG_member
    8006                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    8007                      .dwattr $C$DW$322, DW_AT_name("Sine")
    8008                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8009                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    8010                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8011                      .dwattr $C$DW$322, DW_AT_decl_line(0x2e)
    8012                      .dwattr $C$DW$322, DW_AT_decl_column(0x12)
    8013              
    8014              $C$DW$323       .dwtag  DW_TAG_member
    8015                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    8016                      .dwattr $C$DW$323, DW_AT_name("Cosine")
    8017                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8018                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    8019                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8020                      .dwattr $C$DW$323, DW_AT_decl_line(0x2f)
    8021                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    8022              
    8023                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8024                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x29)
    8025                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    8026                      .dwendtag $C$DW$T$37
    8027              
    8028                      .dwendtag $C$DW$TU$37
    8029              
    8030              
    8031              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    8032                      .dwmtype  $C$DW$T$97
    8033              $C$DW$T$97      .dwtag  DW_TAG_typedef
    8034                      .dwattr $C$DW$T$97, DW_AT_name("PARK")
    8035                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$37)
    8036                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8037                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x30)
    8038                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x09)
    8039              
    8040                      .dwendtag $C$DW$TU$97
    8041              
    8042              
    8043              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    8044                      .dwmtype  $C$DW$T$38
    8045              
    8046              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8047                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0e)
    8048              $C$DW$324       .dwtag  DW_TAG_member
    8049                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    8050                      .dwattr $C$DW$324, DW_AT_name("Alpha")
    8051                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    8052                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8053                      .dwattr $C$DW$324, DW_AT_decl_line(0x29)
    8054                      .dwattr $C$DW$324, DW_AT_decl_column(0x1e)
    8055              
    8056              $C$DW$325       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  172

    8057                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    8058                      .dwattr $C$DW$325, DW_AT_name("Beta")
    8059                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8060                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    8061                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8062                      .dwattr $C$DW$325, DW_AT_decl_line(0x2a)
    8063                      .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    8064              
    8065              $C$DW$326       .dwtag  DW_TAG_member
    8066                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    8067                      .dwattr $C$DW$326, DW_AT_name("Angle")
    8068                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8069                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    8070                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8071                      .dwattr $C$DW$326, DW_AT_decl_line(0x2b)
    8072                      .dwattr $C$DW$326, DW_AT_decl_column(0x12)
    8073              
    8074              $C$DW$327       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    8076                      .dwattr $C$DW$327, DW_AT_name("Ds")
    8077                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8078                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    8079                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8080                      .dwattr $C$DW$327, DW_AT_decl_line(0x2c)
    8081                      .dwattr $C$DW$327, DW_AT_decl_column(0x12)
    8082              
    8083              $C$DW$328       .dwtag  DW_TAG_member
    8084                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    8085                      .dwattr $C$DW$328, DW_AT_name("Qs")
    8086                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8087                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    8088                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8089                      .dwattr $C$DW$328, DW_AT_decl_line(0x2d)
    8090                      .dwattr $C$DW$328, DW_AT_decl_column(0x12)
    8091              
    8092              $C$DW$329       .dwtag  DW_TAG_member
    8093                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    8094                      .dwattr $C$DW$329, DW_AT_name("Sine")
    8095                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8096                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    8097                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8098                      .dwattr $C$DW$329, DW_AT_decl_line(0x2e)
    8099                      .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    8100              
    8101              $C$DW$330       .dwtag  DW_TAG_member
    8102                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    8103                      .dwattr $C$DW$330, DW_AT_name("Cosine")
    8104                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8105                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    8106                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8107                      .dwattr $C$DW$330, DW_AT_decl_line(0x2f)
    8108                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    8109              
    8110                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8111                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  173

    8112                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    8113                      .dwendtag $C$DW$T$38
    8114              
    8115                      .dwendtag $C$DW$TU$38
    8116              
    8117              
    8118              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    8119                      .dwmtype  $C$DW$T$98
    8120              $C$DW$T$98      .dwtag  DW_TAG_typedef
    8121                      .dwattr $C$DW$T$98, DW_AT_name("IPARK")
    8122                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$38)
    8123                      .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8124                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x30)
    8125                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x0b)
    8126              
    8127                      .dwendtag $C$DW$TU$98
    8128              
    8129              
    8130              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    8131                      .dwmtype  $C$DW$T$41
    8132              
    8133              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8134                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    8135              $C$DW$331       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    8137                      .dwattr $C$DW$331, DW_AT_name("Ualpha")
    8138                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    8139                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8140                      .dwattr $C$DW$331, DW_AT_decl_line(0x2b)
    8141                      .dwattr $C$DW$331, DW_AT_decl_column(0x10)
    8142              
    8143              $C$DW$332       .dwtag  DW_TAG_member
    8144                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    8145                      .dwattr $C$DW$332, DW_AT_name("Ubeta")
    8146                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8147                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    8148                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8149                      .dwattr $C$DW$332, DW_AT_decl_line(0x2c)
    8150                      .dwattr $C$DW$332, DW_AT_decl_column(0x10)
    8151              
    8152              $C$DW$333       .dwtag  DW_TAG_member
    8153                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    8154                      .dwattr $C$DW$333, DW_AT_name("Ta")
    8155                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8156                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    8157                      .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8158                      .dwattr $C$DW$333, DW_AT_decl_line(0x2d)
    8159                      .dwattr $C$DW$333, DW_AT_decl_column(0x10)
    8160              
    8161              $C$DW$334       .dwtag  DW_TAG_member
    8162                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    8163                      .dwattr $C$DW$334, DW_AT_name("Tb")
    8164                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8165                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    8166                      .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  174

    8167                      .dwattr $C$DW$334, DW_AT_decl_line(0x2e)
    8168                      .dwattr $C$DW$334, DW_AT_decl_column(0x10)
    8169              
    8170              $C$DW$335       .dwtag  DW_TAG_member
    8171                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    8172                      .dwattr $C$DW$335, DW_AT_name("Tc")
    8173                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8174                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    8175                      .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8176                      .dwattr $C$DW$335, DW_AT_decl_line(0x2f)
    8177                      .dwattr $C$DW$335, DW_AT_decl_column(0x10)
    8178              
    8179              $C$DW$336       .dwtag  DW_TAG_member
    8180                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    8181                      .dwattr $C$DW$336, DW_AT_name("tmp1")
    8182                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8183                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    8184                      .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8185                      .dwattr $C$DW$336, DW_AT_decl_line(0x30)
    8186                      .dwattr $C$DW$336, DW_AT_decl_column(0x10)
    8187              
    8188              $C$DW$337       .dwtag  DW_TAG_member
    8189                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    8190                      .dwattr $C$DW$337, DW_AT_name("tmp2")
    8191                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8192                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    8193                      .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8194                      .dwattr $C$DW$337, DW_AT_decl_line(0x31)
    8195                      .dwattr $C$DW$337, DW_AT_decl_column(0x10)
    8196              
    8197              $C$DW$338       .dwtag  DW_TAG_member
    8198                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    8199                      .dwattr $C$DW$338, DW_AT_name("tmp3")
    8200                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8201                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    8202                      .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8203                      .dwattr $C$DW$338, DW_AT_decl_line(0x32)
    8204                      .dwattr $C$DW$338, DW_AT_decl_column(0x10)
    8205              
    8206              $C$DW$339       .dwtag  DW_TAG_member
    8207                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$40)
    8208                      .dwattr $C$DW$339, DW_AT_name("VecSector")
    8209                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8210                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    8211                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8212                      .dwattr $C$DW$339, DW_AT_decl_line(0x33)
    8213                      .dwattr $C$DW$339, DW_AT_decl_column(0x0b)
    8214              
    8215                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8216                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x2a)
    8217                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x11)
    8218                      .dwendtag $C$DW$T$41
    8219              
    8220                      .dwendtag $C$DW$TU$41
    8221              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  175

    8222              
    8223              $C$DW$TU$99     .dwtag  DW_TAG_type_unit
    8224                      .dwmtype  $C$DW$T$99
    8225              $C$DW$T$99      .dwtag  DW_TAG_typedef
    8226                      .dwattr $C$DW$T$99, DW_AT_name("SVGEN")
    8227                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$41)
    8228                      .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8229                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x34)
    8230                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x04)
    8231              
    8232                      .dwendtag $C$DW$TU$99
    8233              
    8234              
    8235              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    8236                      .dwmtype  $C$DW$T$42
    8237              
    8238              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8239                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    8240              $C$DW$340       .dwtag  DW_TAG_member
    8241                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    8242                      .dwattr $C$DW$340, DW_AT_name("Ref")
    8243                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    8244                      .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8245                      .dwattr $C$DW$340, DW_AT_decl_line(0x2a)
    8246                      .dwattr $C$DW$340, DW_AT_decl_column(0x1e)
    8247              
    8248              $C$DW$341       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    8250                      .dwattr $C$DW$341, DW_AT_name("Fbk")
    8251                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8252                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    8253                      .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8254                      .dwattr $C$DW$341, DW_AT_decl_line(0x2b)
    8255                      .dwattr $C$DW$341, DW_AT_decl_column(0x12)
    8256              
    8257              $C$DW$342       .dwtag  DW_TAG_member
    8258                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    8259                      .dwattr $C$DW$342, DW_AT_name("Out")
    8260                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8261                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    8262                      .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8263                      .dwattr $C$DW$342, DW_AT_decl_line(0x2c)
    8264                      .dwattr $C$DW$342, DW_AT_decl_column(0x12)
    8265              
    8266              $C$DW$343       .dwtag  DW_TAG_member
    8267                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    8268                      .dwattr $C$DW$343, DW_AT_name("Kp")
    8269                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8270                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    8271                      .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8272                      .dwattr $C$DW$343, DW_AT_decl_line(0x2d)
    8273                      .dwattr $C$DW$343, DW_AT_decl_column(0x12)
    8274              
    8275              $C$DW$344       .dwtag  DW_TAG_member
    8276                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  176

    8277                      .dwattr $C$DW$344, DW_AT_name("Ki")
    8278                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8279                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    8280                      .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8281                      .dwattr $C$DW$344, DW_AT_decl_line(0x2e)
    8282                      .dwattr $C$DW$344, DW_AT_decl_column(0x12)
    8283              
    8284              $C$DW$345       .dwtag  DW_TAG_member
    8285                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    8286                      .dwattr $C$DW$345, DW_AT_name("Umax")
    8287                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8288                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    8289                      .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8290                      .dwattr $C$DW$345, DW_AT_decl_line(0x2f)
    8291                      .dwattr $C$DW$345, DW_AT_decl_column(0x12)
    8292              
    8293              $C$DW$346       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    8295                      .dwattr $C$DW$346, DW_AT_name("Umin")
    8296                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8297                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    8298                      .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8299                      .dwattr $C$DW$346, DW_AT_decl_line(0x30)
    8300                      .dwattr $C$DW$346, DW_AT_decl_column(0x12)
    8301              
    8302              $C$DW$347       .dwtag  DW_TAG_member
    8303                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    8304                      .dwattr $C$DW$347, DW_AT_name("up")
    8305                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8306                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    8307                      .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8308                      .dwattr $C$DW$347, DW_AT_decl_line(0x31)
    8309                      .dwattr $C$DW$347, DW_AT_decl_column(0x12)
    8310              
    8311              $C$DW$348       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    8313                      .dwattr $C$DW$348, DW_AT_name("ui")
    8314                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8315                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    8316                      .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8317                      .dwattr $C$DW$348, DW_AT_decl_line(0x32)
    8318                      .dwattr $C$DW$348, DW_AT_decl_column(0x12)
    8319              
    8320              $C$DW$349       .dwtag  DW_TAG_member
    8321                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    8322                      .dwattr $C$DW$349, DW_AT_name("v1")
    8323                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8324                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    8325                      .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8326                      .dwattr $C$DW$349, DW_AT_decl_line(0x33)
    8327                      .dwattr $C$DW$349, DW_AT_decl_column(0x12)
    8328              
    8329              $C$DW$350       .dwtag  DW_TAG_member
    8330                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    8331                      .dwattr $C$DW$350, DW_AT_name("i1")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  177

    8332                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8333                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    8334                      .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8335                      .dwattr $C$DW$350, DW_AT_decl_line(0x34)
    8336                      .dwattr $C$DW$350, DW_AT_decl_column(0x12)
    8337              
    8338              $C$DW$351       .dwtag  DW_TAG_member
    8339                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    8340                      .dwattr $C$DW$351, DW_AT_name("w1")
    8341                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8342                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    8343                      .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    8344                      .dwattr $C$DW$351, DW_AT_decl_line(0x35)
    8345                      .dwattr $C$DW$351, DW_AT_decl_column(0x12)
    8346              
    8347                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    8348                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    8349                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    8350                      .dwendtag $C$DW$T$42
    8351              
    8352                      .dwendtag $C$DW$TU$42
    8353              
    8354              
    8355              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    8356                      .dwmtype  $C$DW$T$103
    8357              $C$DW$T$103     .dwtag  DW_TAG_typedef
    8358                      .dwattr $C$DW$T$103, DW_AT_name("PI_CONTROLLER")
    8359                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$42)
    8360                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities
    8361                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x36)
    8362                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x07)
    8363              
    8364                      .dwendtag $C$DW$TU$103
    8365              
    8366              
    8367              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    8368                      .dwmtype  $C$DW$T$46
    8369              
    8370              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8371                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    8372              $C$DW$352       .dwtag  DW_TAG_member
    8373                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$43)
    8374                      .dwattr $C$DW$352, DW_AT_name("input_ptr1")
    8375                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    8376                      .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8377                      .dwattr $C$DW$352, DW_AT_decl_line(0x32)
    8378                      .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    8379              
    8380              $C$DW$353       .dwtag  DW_TAG_member
    8381                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$43)
    8382                      .dwattr $C$DW$353, DW_AT_name("input_ptr2")
    8383                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8384                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    8385                      .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8386                      .dwattr $C$DW$353, DW_AT_decl_line(0x33)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  178

    8387                      .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    8388              
    8389              $C$DW$354       .dwtag  DW_TAG_member
    8390                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$43)
    8391                      .dwattr $C$DW$354, DW_AT_name("output_ptr1")
    8392                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8393                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    8394                      .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8395                      .dwattr $C$DW$354, DW_AT_decl_line(0x34)
    8396                      .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    8397              
    8398              $C$DW$355       .dwtag  DW_TAG_member
    8399                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$43)
    8400                      .dwattr $C$DW$355, DW_AT_name("output_ptr2")
    8401                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8402                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    8403                      .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8404                      .dwattr $C$DW$355, DW_AT_decl_line(0x35)
    8405                      .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    8406              
    8407              $C$DW$356       .dwtag  DW_TAG_member
    8408                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    8409                      .dwattr $C$DW$356, DW_AT_name("prev_value")
    8410                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8411                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    8412                      .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8413                      .dwattr $C$DW$356, DW_AT_decl_line(0x36)
    8414                      .dwattr $C$DW$356, DW_AT_decl_column(0x0c)
    8415              
    8416              $C$DW$357       .dwtag  DW_TAG_member
    8417                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    8418                      .dwattr $C$DW$357, DW_AT_name("trig_value")
    8419                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8420                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    8421                      .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8422                      .dwattr $C$DW$357, DW_AT_decl_line(0x37)
    8423                      .dwattr $C$DW$357, DW_AT_decl_column(0x0c)
    8424              
    8425              $C$DW$358       .dwtag  DW_TAG_member
    8426                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$45)
    8427                      .dwattr $C$DW$358, DW_AT_name("status")
    8428                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8429                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    8430                      .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8431                      .dwattr $C$DW$358, DW_AT_decl_line(0x38)
    8432                      .dwattr $C$DW$358, DW_AT_decl_column(0x0a)
    8433              
    8434              $C$DW$359       .dwtag  DW_TAG_member
    8435                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$45)
    8436                      .dwattr $C$DW$359, DW_AT_name("pre_scalar")
    8437                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8438                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    8439                      .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8440                      .dwattr $C$DW$359, DW_AT_decl_line(0x39)
    8441                      .dwattr $C$DW$359, DW_AT_decl_column(0x0a)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_cpu.asm                                        PAGE  179

    8442              
    8443              $C$DW$360       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$45)
    8445                      .dwattr $C$DW$360, DW_AT_name("skip_count")
    8446                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8447                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    8448                      .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8449                      .dwattr $C$DW$360, DW_AT_decl_line(0x3a)
    8450                      .dwattr $C$DW$360, DW_AT_decl_column(0x0a)
    8451              
    8452              $C$DW$361       .dwtag  DW_TAG_member
    8453                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$45)
    8454                      .dwattr $C$DW$361, DW_AT_name("size")
    8455                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8456                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    8457                      .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8458                      .dwattr $C$DW$361, DW_AT_decl_line(0x3b)
    8459                      .dwattr $C$DW$361, DW_AT_decl_column(0x0a)
    8460              
    8461              $C$DW$362       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$45)
    8463                      .dwattr $C$DW$362, DW_AT_name("count")
    8464                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8465                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    8466                      .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/d
    8467                      .dwattr $C$DW$362, DW_AT_decl_line(0x3c)
    8468                      .dwattr $C$DW$362, DW_AT_decl_column(0x0a)
    8469              
