TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:45:01 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/fcl_foc_cpu_dm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              ;       C:\ti\ccs2031\ccs\tools\compiler\ti-cgt-c2000_22.6.2.LTS\bin\opt2000.exe C:\\Users\\Teddy\\AppData\\L

    4058                      .dwattr $C$DW$243, DW_AT_decl_line(0x15d)
    4059                      .dwattr $C$DW$243, DW_AT_decl_column(0x05)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   79

    4060              
    4061              $C$DW$244       .dwtag  DW_TAG_enumerator
    4062                      .dwattr $C$DW$244, DW_AT_name("EPWM_COMP_LOAD_ON_CNTR_ZERO_PERIOD")
    4063                      .dwattr $C$DW$244, DW_AT_const_value(0x02)
    4064                      .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4065                      .dwattr $C$DW$244, DW_AT_decl_line(0x15f)
    4066                      .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    4067              
    4068              $C$DW$245       .dwtag  DW_TAG_enumerator
    4069                      .dwattr $C$DW$245, DW_AT_name("EPWM_COMP_LOAD_FREEZE")
    4070                      .dwattr $C$DW$245, DW_AT_const_value(0x03)
    4071                      .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4072                      .dwattr $C$DW$245, DW_AT_decl_line(0x161)
    4073                      .dwattr $C$DW$245, DW_AT_decl_column(0x05)
    4074              
    4075              $C$DW$246       .dwtag  DW_TAG_enumerator
    4076                      .dwattr $C$DW$246, DW_AT_name("EPWM_COMP_LOAD_ON_SYNC_CNTR_ZERO")
    4077                      .dwattr $C$DW$246, DW_AT_const_value(0x04)
    4078                      .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4079                      .dwattr $C$DW$246, DW_AT_decl_line(0x163)
    4080                      .dwattr $C$DW$246, DW_AT_decl_column(0x05)
    4081              
    4082              $C$DW$247       .dwtag  DW_TAG_enumerator
    4083                      .dwattr $C$DW$247, DW_AT_name("EPWM_COMP_LOAD_ON_SYNC_CNTR_PERIOD")
    4084                      .dwattr $C$DW$247, DW_AT_const_value(0x05)
    4085                      .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4086                      .dwattr $C$DW$247, DW_AT_decl_line(0x165)
    4087                      .dwattr $C$DW$247, DW_AT_decl_column(0x05)
    4088              
    4089              $C$DW$248       .dwtag  DW_TAG_enumerator
    4090                      .dwattr $C$DW$248, DW_AT_name("EPWM_COMP_LOAD_ON_SYNC_CNTR_ZERO_PERIOD")
    4091                      .dwattr $C$DW$248, DW_AT_const_value(0x06)
    4092                      .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4093                      .dwattr $C$DW$248, DW_AT_decl_line(0x167)
    4094                      .dwattr $C$DW$248, DW_AT_decl_column(0x05)
    4095              
    4096              $C$DW$249       .dwtag  DW_TAG_enumerator
    4097                      .dwattr $C$DW$249, DW_AT_name("EPWM_COMP_LOAD_ON_SYNC_ONLY")
    4098                      .dwattr $C$DW$249, DW_AT_const_value(0x08)
    4099                      .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    4100                      .dwattr $C$DW$249, DW_AT_decl_line(0x169)
    4101                      .dwattr $C$DW$249, DW_AT_decl_column(0x05)
    4102              
    4103                      .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4104                      .dwattr $C$DW$T$125, DW_AT_decl_line(0x159)
    4105                      .dwattr $C$DW$T$125, DW_AT_decl_column(0x01)
    4106                      .dwendtag $C$DW$T$125
    4107              
    4108                      .dwendtag $C$DW$TU$125
    4109              
    4110              
    4111              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    4112                      .dwmtype  $C$DW$T$126
    4113              $C$DW$T$126     .dwtag  DW_TAG_typedef
    4114                      .dwattr $C$DW$T$126, DW_AT_name("EPWM_CounterCompareLoadMode")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   80

    4115                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    4116                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib
    4117                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x16a)
    4118                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x03)
    4119              
    4120                      .dwendtag $C$DW$TU$126
    4121              
    4122              
    4123              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    4124                      .dwmtype  $C$DW$T$19
    4125              
    4126              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4127                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    4128              $C$DW$250       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$12)
    4130                      .dwattr $C$DW$250, DW_AT_name("quot")
    4131                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4132                      .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4133                      .dwattr $C$DW$250, DW_AT_decl_line(0x59)
    4134                      .dwattr $C$DW$250, DW_AT_decl_column(0x17)
    4135              
    4136              $C$DW$251       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$12)
    4138                      .dwattr $C$DW$251, DW_AT_name("rem")
    4139                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4140                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4141                      .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4142                      .dwattr $C$DW$251, DW_AT_decl_line(0x59)
    4143                      .dwattr $C$DW$251, DW_AT_decl_column(0x1d)
    4144              
    4145                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4146                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x59)
    4147                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    4148                      .dwendtag $C$DW$T$19
    4149              
    4150                      .dwendtag $C$DW$TU$19
    4151              
    4152              
    4153              $C$DW$TU$128    .dwtag  DW_TAG_type_unit
    4154                      .dwmtype  $C$DW$T$128
    4155              $C$DW$T$128     .dwtag  DW_TAG_typedef
    4156                      .dwattr $C$DW$T$128, DW_AT_name("ldiv_t")
    4157                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$19)
    4158                      .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4159                      .dwattr $C$DW$T$128, DW_AT_decl_line(0x59)
    4160                      .dwattr $C$DW$T$128, DW_AT_decl_column(0x24)
    4161              
    4162                      .dwendtag $C$DW$TU$128
    4163              
    4164              
    4165              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    4166                      .dwmtype  $C$DW$T$20
    4167              
    4168              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4169                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   81

    4170              $C$DW$252       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$14)
    4172                      .dwattr $C$DW$252, DW_AT_name("quot")
    4173                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4174                      .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4175                      .dwattr $C$DW$252, DW_AT_decl_line(0x63)
    4176                      .dwattr $C$DW$252, DW_AT_decl_column(0x1c)
    4177              
    4178              $C$DW$253       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$14)
    4180                      .dwattr $C$DW$253, DW_AT_name("rem")
    4181                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4182                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4183                      .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include/
    4184                      .dwattr $C$DW$253, DW_AT_decl_line(0x63)
    4185                      .dwattr $C$DW$253, DW_AT_decl_column(0x22)
    4186              
    4187                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/include
    4188                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x63)
    4189                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    4190                      .dwendtag $C$DW$T$20
    4191              
    4192                      .dwendtag $C$DW$TU$20
    4193              
    4194              
    4195              $C$DW$TU$131    .dwtag  DW_TAG_type_unit
    4196                      .dwmtype  $C$DW$T$131
    4197              $C$DW$T$131     .dwtag  DW_TAG_typedef
    4198                      .dwattr $C$DW$T$131, DW_AT_name("lldiv_t")
    4199                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$20)
    4200                      .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti/ccs2031/ccs/tools/compiler/ti-cgt-c2000_22.6.2.LTS/includ
    4201                      .dwattr $C$DW$T$131, DW_AT_decl_line(0x63)
    4202                      .dwattr $C$DW$T$131, DW_AT_decl_column(0x29)
    4203              
    4204                      .dwendtag $C$DW$TU$131
    4205              
    4206              
    4207              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    4208                      .dwmtype  $C$DW$T$22
    4209              
    4210              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4211                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0c)
    4212              $C$DW$254       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
    4214                      .dwattr $C$DW$254, DW_AT_name("Freq")
    4215                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4216                      .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4217                      .dwattr $C$DW$254, DW_AT_decl_line(0x29)
    4218                      .dwattr $C$DW$254, DW_AT_decl_column(0x1d)
    4219              
    4220              $C$DW$255       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
    4222                      .dwattr $C$DW$255, DW_AT_name("StepAngleMax")
    4223                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4224                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   82

    4225                      .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4226                      .dwattr $C$DW$255, DW_AT_decl_line(0x2a)
    4227                      .dwattr $C$DW$255, DW_AT_decl_column(0x11)
    4228              
    4229              $C$DW$256       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$21)
    4231                      .dwattr $C$DW$256, DW_AT_name("Angle")
    4232                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4233                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4234                      .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4235                      .dwattr $C$DW$256, DW_AT_decl_line(0x2b)
    4236                      .dwattr $C$DW$256, DW_AT_decl_column(0x11)
    4237              
    4238              $C$DW$257       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    4240                      .dwattr $C$DW$257, DW_AT_name("Gain")
    4241                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4242                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4243                      .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4244                      .dwattr $C$DW$257, DW_AT_decl_line(0x2c)
    4245                      .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    4246              
    4247              $C$DW$258       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$21)
    4249                      .dwattr $C$DW$258, DW_AT_name("Out")
    4250                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4251                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4252                      .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4253                      .dwattr $C$DW$258, DW_AT_decl_line(0x2d)
    4254                      .dwattr $C$DW$258, DW_AT_decl_column(0x11)
    4255              
    4256              $C$DW$259       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$21)
    4258                      .dwattr $C$DW$259, DW_AT_name("Offset")
    4259                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4260                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4261                      .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4262                      .dwattr $C$DW$259, DW_AT_decl_line(0x2e)
    4263                      .dwattr $C$DW$259, DW_AT_decl_column(0x11)
    4264              
    4265                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4266                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x29)
    4267                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4268                      .dwendtag $C$DW$T$22
    4269              
    4270                      .dwendtag $C$DW$TU$22
    4271              
    4272              
    4273              $C$DW$TU$83     .dwtag  DW_TAG_type_unit
    4274                      .dwmtype  $C$DW$T$83
    4275              $C$DW$T$83      .dwtag  DW_TAG_typedef
    4276                      .dwattr $C$DW$T$83, DW_AT_name("RAMPGEN")
    4277                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$22)
    4278                      .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4279                      .dwattr $C$DW$T$83, DW_AT_decl_line(0x2f)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   83

    4280                      .dwattr $C$DW$T$83, DW_AT_decl_column(0x0d)
    4281              
    4282                      .dwendtag $C$DW$TU$83
    4283              
    4284              
    4285              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4286                      .dwmtype  $C$DW$T$25
    4287              
    4288              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4289                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4290              $C$DW$260       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    4292                      .dwattr $C$DW$260, DW_AT_name("TargetValue")
    4293                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4294                      .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4295                      .dwattr $C$DW$260, DW_AT_decl_line(0x2b)
    4296                      .dwattr $C$DW$260, DW_AT_decl_column(0x0f)
    4297              
    4298              $C$DW$261       .dwtag  DW_TAG_member
    4299                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$24)
    4300                      .dwattr $C$DW$261, DW_AT_name("RampDelayMax")
    4301                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4302                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4303                      .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4304                      .dwattr $C$DW$261, DW_AT_decl_line(0x2c)
    4305                      .dwattr $C$DW$261, DW_AT_decl_column(0x0f)
    4306              
    4307              $C$DW$262       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    4309                      .dwattr $C$DW$262, DW_AT_name("RampLowLimit")
    4310                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4311                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4312                      .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4313                      .dwattr $C$DW$262, DW_AT_decl_line(0x2d)
    4314                      .dwattr $C$DW$262, DW_AT_decl_column(0x0f)
    4315              
    4316              $C$DW$263       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
    4318                      .dwattr $C$DW$263, DW_AT_name("RampHighLimit")
    4319                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4320                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4321                      .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4322                      .dwattr $C$DW$263, DW_AT_decl_line(0x2e)
    4323                      .dwattr $C$DW$263, DW_AT_decl_column(0x0f)
    4324              
    4325              $C$DW$264       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$24)
    4327                      .dwattr $C$DW$264, DW_AT_name("RampDelayCount")
    4328                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4329                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4330                      .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4331                      .dwattr $C$DW$264, DW_AT_decl_line(0x2f)
    4332                      .dwattr $C$DW$264, DW_AT_decl_column(0x0c)
    4333              
    4334              $C$DW$265       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   84

    4335                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    4336                      .dwattr $C$DW$265, DW_AT_name("SetpointValue")
    4337                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4338                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4339                      .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4340                      .dwattr $C$DW$265, DW_AT_decl_line(0x30)
    4341                      .dwattr $C$DW$265, DW_AT_decl_column(0x0c)
    4342              
    4343              $C$DW$266       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$24)
    4345                      .dwattr $C$DW$266, DW_AT_name("EqualFlag")
    4346                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4347                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4348                      .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4349                      .dwattr $C$DW$266, DW_AT_decl_line(0x31)
    4350                      .dwattr $C$DW$266, DW_AT_decl_column(0x0c)
    4351              
    4352              $C$DW$267       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
    4354                      .dwattr $C$DW$267, DW_AT_name("Tmp")
    4355                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4356                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4357                      .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4358                      .dwattr $C$DW$267, DW_AT_decl_line(0x32)
    4359                      .dwattr $C$DW$267, DW_AT_decl_column(0x0c)
    4360              
    4361                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4362                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x2a)
    4363                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4364                      .dwendtag $C$DW$T$25
    4365              
    4366                      .dwendtag $C$DW$TU$25
    4367              
    4368              
    4369              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    4370                      .dwmtype  $C$DW$T$84
    4371              $C$DW$T$84      .dwtag  DW_TAG_typedef
    4372                      .dwattr $C$DW$T$84, DW_AT_name("RMPCNTL")
    4373                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$25)
    4374                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4375                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x33)
    4376                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    4377              
    4378                      .dwendtag $C$DW$TU$84
    4379              
    4380              
    4381              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    4382                      .dwmtype  $C$DW$T$26
    4383              
    4384              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4385                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    4386              $C$DW$268       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    4388                      .dwattr $C$DW$268, DW_AT_name("As")
    4389                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   85

    4390                      .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4391                      .dwattr $C$DW$268, DW_AT_decl_line(0x2a)
    4392                      .dwattr $C$DW$268, DW_AT_decl_column(0x1e)
    4393              
    4394              $C$DW$269       .dwtag  DW_TAG_member
    4395                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
    4396                      .dwattr $C$DW$269, DW_AT_name("Bs")
    4397                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4398                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4399                      .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4400                      .dwattr $C$DW$269, DW_AT_decl_line(0x2b)
    4401                      .dwattr $C$DW$269, DW_AT_decl_column(0x12)
    4402              
    4403              $C$DW$270       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    4405                      .dwattr $C$DW$270, DW_AT_name("Cs")
    4406                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4407                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4408                      .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4409                      .dwattr $C$DW$270, DW_AT_decl_line(0x2c)
    4410                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    4411              
    4412              $C$DW$271       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    4414                      .dwattr $C$DW$271, DW_AT_name("Alpha")
    4415                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4416                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4417                      .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4418                      .dwattr $C$DW$271, DW_AT_decl_line(0x2d)
    4419                      .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    4420              
    4421              $C$DW$272       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    4423                      .dwattr $C$DW$272, DW_AT_name("Beta")
    4424                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4425                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4426                      .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4427                      .dwattr $C$DW$272, DW_AT_decl_line(0x2e)
    4428                      .dwattr $C$DW$272, DW_AT_decl_column(0x12)
    4429              
    4430                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4431                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    4432                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    4433                      .dwendtag $C$DW$T$26
    4434              
    4435                      .dwendtag $C$DW$TU$26
    4436              
    4437              
    4438              $C$DW$TU$85     .dwtag  DW_TAG_type_unit
    4439                      .dwmtype  $C$DW$T$85
    4440              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4441                      .dwattr $C$DW$T$85, DW_AT_name("CLARKE")
    4442                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$26)
    4443                      .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4444                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x2f)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   86

    4445                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x09)
    4446              
    4447                      .dwendtag $C$DW$TU$85
    4448              
    4449              
    4450              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    4451                      .dwmtype  $C$DW$T$27
    4452              
    4453              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4454                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    4455              $C$DW$273       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    4457                      .dwattr $C$DW$273, DW_AT_name("Alpha")
    4458                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4459                      .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4460                      .dwattr $C$DW$273, DW_AT_decl_line(0x29)
    4461                      .dwattr $C$DW$273, DW_AT_decl_column(0x1e)
    4462              
    4463              $C$DW$274       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    4465                      .dwattr $C$DW$274, DW_AT_name("Beta")
    4466                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4467                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4468                      .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4469                      .dwattr $C$DW$274, DW_AT_decl_line(0x2a)
    4470                      .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    4471              
    4472              $C$DW$275       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    4474                      .dwattr $C$DW$275, DW_AT_name("Angle")
    4475                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4476                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4477                      .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4478                      .dwattr $C$DW$275, DW_AT_decl_line(0x2b)
    4479                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    4480              
    4481              $C$DW$276       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    4483                      .dwattr $C$DW$276, DW_AT_name("Ds")
    4484                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4485                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4486                      .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4487                      .dwattr $C$DW$276, DW_AT_decl_line(0x2c)
    4488                      .dwattr $C$DW$276, DW_AT_decl_column(0x12)
    4489              
    4490              $C$DW$277       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    4492                      .dwattr $C$DW$277, DW_AT_name("Qs")
    4493                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4494                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4495                      .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4496                      .dwattr $C$DW$277, DW_AT_decl_line(0x2d)
    4497                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    4498              
    4499              $C$DW$278       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   87

    4500                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    4501                      .dwattr $C$DW$278, DW_AT_name("Sine")
    4502                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4503                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4504                      .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4505                      .dwattr $C$DW$278, DW_AT_decl_line(0x2e)
    4506                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    4507              
    4508              $C$DW$279       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    4510                      .dwattr $C$DW$279, DW_AT_name("Cosine")
    4511                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4512                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4513                      .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4514                      .dwattr $C$DW$279, DW_AT_decl_line(0x2f)
    4515                      .dwattr $C$DW$279, DW_AT_decl_column(0x12)
    4516              
    4517                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4518                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    4519                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    4520                      .dwendtag $C$DW$T$27
    4521              
    4522                      .dwendtag $C$DW$TU$27
    4523              
    4524              
    4525              $C$DW$TU$86     .dwtag  DW_TAG_type_unit
    4526                      .dwmtype  $C$DW$T$86
    4527              $C$DW$T$86      .dwtag  DW_TAG_typedef
    4528                      .dwattr $C$DW$T$86, DW_AT_name("PARK")
    4529                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$27)
    4530                      .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4531                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x30)
    4532                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x09)
    4533              
    4534                      .dwendtag $C$DW$TU$86
    4535              
    4536              
    4537              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    4538                      .dwmtype  $C$DW$T$28
    4539              
    4540              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4541                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    4542              $C$DW$280       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    4544                      .dwattr $C$DW$280, DW_AT_name("Alpha")
    4545                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4546                      .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4547                      .dwattr $C$DW$280, DW_AT_decl_line(0x29)
    4548                      .dwattr $C$DW$280, DW_AT_decl_column(0x1e)
    4549              
    4550              $C$DW$281       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    4552                      .dwattr $C$DW$281, DW_AT_name("Beta")
    4553                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4554                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   88

    4555                      .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4556                      .dwattr $C$DW$281, DW_AT_decl_line(0x2a)
    4557                      .dwattr $C$DW$281, DW_AT_decl_column(0x12)
    4558              
    4559              $C$DW$282       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    4561                      .dwattr $C$DW$282, DW_AT_name("Angle")
    4562                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4563                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4564                      .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4565                      .dwattr $C$DW$282, DW_AT_decl_line(0x2b)
    4566                      .dwattr $C$DW$282, DW_AT_decl_column(0x12)
    4567              
    4568              $C$DW$283       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    4570                      .dwattr $C$DW$283, DW_AT_name("Ds")
    4571                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4572                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4573                      .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4574                      .dwattr $C$DW$283, DW_AT_decl_line(0x2c)
    4575                      .dwattr $C$DW$283, DW_AT_decl_column(0x12)
    4576              
    4577              $C$DW$284       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    4579                      .dwattr $C$DW$284, DW_AT_name("Qs")
    4580                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4581                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4582                      .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4583                      .dwattr $C$DW$284, DW_AT_decl_line(0x2d)
    4584                      .dwattr $C$DW$284, DW_AT_decl_column(0x12)
    4585              
    4586              $C$DW$285       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    4588                      .dwattr $C$DW$285, DW_AT_name("Sine")
    4589                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4590                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4591                      .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4592                      .dwattr $C$DW$285, DW_AT_decl_line(0x2e)
    4593                      .dwattr $C$DW$285, DW_AT_decl_column(0x12)
    4594              
    4595              $C$DW$286       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    4597                      .dwattr $C$DW$286, DW_AT_name("Cosine")
    4598                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4599                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4600                      .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4601                      .dwattr $C$DW$286, DW_AT_decl_line(0x2f)
    4602                      .dwattr $C$DW$286, DW_AT_decl_column(0x12)
    4603              
    4604                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4605                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x29)
    4606                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4607                      .dwendtag $C$DW$T$28
    4608              
    4609                      .dwendtag $C$DW$TU$28
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   89

    4610              
    4611              
    4612              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    4613                      .dwmtype  $C$DW$T$87
    4614              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4615                      .dwattr $C$DW$T$87, DW_AT_name("IPARK")
    4616                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$28)
    4617                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4618                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x30)
    4619                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x0b)
    4620              
    4621                      .dwendtag $C$DW$TU$87
    4622              
    4623              
    4624              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    4625                      .dwmtype  $C$DW$T$31
    4626              
    4627              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4628                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x12)
    4629              $C$DW$287       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
    4631                      .dwattr $C$DW$287, DW_AT_name("Ualpha")
    4632                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4633                      .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4634                      .dwattr $C$DW$287, DW_AT_decl_line(0x2b)
    4635                      .dwattr $C$DW$287, DW_AT_decl_column(0x10)
    4636              
    4637              $C$DW$288       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    4639                      .dwattr $C$DW$288, DW_AT_name("Ubeta")
    4640                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4641                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4642                      .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4643                      .dwattr $C$DW$288, DW_AT_decl_line(0x2c)
    4644                      .dwattr $C$DW$288, DW_AT_decl_column(0x10)
    4645              
    4646              $C$DW$289       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$21)
    4648                      .dwattr $C$DW$289, DW_AT_name("Ta")
    4649                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4650                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4651                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4652                      .dwattr $C$DW$289, DW_AT_decl_line(0x2d)
    4653                      .dwattr $C$DW$289, DW_AT_decl_column(0x10)
    4654              
    4655              $C$DW$290       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    4657                      .dwattr $C$DW$290, DW_AT_name("Tb")
    4658                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4659                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4660                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4661                      .dwattr $C$DW$290, DW_AT_decl_line(0x2e)
    4662                      .dwattr $C$DW$290, DW_AT_decl_column(0x10)
    4663              
    4664              $C$DW$291       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   90

    4665                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    4666                      .dwattr $C$DW$291, DW_AT_name("Tc")
    4667                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4668                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4669                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4670                      .dwattr $C$DW$291, DW_AT_decl_line(0x2f)
    4671                      .dwattr $C$DW$291, DW_AT_decl_column(0x10)
    4672              
    4673              $C$DW$292       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    4675                      .dwattr $C$DW$292, DW_AT_name("tmp1")
    4676                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4677                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4678                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4679                      .dwattr $C$DW$292, DW_AT_decl_line(0x30)
    4680                      .dwattr $C$DW$292, DW_AT_decl_column(0x10)
    4681              
    4682              $C$DW$293       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    4684                      .dwattr $C$DW$293, DW_AT_name("tmp2")
    4685                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4686                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4687                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4688                      .dwattr $C$DW$293, DW_AT_decl_line(0x31)
    4689                      .dwattr $C$DW$293, DW_AT_decl_column(0x10)
    4690              
    4691              $C$DW$294       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    4693                      .dwattr $C$DW$294, DW_AT_name("tmp3")
    4694                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4695                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4696                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4697                      .dwattr $C$DW$294, DW_AT_decl_line(0x32)
    4698                      .dwattr $C$DW$294, DW_AT_decl_column(0x10)
    4699              
    4700              $C$DW$295       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$30)
    4702                      .dwattr $C$DW$295, DW_AT_name("VecSector")
    4703                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4704                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4705                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4706                      .dwattr $C$DW$295, DW_AT_decl_line(0x33)
    4707                      .dwattr $C$DW$295, DW_AT_decl_column(0x0b)
    4708              
    4709                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4710                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    4711                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
    4712                      .dwendtag $C$DW$T$31
    4713              
    4714                      .dwendtag $C$DW$TU$31
    4715              
    4716              
    4717              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    4718                      .dwmtype  $C$DW$T$88
    4719              $C$DW$T$88      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   91

    4720                      .dwattr $C$DW$T$88, DW_AT_name("SVGEN")
    4721                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$31)
    4722                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4723                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x34)
    4724                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x04)
    4725              
    4726                      .dwendtag $C$DW$TU$88
    4727              
    4728              
    4729              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    4730                      .dwmtype  $C$DW$T$34
    4731              
    4732              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4733                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    4734              $C$DW$296       .dwtag  DW_TAG_member
    4735                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
    4736                      .dwattr $C$DW$296, DW_AT_name("ElecTheta")
    4737                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4738                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4739                      .dwattr $C$DW$296, DW_AT_decl_line(0x2b)
    4740                      .dwattr $C$DW$296, DW_AT_decl_column(0x12)
    4741              
    4742              $C$DW$297       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$24)
    4744                      .dwattr $C$DW$297, DW_AT_name("DirectionQep")
    4745                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4746                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4747                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4748                      .dwattr $C$DW$297, DW_AT_decl_line(0x2c)
    4749                      .dwattr $C$DW$297, DW_AT_decl_column(0x11)
    4750              
    4751              $C$DW$298       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    4753                      .dwattr $C$DW$298, DW_AT_name("OldElecTheta")
    4754                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4755                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4756                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4757                      .dwattr $C$DW$298, DW_AT_decl_line(0x2d)
    4758                      .dwattr $C$DW$298, DW_AT_decl_column(0x12)
    4759              
    4760              $C$DW$299       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    4762                      .dwattr $C$DW$299, DW_AT_name("Speed")
    4763                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4764                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4765                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4766                      .dwattr $C$DW$299, DW_AT_decl_line(0x2e)
    4767                      .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    4768              
    4769              $C$DW$300       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$24)
    4771                      .dwattr $C$DW$300, DW_AT_name("BaseRpm")
    4772                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4773                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4774                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   92

    4775                      .dwattr $C$DW$300, DW_AT_decl_line(0x2f)
    4776                      .dwattr $C$DW$300, DW_AT_decl_column(0x11)
    4777              
    4778              $C$DW$301       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    4780                      .dwattr $C$DW$301, DW_AT_name("K1")
    4781                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4782                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4783                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4784                      .dwattr $C$DW$301, DW_AT_decl_line(0x30)
    4785                      .dwattr $C$DW$301, DW_AT_decl_column(0x12)
    4786              
    4787              $C$DW$302       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    4789                      .dwattr $C$DW$302, DW_AT_name("K2")
    4790                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4791                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4792                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4793                      .dwattr $C$DW$302, DW_AT_decl_line(0x31)
    4794                      .dwattr $C$DW$302, DW_AT_decl_column(0x12)
    4795              
    4796              $C$DW$303       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    4798                      .dwattr $C$DW$303, DW_AT_name("K3")
    4799                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4800                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4801                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4802                      .dwattr $C$DW$303, DW_AT_decl_line(0x32)
    4803                      .dwattr $C$DW$303, DW_AT_decl_column(0x12)
    4804              
    4805              $C$DW$304       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$33)
    4807                      .dwattr $C$DW$304, DW_AT_name("SpeedRpm")
    4808                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4809                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4810                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4811                      .dwattr $C$DW$304, DW_AT_decl_line(0x33)
    4812                      .dwattr $C$DW$304, DW_AT_decl_column(0x10)
    4813              
    4814              $C$DW$305       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    4816                      .dwattr $C$DW$305, DW_AT_name("Tmp")
    4817                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4818                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4819                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4820                      .dwattr $C$DW$305, DW_AT_decl_line(0x34)
    4821                      .dwattr $C$DW$305, DW_AT_decl_column(0x12)
    4822              
    4823                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4824                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2a)
    4825                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4826                      .dwendtag $C$DW$T$34
    4827              
    4828                      .dwendtag $C$DW$TU$34
    4829              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   93

    4830              
    4831              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    4832                      .dwmtype  $C$DW$T$89
    4833              $C$DW$T$89      .dwtag  DW_TAG_typedef
    4834                      .dwattr $C$DW$T$89, DW_AT_name("SPEED_MEAS_QEP")
    4835                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$34)
    4836                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4837                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x35)
    4838                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x0a)
    4839              
    4840                      .dwendtag $C$DW$TU$89
    4841              
    4842              
    4843              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    4844                      .dwmtype  $C$DW$T$35
    4845              
    4846              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4847                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    4848              $C$DW$306       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    4850                      .dwattr $C$DW$306, DW_AT_name("Ref")
    4851                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4852                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4853                      .dwattr $C$DW$306, DW_AT_decl_line(0x2a)
    4854                      .dwattr $C$DW$306, DW_AT_decl_column(0x1e)
    4855              
    4856              $C$DW$307       .dwtag  DW_TAG_member
    4857                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    4858                      .dwattr $C$DW$307, DW_AT_name("Fbk")
    4859                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4860                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4861                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4862                      .dwattr $C$DW$307, DW_AT_decl_line(0x2b)
    4863                      .dwattr $C$DW$307, DW_AT_decl_column(0x12)
    4864              
    4865              $C$DW$308       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    4867                      .dwattr $C$DW$308, DW_AT_name("Out")
    4868                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4869                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4870                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4871                      .dwattr $C$DW$308, DW_AT_decl_line(0x2c)
    4872                      .dwattr $C$DW$308, DW_AT_decl_column(0x12)
    4873              
    4874              $C$DW$309       .dwtag  DW_TAG_member
    4875                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    4876                      .dwattr $C$DW$309, DW_AT_name("c1")
    4877                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4878                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4879                      .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4880                      .dwattr $C$DW$309, DW_AT_decl_line(0x2d)
    4881                      .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    4882              
    4883              $C$DW$310       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   94

    4885                      .dwattr $C$DW$310, DW_AT_name("c2")
    4886                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4887                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4888                      .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4889                      .dwattr $C$DW$310, DW_AT_decl_line(0x2e)
    4890                      .dwattr $C$DW$310, DW_AT_decl_column(0x12)
    4891              
    4892                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4893                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x2a)
    4894                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4895                      .dwendtag $C$DW$T$35
    4896              
    4897                      .dwendtag $C$DW$TU$35
    4898              
    4899              
    4900              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    4901                      .dwmtype  $C$DW$T$38
    4902              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4903                      .dwattr $C$DW$T$38, DW_AT_name("PID_TERMINALS")
    4904                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    4905                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4906                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    4907                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x07)
    4908              
    4909                      .dwendtag $C$DW$TU$38
    4910              
    4911              
    4912              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    4913                      .dwmtype  $C$DW$T$36
    4914              
    4915              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4916                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    4917              $C$DW$311       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    4919                      .dwattr $C$DW$311, DW_AT_name("Kr")
    4920                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4921                      .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4922                      .dwattr $C$DW$311, DW_AT_decl_line(0x32)
    4923                      .dwattr $C$DW$311, DW_AT_decl_column(0x1e)
    4924              
    4925              $C$DW$312       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    4927                      .dwattr $C$DW$312, DW_AT_name("Kp")
    4928                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4929                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4930                      .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4931                      .dwattr $C$DW$312, DW_AT_decl_line(0x33)
    4932                      .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    4933              
    4934              $C$DW$313       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    4936                      .dwattr $C$DW$313, DW_AT_name("Ki")
    4937                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4938                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4939                      .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   95

    4940                      .dwattr $C$DW$313, DW_AT_decl_line(0x34)
    4941                      .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    4942              
    4943              $C$DW$314       .dwtag  DW_TAG_member
    4944                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    4945                      .dwattr $C$DW$314, DW_AT_name("Kd")
    4946                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4947                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4948                      .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4949                      .dwattr $C$DW$314, DW_AT_decl_line(0x35)
    4950                      .dwattr $C$DW$314, DW_AT_decl_column(0x12)
    4951              
    4952              $C$DW$315       .dwtag  DW_TAG_member
    4953                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    4954                      .dwattr $C$DW$315, DW_AT_name("Km")
    4955                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4956                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4957                      .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4958                      .dwattr $C$DW$315, DW_AT_decl_line(0x36)
    4959                      .dwattr $C$DW$315, DW_AT_decl_column(0x12)
    4960              
    4961              $C$DW$316       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    4963                      .dwattr $C$DW$316, DW_AT_name("Umax")
    4964                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4965                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4966                      .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4967                      .dwattr $C$DW$316, DW_AT_decl_line(0x37)
    4968                      .dwattr $C$DW$316, DW_AT_decl_column(0x12)
    4969              
    4970              $C$DW$317       .dwtag  DW_TAG_member
    4971                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    4972                      .dwattr $C$DW$317, DW_AT_name("Umin")
    4973                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4974                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4975                      .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    4976                      .dwattr $C$DW$317, DW_AT_decl_line(0x38)
    4977                      .dwattr $C$DW$317, DW_AT_decl_column(0x12)
    4978              
    4979                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4980                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x32)
    4981                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4982                      .dwendtag $C$DW$T$36
    4983              
    4984                      .dwendtag $C$DW$TU$36
    4985              
    4986              
    4987              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    4988                      .dwmtype  $C$DW$T$39
    4989              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4990                      .dwattr $C$DW$T$39, DW_AT_name("PID_PARAMETERS")
    4991                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    4992                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    4993                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x39)
    4994                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x07)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   96

    4995              
    4996                      .dwendtag $C$DW$TU$39
    4997              
    4998              
    4999              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    5000                      .dwmtype  $C$DW$T$37
    5001              
    5002              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5003                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    5004              $C$DW$318       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    5006                      .dwattr $C$DW$318, DW_AT_name("up")
    5007                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5008                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5009                      .dwattr $C$DW$318, DW_AT_decl_line(0x3b)
    5010                      .dwattr $C$DW$318, DW_AT_decl_column(0x1e)
    5011              
    5012              $C$DW$319       .dwtag  DW_TAG_member
    5013                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    5014                      .dwattr $C$DW$319, DW_AT_name("ui")
    5015                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5016                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5017                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5018                      .dwattr $C$DW$319, DW_AT_decl_line(0x3c)
    5019                      .dwattr $C$DW$319, DW_AT_decl_column(0x12)
    5020              
    5021              $C$DW$320       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    5023                      .dwattr $C$DW$320, DW_AT_name("ud")
    5024                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5025                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5026                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5027                      .dwattr $C$DW$320, DW_AT_decl_line(0x3d)
    5028                      .dwattr $C$DW$320, DW_AT_decl_column(0x12)
    5029              
    5030              $C$DW$321       .dwtag  DW_TAG_member
    5031                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    5032                      .dwattr $C$DW$321, DW_AT_name("v1")
    5033                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5034                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5035                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5036                      .dwattr $C$DW$321, DW_AT_decl_line(0x3e)
    5037                      .dwattr $C$DW$321, DW_AT_decl_column(0x12)
    5038              
    5039              $C$DW$322       .dwtag  DW_TAG_member
    5040                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    5041                      .dwattr $C$DW$322, DW_AT_name("i1")
    5042                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5043                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5044                      .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5045                      .dwattr $C$DW$322, DW_AT_decl_line(0x3f)
    5046                      .dwattr $C$DW$322, DW_AT_decl_column(0x12)
    5047              
    5048              $C$DW$323       .dwtag  DW_TAG_member
    5049                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   97

    5050                      .dwattr $C$DW$323, DW_AT_name("d1")
    5051                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5052                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5053                      .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5054                      .dwattr $C$DW$323, DW_AT_decl_line(0x40)
    5055                      .dwattr $C$DW$323, DW_AT_decl_column(0x12)
    5056              
    5057              $C$DW$324       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    5059                      .dwattr $C$DW$324, DW_AT_name("d2")
    5060                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5061                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5062                      .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5063                      .dwattr $C$DW$324, DW_AT_decl_line(0x41)
    5064                      .dwattr $C$DW$324, DW_AT_decl_column(0x12)
    5065              
    5066              $C$DW$325       .dwtag  DW_TAG_member
    5067                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    5068                      .dwattr $C$DW$325, DW_AT_name("w1")
    5069                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5070                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5071                      .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5072                      .dwattr $C$DW$325, DW_AT_decl_line(0x42)
    5073                      .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    5074              
    5075                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5076                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    5077                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5078                      .dwendtag $C$DW$T$37
    5079              
    5080                      .dwendtag $C$DW$TU$37
    5081              
    5082              
    5083              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5084                      .dwmtype  $C$DW$T$40
    5085              $C$DW$T$40      .dwtag  DW_TAG_typedef
    5086                      .dwattr $C$DW$T$40, DW_AT_name("PID_DATA")
    5087                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    5088                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5089                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    5090                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x07)
    5091              
    5092                      .dwendtag $C$DW$TU$40
    5093              
    5094              
    5095              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    5096                      .dwmtype  $C$DW$T$41
    5097              
    5098              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5099                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    5100              $C$DW$326       .dwtag  DW_TAG_member
    5101                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$38)
    5102                      .dwattr $C$DW$326, DW_AT_name("term")
    5103                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5104                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   98

    5105                      .dwattr $C$DW$326, DW_AT_decl_line(0x46)
    5106                      .dwattr $C$DW$326, DW_AT_decl_column(0x21)
    5107              
    5108              $C$DW$327       .dwtag  DW_TAG_member
    5109                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$39)
    5110                      .dwattr $C$DW$327, DW_AT_name("param")
    5111                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5112                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5113                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5114                      .dwattr $C$DW$327, DW_AT_decl_line(0x47)
    5115                      .dwattr $C$DW$327, DW_AT_decl_column(0x16)
    5116              
    5117              $C$DW$328       .dwtag  DW_TAG_member
    5118                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$40)
    5119                      .dwattr $C$DW$328, DW_AT_name("data")
    5120                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5121                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5122                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5123                      .dwattr $C$DW$328, DW_AT_decl_line(0x48)
    5124                      .dwattr $C$DW$328, DW_AT_decl_column(0x11)
    5125              
    5126                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5127                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    5128                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5129                      .dwendtag $C$DW$T$41
    5130              
    5131                      .dwendtag $C$DW$TU$41
    5132              
    5133              
    5134              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    5135                      .dwmtype  $C$DW$T$91
    5136              $C$DW$T$91      .dwtag  DW_TAG_typedef
    5137                      .dwattr $C$DW$T$91, DW_AT_name("PID_CONTROLLER")
    5138                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$41)
    5139                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5140                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x49)
    5141                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x07)
    5142              
    5143                      .dwendtag $C$DW$TU$91
    5144              
    5145              
    5146              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5147                      .dwmtype  $C$DW$T$42
    5148              
    5149              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5150                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
    5151              $C$DW$329       .dwtag  DW_TAG_member
    5152                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    5153                      .dwattr $C$DW$329, DW_AT_name("Ref")
    5154                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5155                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5156                      .dwattr $C$DW$329, DW_AT_decl_line(0x2a)
    5157                      .dwattr $C$DW$329, DW_AT_decl_column(0x1e)
    5158              
    5159              $C$DW$330       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE   99

    5160                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    5161                      .dwattr $C$DW$330, DW_AT_name("Fbk")
    5162                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5163                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5164                      .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5165                      .dwattr $C$DW$330, DW_AT_decl_line(0x2b)
    5166                      .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    5167              
    5168              $C$DW$331       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    5170                      .dwattr $C$DW$331, DW_AT_name("Out")
    5171                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5172                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5173                      .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5174                      .dwattr $C$DW$331, DW_AT_decl_line(0x2c)
    5175                      .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    5176              
    5177              $C$DW$332       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    5179                      .dwattr $C$DW$332, DW_AT_name("Kp")
    5180                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5181                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5182                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5183                      .dwattr $C$DW$332, DW_AT_decl_line(0x2d)
    5184                      .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    5185              
    5186              $C$DW$333       .dwtag  DW_TAG_member
    5187                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    5188                      .dwattr $C$DW$333, DW_AT_name("Ki")
    5189                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5190                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5191                      .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5192                      .dwattr $C$DW$333, DW_AT_decl_line(0x2e)
    5193                      .dwattr $C$DW$333, DW_AT_decl_column(0x12)
    5194              
    5195              $C$DW$334       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    5197                      .dwattr $C$DW$334, DW_AT_name("Umax")
    5198                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5199                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5200                      .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5201                      .dwattr $C$DW$334, DW_AT_decl_line(0x2f)
    5202                      .dwattr $C$DW$334, DW_AT_decl_column(0x12)
    5203              
    5204              $C$DW$335       .dwtag  DW_TAG_member
    5205                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    5206                      .dwattr $C$DW$335, DW_AT_name("Umin")
    5207                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5208                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5209                      .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5210                      .dwattr $C$DW$335, DW_AT_decl_line(0x30)
    5211                      .dwattr $C$DW$335, DW_AT_decl_column(0x12)
    5212              
    5213              $C$DW$336       .dwtag  DW_TAG_member
    5214                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE  100

    5215                      .dwattr $C$DW$336, DW_AT_name("up")
    5216                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5217                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5218                      .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5219                      .dwattr $C$DW$336, DW_AT_decl_line(0x31)
    5220                      .dwattr $C$DW$336, DW_AT_decl_column(0x12)
    5221              
    5222              $C$DW$337       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    5224                      .dwattr $C$DW$337, DW_AT_name("ui")
    5225                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5226                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5227                      .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5228                      .dwattr $C$DW$337, DW_AT_decl_line(0x32)
    5229                      .dwattr $C$DW$337, DW_AT_decl_column(0x12)
    5230              
    5231              $C$DW$338       .dwtag  DW_TAG_member
    5232                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    5233                      .dwattr $C$DW$338, DW_AT_name("v1")
    5234                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5235                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5236                      .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5237                      .dwattr $C$DW$338, DW_AT_decl_line(0x33)
    5238                      .dwattr $C$DW$338, DW_AT_decl_column(0x12)
    5239              
    5240              $C$DW$339       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$21)
    5242                      .dwattr $C$DW$339, DW_AT_name("i1")
    5243                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5244                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5245                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5246                      .dwattr $C$DW$339, DW_AT_decl_line(0x34)
    5247                      .dwattr $C$DW$339, DW_AT_decl_column(0x12)
    5248              
    5249              $C$DW$340       .dwtag  DW_TAG_member
    5250                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$21)
    5251                      .dwattr $C$DW$340, DW_AT_name("w1")
    5252                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5253                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5254                      .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/m
    5255                      .dwattr $C$DW$340, DW_AT_decl_line(0x35)
    5256                      .dwattr $C$DW$340, DW_AT_decl_column(0x12)
    5257              
    5258                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5259                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
    5260                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    5261                      .dwendtag $C$DW$T$42
    5262              
    5263                      .dwendtag $C$DW$TU$42
    5264              
    5265              
    5266              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    5267                      .dwmtype  $C$DW$T$92
    5268              $C$DW$T$92      .dwtag  DW_TAG_typedef
    5269                      .dwattr $C$DW$T$92, DW_AT_name("PI_CONTROLLER")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE  101

    5270                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$42)
    5271                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilities/
    5272                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x36)
    5273                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x07)
    5274              
    5275                      .dwendtag $C$DW$TU$92
    5276              
    5277              
    5278              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    5279                      .dwmtype  $C$DW$T$44
    5280              
    5281              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5282                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTFLG_BITS")
    5283                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5284              $C$DW$341       .dwtag  DW_TAG_member
    5285                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$43)
    5286                      .dwattr $C$DW$341, DW_AT_name("ADCINT1")
    5287                      .dwattr $C$DW$341, DW_AT_bit_offset(0x0f)
    5288                      .dwattr $C$DW$341, DW_AT_bit_size(0x01)
    5289                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5290                      .dwattr $C$DW$341, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5291                      .dwattr $C$DW$341, DW_AT_decl_line(0x60)
    5292                      .dwattr $C$DW$341, DW_AT_decl_column(0x0c)
    5293              
    5294              $C$DW$342       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$43)
    5296                      .dwattr $C$DW$342, DW_AT_name("ADCINT2")
    5297                      .dwattr $C$DW$342, DW_AT_bit_offset(0x0e)
    5298                      .dwattr $C$DW$342, DW_AT_bit_size(0x01)
    5299                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5300                      .dwattr $C$DW$342, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5301                      .dwattr $C$DW$342, DW_AT_decl_line(0x61)
    5302                      .dwattr $C$DW$342, DW_AT_decl_column(0x0c)
    5303              
    5304              $C$DW$343       .dwtag  DW_TAG_member
    5305                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$43)
    5306                      .dwattr $C$DW$343, DW_AT_name("ADCINT3")
    5307                      .dwattr $C$DW$343, DW_AT_bit_offset(0x0d)
    5308                      .dwattr $C$DW$343, DW_AT_bit_size(0x01)
    5309                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5310                      .dwattr $C$DW$343, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5311                      .dwattr $C$DW$343, DW_AT_decl_line(0x62)
    5312                      .dwattr $C$DW$343, DW_AT_decl_column(0x0c)
    5313              
    5314              $C$DW$344       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$43)
    5316                      .dwattr $C$DW$344, DW_AT_name("ADCINT4")
    5317                      .dwattr $C$DW$344, DW_AT_bit_offset(0x0c)
    5318                      .dwattr $C$DW$344, DW_AT_bit_size(0x01)
    5319                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5320                      .dwattr $C$DW$344, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5321                      .dwattr $C$DW$344, DW_AT_decl_line(0x63)
    5322                      .dwattr $C$DW$344, DW_AT_decl_column(0x0c)
    5323              
    5324              $C$DW$345       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE  102

    5325                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$43)
    5326                      .dwattr $C$DW$345, DW_AT_name("rsvd1")
    5327                      .dwattr $C$DW$345, DW_AT_bit_offset(0x00)
    5328                      .dwattr $C$DW$345, DW_AT_bit_size(0x0c)
    5329                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5330                      .dwattr $C$DW$345, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5331                      .dwattr $C$DW$345, DW_AT_decl_line(0x64)
    5332                      .dwattr $C$DW$345, DW_AT_decl_column(0x0c)
    5333              
    5334                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    5335                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x5f)
    5336                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    5337                      .dwendtag $C$DW$T$44
    5338              
    5339                      .dwendtag $C$DW$TU$44
    5340              
    5341              
    5342              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    5343                      .dwmtype  $C$DW$T$45
    5344              
    5345              $C$DW$T$45      .dwtag  DW_TAG_union_type
    5346                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTFLG_REG")
    5347                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    5348              $C$DW$346       .dwtag  DW_TAG_member
    5349                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$43)
    5350                      .dwattr $C$DW$346, DW_AT_name("all")
    5351                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5352                      .dwattr $C$DW$346, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5353                      .dwattr $C$DW$346, DW_AT_decl_line(0x68)
    5354                      .dwattr $C$DW$346, DW_AT_decl_column(0x0d)
    5355              
    5356              $C$DW$347       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$44)
    5358                      .dwattr $C$DW$347, DW_AT_name("bit")
    5359                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5360                      .dwattr $C$DW$347, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_supp
    5361                      .dwattr $C$DW$347, DW_AT_decl_line(0x69)
    5362                      .dwattr $C$DW$347, DW_AT_decl_column(0x1d)
    5363              
    5364                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:\ti\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\device_sup
    5365                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x67)
    5366                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x07)
    5367                      .dwendtag $C$DW$T$45
    5368              
    5369                      .dwendtag $C$DW$TU$45
    5370              
    5371              
    5372              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    5373                      .dwmtype  $C$DW$T$97
    5374              $C$DW$348       .dwtag  DW_TAG_TI_far_type
    5375                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$45)
    5376              
    5377              $C$DW$T$97      .dwtag  DW_TAG_volatile_type
    5378                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$348)
    5379              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_foc_cpu_dm.asm                                                   PAGE  103

    5380                      .dwendtag $C$DW$TU$97
    5381              
    5382              
    5383              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    5384                      .dwmtype  $C$DW$T$98
    5385              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    5386                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    5387                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    5388              
    5389                      .dwendtag $C$DW$TU$98
    5390              
    5391              
    5392              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    5393                      .dwmtype  $C$DW$T$48
    5394              
    5395              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5396                      .dwattr $C$DW$T$48, DW_AT_name("EQEP_REGS")
    5397                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x38)
