TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:45:03 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5893                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5894                      .dwendtag $C$DW$T$24
    5895              
    5896                      .dwendtag $C$DW$TU$24
    5897              
    5898              
    5899              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5900                      .dwmtype  $C$DW$T$25
    5901              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5902                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5903                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5904                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/
    5905                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x81)
    5906                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5907              
    5908                      .dwendtag $C$DW$TU$25
    5909              
    5910              
    5911              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5912                      .dwmtype  $C$DW$T$26
    5913              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  115

    5914              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5915                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5916              $C$DW$338       .dwtag  DW_TAG_enumerator
    5917                      .dwattr $C$DW$338, DW_AT_name("GPIO_QUAL_SYNC")
    5918                      .dwattr $C$DW$338, DW_AT_const_value(0x00)
    5919                      .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5920                      .dwattr $C$DW$338, DW_AT_decl_line(0x98)
    5921                      .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    5922              
    5923              $C$DW$339       .dwtag  DW_TAG_enumerator
    5924                      .dwattr $C$DW$339, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5925                      .dwattr $C$DW$339, DW_AT_const_value(0x01)
    5926                      .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5927                      .dwattr $C$DW$339, DW_AT_decl_line(0x99)
    5928                      .dwattr $C$DW$339, DW_AT_decl_column(0x05)
    5929              
    5930              $C$DW$340       .dwtag  DW_TAG_enumerator
    5931                      .dwattr $C$DW$340, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5932                      .dwattr $C$DW$340, DW_AT_const_value(0x02)
    5933                      .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5934                      .dwattr $C$DW$340, DW_AT_decl_line(0x9a)
    5935                      .dwattr $C$DW$340, DW_AT_decl_column(0x05)
    5936              
    5937              $C$DW$341       .dwtag  DW_TAG_enumerator
    5938                      .dwattr $C$DW$341, DW_AT_name("GPIO_QUAL_ASYNC")
    5939                      .dwattr $C$DW$341, DW_AT_const_value(0x03)
    5940                      .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/f
    5941                      .dwattr $C$DW$341, DW_AT_decl_line(0x9b)
    5942                      .dwattr $C$DW$341, DW_AT_decl_column(0x05)
    5943              
    5944                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/
    5945                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x97)
    5946                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5947                      .dwendtag $C$DW$T$26
    5948              
    5949                      .dwendtag $C$DW$TU$26
    5950              
    5951              
    5952              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5953                      .dwmtype  $C$DW$T$27
    5954              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5955                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5956                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5957                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/driverlib/
    5958                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x9c)
    5959                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5960              
    5961                      .dwendtag $C$DW$TU$27
    5962              
    5963              
    5964              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5965                      .dwmtype  $C$DW$T$23
    5966              
    5967              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5968                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  116

    5969              $C$DW$342       .dwtag  DW_TAG_member
    5970                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    5971                      .dwattr $C$DW$342, DW_AT_name("h_magVect")
    5972                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5973                      .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    5974                      .dwattr $C$DW$342, DW_AT_decl_line(0x40)
    5975                      .dwattr $C$DW$342, DW_AT_decl_column(0x10)
    5976              
    5977              $C$DW$343       .dwtag  DW_TAG_member
    5978                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    5979                      .dwattr $C$DW$343, DW_AT_name("h_phaseVect")
    5980                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5981                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5982                      .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    5983                      .dwattr $C$DW$343, DW_AT_decl_line(0x41)
    5984                      .dwattr $C$DW$343, DW_AT_decl_column(0x10)
    5985              
    5986              $C$DW$344       .dwtag  DW_TAG_member
    5987                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    5988                      .dwattr $C$DW$344, DW_AT_name("gh_magVect")
    5989                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5990                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5991                      .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    5992                      .dwattr $C$DW$344, DW_AT_decl_line(0x42)
    5993                      .dwattr $C$DW$344, DW_AT_decl_column(0x10)
    5994              
    5995              $C$DW$345       .dwtag  DW_TAG_member
    5996                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    5997                      .dwattr $C$DW$345, DW_AT_name("gh_phaseVect")
    5998                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5999                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6000                      .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6001                      .dwattr $C$DW$345, DW_AT_decl_line(0x43)
    6002                      .dwattr $C$DW$345, DW_AT_decl_column(0x10)
    6003              
    6004              $C$DW$346       .dwtag  DW_TAG_member
    6005                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    6006                      .dwattr $C$DW$346, DW_AT_name("cl_magVect")
    6007                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6008                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6009                      .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6010                      .dwattr $C$DW$346, DW_AT_decl_line(0x44)
    6011                      .dwattr $C$DW$346, DW_AT_decl_column(0x10)
    6012              
    6013              $C$DW$347       .dwtag  DW_TAG_member
    6014                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    6015                      .dwattr $C$DW$347, DW_AT_name("cl_phaseVect")
    6016                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6017                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6018                      .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6019                      .dwattr $C$DW$347, DW_AT_decl_line(0x45)
    6020                      .dwattr $C$DW$347, DW_AT_decl_column(0x10)
    6021              
    6022              $C$DW$348       .dwtag  DW_TAG_member
    6023                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  117

    6024                      .dwattr $C$DW$348, DW_AT_name("freqVect")
    6025                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6026                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6027                      .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6028                      .dwattr $C$DW$348, DW_AT_decl_line(0x46)
    6029                      .dwattr $C$DW$348, DW_AT_decl_column(0x10)
    6030              
    6031              $C$DW$349       .dwtag  DW_TAG_member
    6032                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    6033                      .dwattr $C$DW$349, DW_AT_name("amplitude")
    6034                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6035                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6036                      .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6037                      .dwattr $C$DW$349, DW_AT_decl_line(0x47)
    6038                      .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    6039              
    6040              $C$DW$350       .dwtag  DW_TAG_member
    6041                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    6042                      .dwattr $C$DW$350, DW_AT_name("isrFreq")
    6043                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6044                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6045                      .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6046                      .dwattr $C$DW$350, DW_AT_decl_line(0x48)
    6047                      .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    6048              
    6049              $C$DW$351       .dwtag  DW_TAG_member
    6050                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    6051                      .dwattr $C$DW$351, DW_AT_name("freqStart")
    6052                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6053                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6054                      .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6055                      .dwattr $C$DW$351, DW_AT_decl_line(0x49)
    6056                      .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    6057              
    6058              $C$DW$352       .dwtag  DW_TAG_member
    6059                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    6060                      .dwattr $C$DW$352, DW_AT_name("freqStep")
    6061                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6062                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6063                      .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6064                      .dwattr $C$DW$352, DW_AT_decl_line(0x4a)
    6065                      .dwattr $C$DW$352, DW_AT_decl_column(0x0f)
    6066              
    6067              $C$DW$353       .dwtag  DW_TAG_member
    6068                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$22)
    6069                      .dwattr $C$DW$353, DW_AT_name("start")
    6070                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6071                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6072                      .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6073                      .dwattr $C$DW$353, DW_AT_decl_line(0x4b)
    6074                      .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    6075              
    6076              $C$DW$354       .dwtag  DW_TAG_member
    6077                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$22)
    6078                      .dwattr $C$DW$354, DW_AT_name("state")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  118

    6079                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6080                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6081                      .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6082                      .dwattr $C$DW$354, DW_AT_decl_line(0x4c)
    6083                      .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    6084              
    6085              $C$DW$355       .dwtag  DW_TAG_member
    6086                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    6087                      .dwattr $C$DW$355, DW_AT_name("status")
    6088                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6089                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6090                      .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6091                      .dwattr $C$DW$355, DW_AT_decl_line(0x4d)
    6092                      .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    6093              
    6094              $C$DW$356       .dwtag  DW_TAG_member
    6095                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
    6096                      .dwattr $C$DW$356, DW_AT_name("vecLength")
    6097                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6098                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6099                      .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6100                      .dwattr $C$DW$356, DW_AT_decl_line(0x4e)
    6101                      .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    6102              
    6103              $C$DW$357       .dwtag  DW_TAG_member
    6104                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
    6105                      .dwattr $C$DW$357, DW_AT_name("freqIndex")
    6106                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6107                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6108                      .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6109                      .dwattr $C$DW$357, DW_AT_decl_line(0x4f)
    6110                      .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    6111              
    6112              $C$DW$358       .dwtag  DW_TAG_member
    6113                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$22)
    6114                      .dwattr $C$DW$358, DW_AT_name("storeH")
    6115                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6116                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6117                      .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6118                      .dwattr $C$DW$358, DW_AT_decl_line(0x50)
    6119                      .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    6120              
    6121              $C$DW$359       .dwtag  DW_TAG_member
    6122                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$22)
    6123                      .dwattr $C$DW$359, DW_AT_name("storeGH")
    6124                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6125                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6126                      .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6127                      .dwattr $C$DW$359, DW_AT_decl_line(0x51)
    6128                      .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    6129              
    6130              $C$DW$360       .dwtag  DW_TAG_member
    6131                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$22)
    6132                      .dwattr $C$DW$360, DW_AT_name("storeCL")
    6133                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  119

    6134                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6135                      .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6136                      .dwattr $C$DW$360, DW_AT_decl_line(0x52)
    6137                      .dwattr $C$DW$360, DW_AT_decl_column(0x0d)
    6138              
    6139              $C$DW$361       .dwtag  DW_TAG_member
    6140                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$22)
    6141                      .dwattr $C$DW$361, DW_AT_name("speed")
    6142                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6143                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6144                      .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    6145                      .dwattr $C$DW$361, DW_AT_decl_line(0x53)
    6146                      .dwattr $C$DW$361, DW_AT_decl_column(0x0d)
    6147              
    6148                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/inclu
    6149                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    6150                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    6151                      .dwendtag $C$DW$T$23
    6152              
    6153                      .dwendtag $C$DW$TU$23
    6154              
    6155              
    6156              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    6157                      .dwmtype  $C$DW$T$28
    6158              $C$DW$T$28      .dwtag  DW_TAG_typedef
    6159                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    6160                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    6161                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/inclu
    6162                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    6163                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    6164              
    6165                      .dwendtag $C$DW$TU$28
    6166              
    6167              
    6168              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6169                      .dwmtype  $C$DW$T$29
    6170              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    6171                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6172                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    6173              
    6174                      .dwendtag $C$DW$TU$29
    6175              
    6176              
    6177              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    6178                      .dwmtype  $C$DW$T$30
    6179              $C$DW$362       .dwtag  DW_TAG_TI_far_type
    6180                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    6181              
    6182              $C$DW$T$30      .dwtag  DW_TAG_const_type
    6183                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$362)
    6184              
    6185                      .dwendtag $C$DW$TU$30
    6186              
    6187              
    6188              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:03 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  120

    6189                      .dwmtype  $C$DW$T$2
    6190              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6191                      .dwattr $C$DW$T$2, DW_AT_name("void")
    6192              
    6193                      .dwendtag $C$DW$TU$2
    6194              
    6195              
    6196              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    6197                      .dwmtype  $C$DW$T$51
    6198              
    6199              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    6200                      .dwendtag $C$DW$T$51
    6201              
    6202                      .dwendtag $C$DW$TU$51
    6203              
    6204              
    6205              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    6206                      .dwmtype  $C$DW$T$52
    6207              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    6208                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    6209                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    6210              
    6211                      .dwendtag $C$DW$TU$52
    6212              
    6213              
