TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Wed Dec 10 14:45:01 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --diag_wrap=off --float_support=fpu32 --hll_source=on --idiv_support=idiv0 
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/sfra_gui.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Teddy\Documents\GitHub\2512_TI_DSP_BLDC_MotorControlSDK\1.
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")

    2971                      .gmember  ".text:__isnormall"
    2972                      .endgroup
    2973                      .group    "__relaxed_atan2f", 1
    2974                      .gmember  ".text:__relaxed_atan2f"
    2975                      .endgroup
    2976                      .group    "__relaxed_atanf", 1
    2977                      .gmember  ".text:__relaxed_atanf"
    2978                      .endgroup
    2979                      .group    "__relaxed_cosf", 1
    2980                      .gmember  ".text:__relaxed_cosf"
    2981                      .endgroup
    2982                      .group    "__relaxed_expf", 1
    2983                      .gmember  ".text:__relaxed_expf"
    2984                      .endgroup
    2985                      .group    "__relaxed_fmaxf", 1
    2986                      .gmember  ".text:__relaxed_fmaxf"
    2987                      .endgroup
    2988                      .group    "__relaxed_fminf", 1
    2989                      .gmember  ".text:__relaxed_fminf"
    2990                      .endgroup
    2991                      .group    "__relaxed_fmodf", 1
    2992                      .gmember  ".text:__relaxed_fmodf"
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   59

    2993                      .endgroup
    2994                      .group    "__relaxed_log2f", 1
    2995                      .gmember  ".text:__relaxed_log2f"
    2996                      .endgroup
    2997                      .group    "__relaxed_logf", 1
    2998                      .gmember  ".text:__relaxed_logf"
    2999                      .endgroup
    3000                      .group    "__relaxed_powf", 1
    3001                      .gmember  ".text:__relaxed_powf"
    3002                      .endgroup
    3003                      .group    "__relaxed_sinf", 1
    3004                      .gmember  ".text:__relaxed_sinf"
    3005                      .endgroup
    3006                      .group    "__relaxed_sqrtf", 1
    3007                      .gmember  ".text:__relaxed_sqrtf"
    3008                      .endgroup
    3009                      .group    "__signbit", 1
    3010                      .gmember  ".text:__signbit"
    3011                      .endgroup
    3012                      .group    "__signbitf", 1
    3013                      .gmember  ".text:__signbitf"
    3014                      .endgroup
    3015                      .group    "__signbitl", 1
    3016                      .gmember  ".text:__signbitl"
    3017                      .endgroup
    3018              
    3019              
    3020              ;***************************************************************
    3021              ;* BUILD ATTRIBUTES                                            *
    3022              ;***************************************************************
    3023                      .battr "c28xabi", Tag_File, 1, Tag_float_args(1)
    3024                      .battr "c28xabi", Tag_File, 1, Tag_double_args(1)
    3025                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3026              
    3027              ;***************************************************************
    3028              ;* DWARF CIE ENTRIES                                           *
    3029              ;***************************************************************
    3030              
    3031              $C$DW$CIE       .dwcie 26
    3032                      .dwcfi  cfa_register, 20
    3033                      .dwcfi  cfa_offset, 0
    3034                      .dwcfi  same_value, 28
    3035                      .dwcfi  same_value, 6
    3036                      .dwcfi  same_value, 7
    3037                      .dwcfi  same_value, 8
    3038                      .dwcfi  same_value, 9
    3039                      .dwcfi  same_value, 10
    3040                      .dwcfi  same_value, 11
    3041                      .dwcfi  same_value, 59
    3042                      .dwcfi  same_value, 63
    3043                      .dwcfi  same_value, 67
    3044                      .dwcfi  same_value, 71
    3045                      .dwendentry
    3046                      .dwendtag $C$DW$CU
    3047              
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   60

    3048              
    3049              ;***************************************************************
    3050              ;* TYPE INFORMATION                                            *
    3051              ;***************************************************************
    3052              
    3053              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    3054                      .dwmtype  $C$DW$T$23
    3055              
    3056              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3057                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    3058              $C$DW$206       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    3060                      .dwattr $C$DW$206, DW_AT_name("h_magVect")
    3061                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3062                      .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3063                      .dwattr $C$DW$206, DW_AT_decl_line(0x40)
    3064                      .dwattr $C$DW$206, DW_AT_decl_column(0x10)
    3065              
    3066              $C$DW$207       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    3068                      .dwattr $C$DW$207, DW_AT_name("h_phaseVect")
    3069                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3070                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3071                      .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3072                      .dwattr $C$DW$207, DW_AT_decl_line(0x41)
    3073                      .dwattr $C$DW$207, DW_AT_decl_column(0x10)
    3074              
    3075              $C$DW$208       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    3077                      .dwattr $C$DW$208, DW_AT_name("gh_magVect")
    3078                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3079                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3080                      .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3081                      .dwattr $C$DW$208, DW_AT_decl_line(0x42)
    3082                      .dwattr $C$DW$208, DW_AT_decl_column(0x10)
    3083              
    3084              $C$DW$209       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    3086                      .dwattr $C$DW$209, DW_AT_name("gh_phaseVect")
    3087                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3088                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3089                      .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3090                      .dwattr $C$DW$209, DW_AT_decl_line(0x43)
    3091                      .dwattr $C$DW$209, DW_AT_decl_column(0x10)
    3092              
    3093              $C$DW$210       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    3095                      .dwattr $C$DW$210, DW_AT_name("cl_magVect")
    3096                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3097                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3098                      .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3099                      .dwattr $C$DW$210, DW_AT_decl_line(0x44)
    3100                      .dwattr $C$DW$210, DW_AT_decl_column(0x10)
    3101              
    3102              $C$DW$211       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   61

    3103                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    3104                      .dwattr $C$DW$211, DW_AT_name("cl_phaseVect")
    3105                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3106                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3107                      .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3108                      .dwattr $C$DW$211, DW_AT_decl_line(0x45)
    3109                      .dwattr $C$DW$211, DW_AT_decl_column(0x10)
    3110              
    3111              $C$DW$212       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    3113                      .dwattr $C$DW$212, DW_AT_name("freqVect")
    3114                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3115                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3116                      .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3117                      .dwattr $C$DW$212, DW_AT_decl_line(0x46)
    3118                      .dwattr $C$DW$212, DW_AT_decl_column(0x10)
    3119              
    3120              $C$DW$213       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3122                      .dwattr $C$DW$213, DW_AT_name("amplitude")
    3123                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3124                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3125                      .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3126                      .dwattr $C$DW$213, DW_AT_decl_line(0x47)
    3127                      .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3128              
    3129              $C$DW$214       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3131                      .dwattr $C$DW$214, DW_AT_name("isrFreq")
    3132                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3133                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3134                      .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3135                      .dwattr $C$DW$214, DW_AT_decl_line(0x48)
    3136                      .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3137              
    3138              $C$DW$215       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3140                      .dwattr $C$DW$215, DW_AT_name("freqStart")
    3141                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3142                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3143                      .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3144                      .dwattr $C$DW$215, DW_AT_decl_line(0x49)
    3145                      .dwattr $C$DW$215, DW_AT_decl_column(0x0f)
    3146              
    3147              $C$DW$216       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3149                      .dwattr $C$DW$216, DW_AT_name("freqStep")
    3150                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3151                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3152                      .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3153                      .dwattr $C$DW$216, DW_AT_decl_line(0x4a)
    3154                      .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    3155              
    3156              $C$DW$217       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   62

    3158                      .dwattr $C$DW$217, DW_AT_name("start")
    3159                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3160                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3161                      .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3162                      .dwattr $C$DW$217, DW_AT_decl_line(0x4b)
    3163                      .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    3164              
    3165              $C$DW$218       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    3167                      .dwattr $C$DW$218, DW_AT_name("state")
    3168                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3169                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3170                      .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3171                      .dwattr $C$DW$218, DW_AT_decl_line(0x4c)
    3172                      .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    3173              
    3174              $C$DW$219       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    3176                      .dwattr $C$DW$219, DW_AT_name("status")
    3177                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3178                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3179                      .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3180                      .dwattr $C$DW$219, DW_AT_decl_line(0x4d)
    3181                      .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    3182              
    3183              $C$DW$220       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    3185                      .dwattr $C$DW$220, DW_AT_name("vecLength")
    3186                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3187                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3188                      .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3189                      .dwattr $C$DW$220, DW_AT_decl_line(0x4e)
    3190                      .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    3191              
    3192              $C$DW$221       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    3194                      .dwattr $C$DW$221, DW_AT_name("freqIndex")
    3195                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3196                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3197                      .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3198                      .dwattr $C$DW$221, DW_AT_decl_line(0x4f)
    3199                      .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    3200              
    3201              $C$DW$222       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    3203                      .dwattr $C$DW$222, DW_AT_name("storeH")
    3204                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3205                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3206                      .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3207                      .dwattr $C$DW$222, DW_AT_decl_line(0x50)
    3208                      .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    3209              
    3210              $C$DW$223       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    3212                      .dwattr $C$DW$223, DW_AT_name("storeGH")
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   63

    3213                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3214                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3215                      .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3216                      .dwattr $C$DW$223, DW_AT_decl_line(0x51)
    3217                      .dwattr $C$DW$223, DW_AT_decl_column(0x0d)
    3218              
    3219              $C$DW$224       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    3221                      .dwattr $C$DW$224, DW_AT_name("storeCL")
    3222                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3223                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3224                      .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3225                      .dwattr $C$DW$224, DW_AT_decl_line(0x52)
    3226                      .dwattr $C$DW$224, DW_AT_decl_column(0x0d)
    3227              
    3228              $C$DW$225       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
    3230                      .dwattr $C$DW$225, DW_AT_name("speed")
    3231                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3232                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3233                      .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/includ
    3234                      .dwattr $C$DW$225, DW_AT_decl_line(0x53)
    3235                      .dwattr $C$DW$225, DW_AT_decl_column(0x0d)
    3236              
    3237                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/inclu
    3238                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    3239                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    3240                      .dwendtag $C$DW$T$23
    3241              
    3242                      .dwendtag $C$DW$TU$23
    3243              
    3244              
    3245              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    3246                      .dwmtype  $C$DW$T$24
    3247              $C$DW$T$24      .dwtag  DW_TAG_typedef
    3248                      .dwattr $C$DW$T$24, DW_AT_name("SFRA_F32")
    3249                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3250                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/inclu
    3251                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x54)
    3252                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x02)
    3253              
    3254                      .dwendtag $C$DW$TU$24
    3255              
    3256              
    3257              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    3258                      .dwmtype  $C$DW$T$25
    3259              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3260                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    3261                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    3262              
    3263                      .dwendtag $C$DW$TU$25
    3264              
    3265              
    3266              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    3267                      .dwmtype  $C$DW$T$2
TMS320C2000 Assembler PC v22.6.2 Wed Dec 10 14:45:02 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   64

    3268              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3269                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3270              
    3271                      .dwendtag $C$DW$TU$2
    3272              
    3273              
    3274              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    3275                      .dwmtype  $C$DW$T$4
    3276              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3277                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3278                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3279                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3280              
    3281                      .dwendtag $C$DW$TU$4
    3282              
    3283              
    3284              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    3285                      .dwmtype  $C$DW$T$5
    3286              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3287                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3288                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3289                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3290              
    3291                      .dwendtag $C$DW$TU$5
    3292              
    3293              
    3294              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    3295                      .dwmtype  $C$DW$T$6
    3296              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3297                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
